[{"text":"MACD Strategy This MACD strategy I m about to show you is one of the highest win rate strategies you can possibly do in trading. It is very easy to use, works in almost every single market, and most importantly, it makes money. Well enough talk, lets get straight into it. The MACD or the Moving Average Convergence Divergence is one the most popular technical indicators used by traders. Essentially this indicator uses moving averages to find trends in markets, and its pretty damn good at it too. Now, if you re an experienced trader, you ve probably used or heard about the MACD indicator before. But the MACD indicator by itself, is just alright to be honest. So, make sure you watch this full video to see how I pair it with some other indicators to make it perform so much better. First things first, let s add the MACD indicator to our chart. To do that . Now that we have the MACD indicator added, lets make sure we know how the MACD actually works. The MACD is made up of 4 different components. The MACD line, the signal line, the histogram, and the zero line. The MACD line which is the blue line, in most cases is usually a 12 day moving average, the signal line, which is the orange line, is usually a 26 day moving average. Next we have the histogram, which represents the difference between the MACD line and the signal line. So for example, the smaller the space between the two lines, the smaller the histogram gets. The bigger the space, the bigger it gets. You can also see once the MACD line crosses above the signal line, the histogram turns green and if the MACD line crosses below the signal line it turns red. And finally, we have the zero line, which basically represents the center of the MACD indicator. Now that we know the 4 components, lets make sure we know how to them. The MACD indicator is insanely good at finding trends in markets. How you can tell if a chart is about to have an upward trend is by looking for a cross upwards between the MACD line and the Signal line. For example, here the macd crosses above the signal line indicating the chart is in upward momentum, and here the macd crosses below the signal line indicating it s in downward momentum. You can also use the histogram to indicate how much momentum there actually is. So, if the histogram is getting bigger, that means there is an increase in momentum. If it s getting smaller, there is a decrease in momentum. So how you want to use this indicator is by when the lines cross upward, but only if they cross below the zero line. If they cross and its above the zero line you wouldn t enter a trade. It s the same thing with shorting, you only enter a short trade if the lines are crossing downward, and is ABOVE the zero line. So as you can see, this indicator is extremely easy to use. But the problem most traders encounter, is that they use this indicator by itself. Let me tell you why this doesn t work. The MACD indicator works extremely well if the market is in a trend. So for example here, the MACD indicator is doing a great job indicating when the price is about to move upward. Because the chart is in an upward trend. But here, the price is in a downward trend, but the MACD is still signaling to buy long even though the price is going down. To fix this issue, for example if we are trading long, we only want to trade if the market is in an uptrend. You never want to trade against the trend, because the odds will always be against you. So, an easy way to figure out if the market is in an uptrend. You simply just need to add a 200 day moving average. To do this Once we have the indicator added, you ll just see a single line. If the price is above that line, the market is in an uptrend. If the price is below that line, the market is in a downtrend. So after learning that we only want to buy when the market is in uptrend, if we re going long of course. if we put all this together, we buy if the macd lines cross below the zero line mark, and the current price also above the 200 day moving average. This will guarantee that you are only trading when the market is in an uptrend, which is a very power combo. If you wanted to short, you would just do the exact opposite. Make sure the price is below the 200 day average and the macd lines are crossing downward above the zero line. So as an example we would enter a long trade right here, because the macd lines are crossing upward below the zero line, and the current price is above the 200 day moving average. Now what I like to do is set a stop loss below the 200 day moving average, so the 200 day almost acts as a wall that the price has to break through to hit my stop loss. Then I like to have a 1.5 profit ratio for my profit target mark. So as you can see for this example, the strategy worked exactly as we wanted it to, and we made money. But, we can still make this trading strategy even better. This macd strategy combined with a 200 day moving average, works extremely well only if there is a lot of price movement. Where the strategy starts to get kind of iffy and giving false signals, is when the chart starts going sideways and losing momentum. So as you can see here the chart is moving sideways and lost almost all of its upward momentum and the macd is giving lots of false signals. If you traded here, odds are you probably lost money. To fix this issue we have to combine the MACD with price action. To do this, identify a key support or resistance where price hits and bounces. So as you can see the prices goes down, hits this point, and reverses upwards. The next step is to wait for the price to hit the same key level again. Once it does, we are expecting the price to bounce off this support and go upwards just like it did before. But as a clear note, just because we made the support and it bounced off this before, doesn t mean that it will always do that again. It can easily break through the support and drop lower if it has enough momentum. If we want to make sure the price is about to change in momentum, that s when we bring out the MACD indicator. So what you would do, is make sure the price above the 200 day moving average, once the price hits the support made, wait for the lines on the MACD to cross below the zero level, and that s when you enter the trade. So I just revealed to you how the MACD, 200 day moving average, and using support and resistances levels gives and extremely high win rate with this strategy. All I ask for in return is if you to take 2 seconds of your time and like this video. If you want to stay up to date with my future strategies make to subscribe. Because in my next video, I m planning to release a strategy that works even ever better than this MACD strategy. Hope you guys learned something from this video, and I ll see you guys next time. this macd strategy I'm about to show you is one of the highest win rate strategies you can possibly do in trading it is very easy to use Works in almost every single market and most importantly it makes money well enough talk let's get straight into it the macd or the moving average convergence Divergence is one of the most popular technical indicators used by Traders essentially this indicator uses moving averages to find Trends in the market and it's pretty damn good at it too now if you're an experienced Trader you've probably used or heard about this macd indicator before but the macd indicator by itself is just all right to be honest so make sure you watch this full video to see how I pair it with some other indicators to make it perform so much better first things first let's add the macd indicator to our chart to do that you're going to go to trading view or whatever chart website you prefer and then you're going to go up here to the indicators tab type in macd and click this top one now that we have the macd indicator added let's make sure we know how the macd actually works the macd is made up of four different components the macd line the signal line the histogram and the zero line the macd line which is the Blue Line in most cases is usually a 12-day moving average the signal line which is the orange line is usually a 26 day moving average next we have the histogram which represents the difference between the Mac D line and the signal line so for example the smaller the space between the two lines the smaller the the histogram gets the bigger the space the bigger it gets you can also see once the macd line crosses above the signal line the histogram turns green and if the macd line crosses below the signal line it turns red and finally we have the zero line which basically represents the center of the macd indicator now that we know the four components let's make sure we know how to use them the macd indicator is insanely good at finding Trends and markets how you can tell if a chart is about to have an upward trend is by looking for a cross upwards between the macd line and the signal line for example here the macd crosses above the signal line indicating the chart is in an upward momentum and here the macd crosses below the signal line indicating it's in a downward momentum you can also use the histogram to indicate how much momentum there actually is so if the histogram is getting bigger that means there is an increase in momentum if it's getting smaller there's a decrease in momentum so how you actually want to use this indicator is by when the line crosses upwards but only if they cross below the zero line if they cross and it's above the zero line you wouldn't want to enter the trade it's the same concept with shorting you only want to enter a short trade if the lines are crossing downward and it's above the zero line so as you can see just by watching this this indicator is extremely easy to use but the problem most Traders encounter is that they only use this indicator by itself let me tell you why this doesn't work the macd indicator works extremely well if the market is in a trend so for example here the macd indicator is doing a great job indicating when the price is about to move upward because the chart is in an upward Trend but here the price is in a downward Trend but the macd is still signaling to buy long even though the price is going down a simple fix to this issue for example if we're Trading long we only want to trade if the market is in an uptrend you never want to trade against the trend because the odds will always be against you so so an easy way to figure out if the market is in an uptrend you simply just need to add a 200 day moving average to do this you're going to go to the indicators tab on trading View and type in EMA which stands for exponential moving average or moving average exponential click the top one then you're going to go here click the settings of the EMA and you're going to go to inputs and change the length to 200 which is going to make it a 200 exponential moving average then you're going to go to style and I like to make mine red but you can make it whatever color you want once we have the EMA indicator added you'll see just a single line if the price is above that line the market is in an uptrend if the price is below that line the market is in a downtrend so after learning that we only want to trade in an uptrend Market if we're going long so all we have to do is put it all together we buy if the macd line crosses below the zero line Mark and the current price also is above the 200 day moving app average this will guarantee that you are only trading when the market is in an uptrend which is a very powerful combo if you wanted a short you would do the exact opposite so make sure the price is below the 200 day moving average and the macd lines are crossing downward above the zero line so as an example we would want to enter a long trade right here because the macd lines are crossing upwards below the zero line and the current price is above the 200 day moving average now what I like to do is set a stop loss below below the 200 day moving average so the 200 day almost acts as a wall that the price has to break through to hit the stop loss then I like to have a 1.5 profit ratio for my profit Target Mark so as you can see for this example the strategy worked exactly as we wanted it to and we made money but we can still make this trading strategy even better this macd strategy combined with a 200-day moving average works extremely well only if there's a lot of price movement where the strategy starts to get kind of iffy and giving false signals is when the chart starts going sideways and losing momentum so as you can see here the chart is moving sideways and lost almost all of its upward momentum and the macd is giving lots of false signals if you traded here odds are you probably lost money to fix this issue we have to combine the macd with price action to do this identify a key support or resistance where the price hits and bounces so as you can see the price goes down hits this point and reverses is upwards the next step is to wait for that price to hit the same key level again and once it does we expecting the price to bounce off the support and go upwards just like it did before but as a clear side note just because we made this support and it bounced off this before doesn't mean that it'll always do it again it can easily break through the support and drop lower if it has enough momentum if we want to make sure the price is about to change in momentum that's when we bring out the macd indicator so what you would do is make sure the price is above the 200 day moving average once the price hits the support made wait for the lines on the macd to cross below the zero level and that's when you enter the trade I just revealed to you how the macd 200 day moving average and using support and resistance levels gives an extremely high win rate with this strategy all I ask in return is if you can take 2 seconds of your time and like this video if you want to stay up to date with my future strategies make sure to subscribe because in my next video I'm planning to release a strategy that works even even better than this macd strategy hope you guys all learned something from this video and I'll see you guys next time","id":"rf_EQvubKlk","title":"BEST MACD Trading Strategy [86% Win Rate]","microformat":{"playerMicroformatRenderer":{"thumbnail":{"thumbnails":[{"url":"https://i.ytimg.com/vi/rf_EQvubKlk/maxresdefault.jpg","width":1280,"height":720}]},"embed":{"iframeUrl":"https://www.youtube.com/embed/rf_EQvubKlk","width":1280,"height":720},"title":{"simpleText":"BEST MACD Trading Strategy [86% Win Rate]"},"description":{"simpleText":"The MACD indicator. Probably one of the most well known / widely used indicators in the trading world. By itself, not that powerful. When paired with other indicators, easily one of the highest win rate strategies you can choose from.\n\nIn this video I show you exactly how to pair the MACD trading strategy with others to get an insanely easy to use trading strategy that profits extremely well.\n\nIf you learned something new, leave a like.\n\nâ–º My Private Buy/Sell Indicator: https://tradinglab.ai/\n\nâ–º My Trading Discord: https://discord.gg/nHqDYZuuK2\n\nâ–º Scanz (News Screener I Use): http://www.scanz.com?fpr=tradinglab\n\nâ–º TradingView (Chart Software I Use): https://www.tradingview.com/?offer_id=10&aff_id=28566\n\nâ–º Get 2 FREE stocks valued up to $1850 (when you deposit $100): https://act.webull.com/on/A6BoDyk5xy2A/zbk/inviteUs/main\n\nâ–º Get up to $250 in Crypto Currency: https://blockfi.com/?ref=ca9f3260\n\nðŸ”´ Subscribe for more videos just like this: https://www.youtube.com/channel/UCCbv0qixG-cyokxEY3kELtg?sub_confirmation=1\n\nFollow TradingLab: \n===============================\nðŸ“¸ - IG: https://www.instagram.com/tradinglabofficial/\nðŸ“± - TikTok: https://www.tiktok.com/@thetradinglab\n\n*None of this is meant to be construed as investment advice, it's for entertainment purposes only. The links above include affiliate commissions or referrals. I'm part of an affiliate network and I receive compensation from partnering websites. The video is accurate as of the posting date but may not be accurate in the future."},"lengthSeconds":"426","ownerProfileUrl":"http://www.youtube.com/@TradingLabOfficial","externalChannelId":"UCCbv0qixG-cyokxEY3kELtg","isFamilySafe":true,"availableCountries":["AD","AE","AF","AG","AI","AL","AM","AO","AQ","AR","AS","AT","AU","AW","AX","AZ","BA","BB","BD","BE","BF","BG","BH","BI","BJ","BL","BM","BN","BO","BQ","BR","BS","BT","BV","BW","BY","BZ","CA","CC","CD","CF","CG","CH","CI","CK","CL","CM","CN","CO","CR","CU","CV","CW","CX","CY","CZ","DE","DJ","DK","DM","DO","DZ","EC","EE","EG","EH","ER","ES","ET","FI","FJ","FK","FM","FO","FR","GA","GB","GD","GE","GF","GG","GH","GI","GL","GM","GN","GP","GQ","GR","GS","GT","GU","GW","GY","HK","HM","HN","HR","HT","HU","ID","IE","IL","IM","IN","IO","IQ","IR","IS","IT","JE","JM","JO","JP","KE","KG","KH","KI","KM","KN","KP","KR","KW","KY","KZ","LA","LB","LC","LI","LK","LR","LS","LT","LU","LV","LY","MA","MC","MD","ME","MF","MG","MH","MK","ML","MM","MN","MO","MP","MQ","MR","MS","MT","MU","MV","MW","MX","MY","MZ","NA","NC","NE","NF","NG","NI","NL","NO","NP","NR","NU","NZ","OM","PA","PE","PF","PG","PH","PK","PL","PM","PN","PR","PS","PT","PW","PY","QA","RE","RO","RS","RU","RW","SA","SB","SC","SD","SE","SG","SH","SI","SJ","SK","SL","SM","SN","SO","SR","SS","ST","SV","SX","SY","SZ","TC","TD","TF","TG","TH","TJ","TK","TL","TM","TN","TO","TR","TT","TV","TW","TZ","UA","UG","UM","US","UY","UZ","VA","VC","VE","VG","VI","VN","VU","WF","WS","YE","YT","ZA","ZM","ZW"],"isUnlisted":false,"hasYpcMetadata":false,"viewCount":"3328652","category":"Education","publishDate":"2021-10-03T11:43:07-07:00","ownerChannelName":"TradingLab","uploadDate":"2021-10-03T11:43:07-07:00","isShortsEligible":false,"externalVideoId":"rf_EQvubKlk","likeCount":"148195"}},"tracks":[{"language":"English","transcript":[{"text":"MACD Strategy\nThis MACD strategy I m","start":"0","dur":"1.52"},{"text":"about to show you is one of the highest win rateÂ \nstrategies you can possibly do in trading. It","start":"1.52","dur":"5.52"},{"text":"is very easy to use, works in almost every singleÂ \nmarket, and most importantly, it makes money. Well","start":"7.04","dur":"5.28"},{"text":"enough talk, lets get straight into it.\nThe MACD or the Moving Average Convergence","start":"12.32","dur":"4.32"},{"text":"Divergence is one the most popular technicalÂ \nindicators used by traders. Essentially this","start":"16.64","dur":"5.04"},{"text":"indicator uses moving averages to find trendsÂ \nin markets, and its pretty damn good at it too.","start":"21.68","dur":"5.44"},{"text":"Now, if you re an experiencedÂ \ntrader, you ve probably used or","start":"27.12","dur":"3.2"},{"text":"heard about the MACD indicator before.\nBut the MACD indicator by itself, is just","start":"30.32","dur":"5.2"},{"text":"alright to be honest. So, make sure you watch thisÂ \nfull video to see how I pair it with some other","start":"35.52","dur":"4.8"},{"text":"indicators to make it perform so much better.\nFirst things first, let s add the MACD indicator","start":"40.32","dur":"5.68"},{"text":"to our chart.\nTo do that .","start":"46","dur":"2.28"},{"text":"Now that we have the MACD indicator added, letsÂ \nmake sure we know how the MACD actually works.","start":"58.16","dur":"5.04"},{"text":"The MACD is made up of 4 differentÂ \ncomponents. The MACD line, the signal line,","start":"63.2","dur":"4.88"},{"text":"the histogram, and the zero line.\nThe MACD line which is the blue line,","start":"68.08","dur":"4.16"},{"text":"in most cases is usually a 12 day movingÂ \naverage, the signal line, which is the","start":"72.24","dur":"4.64"},{"text":"orange line, is usually a 26 day moving average.\nNext we have the histogram, which represents the","start":"76.88","dur":"5.76"},{"text":"difference between the MACD line and the signalÂ \nline. So for example, the smaller the space","start":"82.64","dur":"5.28"},{"text":"between the two lines, the smaller the histogramÂ \ngets. The bigger the space, the bigger it gets.","start":"87.92","dur":"5.12"},{"text":"You can also see once the MACDÂ \nline crosses above the signal line,","start":"93.04","dur":"4"},{"text":"the histogram turns green and if the MACD lineÂ \ncrosses below the signal line it turns red.","start":"97.04","dur":"5.44"},{"text":"And finally, we have the zeroÂ \nline, which basically represents","start":"102.48","dur":"3.44"},{"text":"the center of the MACD indicator.\nNow that we know the 4 components,","start":"105.92","dur":"3.92"},{"text":"lets make sure we know how to them.\nThe MACD indicator is insanely good at","start":"109.84","dur":"5.04"},{"text":"finding trends in markets. How you can tellÂ \nif a chart is about to have an upward trend","start":"114.88","dur":"4.56"},{"text":"is by looking for a cross upwards betweenÂ \nthe MACD line and the Signal line.","start":"119.44","dur":"4.32"},{"text":"For example, here the macd crosses above theÂ \nsignal line indicating the chart is in upward","start":"123.76","dur":"5.36"},{"text":"momentum, and here the macd crosses below theÂ \nsignal line indicating it s in downward momentum.","start":"129.12","dur":"5.68"},{"text":"You can also use the histogram to indicateÂ \nhow much momentum there actually is. So,","start":"134.8","dur":"4.96"},{"text":"if the histogram is getting bigger, that meansÂ \nthere is an increase in momentum. If it s","start":"139.76","dur":"4.32"},{"text":"getting smaller, there is a decrease in momentum.\nSo how you want to use this indicator is by when","start":"144.08","dur":"5.52"},{"text":"the lines cross upward, but only if they crossÂ \nbelow the zero line. If they cross and its above","start":"149.6","dur":"6"},{"text":"the zero line you wouldn t enter a trade.\nIt s the same thing with shorting,","start":"155.6","dur":"4.56"},{"text":"you only enter a short trade if the lines areÂ \ncrossing downward, and is ABOVE the zero line.","start":"160.16","dur":"5.44"},{"text":"So as you can see, this indicator is extremelyÂ \neasy to use. But the problem most traders","start":"165.6","dur":"6.8"},{"text":"encounter, is that they use this indicator byÂ \nitself. Let me tell you why this doesn t work.","start":"172.4","dur":"5.6"},{"text":"The MACD indicator works extremely well ifÂ \nthe market is in a trend. So for example here,","start":"178","dur":"5.92"},{"text":"the MACD indicator is doing a great jobÂ \nindicating when the price is about to move","start":"183.92","dur":"4.48"},{"text":"upward. Because the chart is in an upward trend.\nBut here, the price is in a downward trend,","start":"188.4","dur":"5.12"},{"text":"but the MACD is still signaling to buyÂ \nlong even though the price is going down.","start":"193.52","dur":"4.88"},{"text":"To fix this issue, for example ifÂ \nwe are trading long, we only want","start":"199.36","dur":"3.28"},{"text":"to trade if the market is in an uptrend.Â \nYou never want to trade against the trend,","start":"202.64","dur":"4.64"},{"text":"because the odds will always be against you.\nSo, an easy way to figure out if the market","start":"207.28","dur":"4.64"},{"text":"is in an uptrend. You simply justÂ \nneed to add a 200 day moving average.","start":"211.92","dur":"4.48"},{"text":"To do this\nOnce we have the indicator added,","start":"216.4","dur":"29.76"},{"text":"you ll just see a single line.\nIf the price is above that line,","start":"246.16","dur":"3.6"},{"text":"the market is in an uptrend. If the price isÂ \nbelow that line, the market is in a downtrend.","start":"249.76","dur":"5.36"},{"text":"So after learning that we only want toÂ \nbuy when the market is in uptrend, if","start":"255.12","dur":"3.6"},{"text":"we re going long of course.\nif we put all this together,","start":"258.72","dur":"3.12"},{"text":"we buy if the macd lines cross below theÂ \nzero line mark, and the current price","start":"261.84","dur":"5.28"},{"text":"also above the 200 day moving average.\nThis will guarantee that you are only","start":"267.12","dur":"4.88"},{"text":"trading when the market is in anÂ \nuptrend, which is a very power combo.","start":"272","dur":"4.24"},{"text":"If you wanted to short, you would just doÂ \nthe exact opposite. Make sure the price is","start":"276.24","dur":"4.08"},{"text":"below the 200 day average and the macd linesÂ \nare crossing downward above the zero line.","start":"280.32","dur":"5.28"},{"text":"So as an example we would enter a long tradeÂ \nright here, because the macd lines are crossing","start":"285.6","dur":"6.08"},{"text":"upward below the zero line, and the currentÂ \nprice is above the 200 day moving average.","start":"291.68","dur":"5.12"},{"text":"Now what I like to do is set a stop loss below theÂ \n200 day moving average, so the 200 day almost acts","start":"296.8","dur":"6.24"},{"text":"as a wall that the price has to break throughÂ \nto hit my stop loss. Then I like to have a 1.5","start":"303.04","dur":"5.68"},{"text":"profit ratio for my profit target mark.\nSo as you can see for this example,","start":"308.72","dur":"4.32"},{"text":"the strategy worked exactly as weÂ \nwanted it to, and we made money.","start":"313.04","dur":"4.08"},{"text":"But, we can still make thisÂ \ntrading strategy even better.","start":"317.12","dur":"3.92"},{"text":"This macd strategy combined with a 200 day movingÂ \naverage, works extremely well only if there is a","start":"321.04","dur":"6"},{"text":"lot of price movement. Where the strategy startsÂ \nto get kind of iffy and giving false signals,","start":"327.04","dur":"4.88"},{"text":"is when the chart starts goingÂ \nsideways and losing momentum.","start":"331.92","dur":"3.28"},{"text":"So as you can see here the chart is movingÂ \nsideways and lost almost all of its upward","start":"335.2","dur":"4.72"},{"text":"momentum and the macd is giving lotsÂ \nof false signals. If you traded here,","start":"339.92","dur":"4.32"},{"text":"odds are you probably lost money.\nTo fix this issue we have to combine the","start":"344.24","dur":"4.08"},{"text":"MACD with price action. To do this, identifyÂ \na key support or resistance where price hits","start":"348.32","dur":"6.56"},{"text":"and bounces. So as you can see the prices goesÂ \ndown, hits this point, and reverses upwards.","start":"354.88","dur":"5.52"},{"text":"The next step is to wait for the price toÂ \nhit the same key level again. Once it does,","start":"360.4","dur":"5.12"},{"text":"we are expecting the price to bounce off thisÂ \nsupport and go upwards just like it did before.","start":"365.52","dur":"5.12"},{"text":"But as a clear note, just because we madeÂ \nthe support and it bounced off this before,","start":"370.64","dur":"5.44"},{"text":"doesn t mean that it will always do that again.Â \nIt can easily break through the support and drop","start":"376.08","dur":"4.8"},{"text":"lower if it has enough momentum.\nIf we want to make sure the price","start":"380.88","dur":"3.36"},{"text":"is about to change in momentum, that sÂ \nwhen we bring out the MACD indicator.","start":"384.24","dur":"4.32"},{"text":"So what you would do, is make sure theÂ \nprice above the 200 day moving average,","start":"388.56","dur":"4.32"},{"text":"once the price hits the support made, wait for theÂ \nlines on the MACD to cross below the zero level,","start":"392.88","dur":"5.28"},{"text":"and that s when you enter the trade.\nSo I just revealed to you how the MACD,","start":"398.16","dur":"3.68"},{"text":"200 day moving average, and using supportÂ \nand resistances levels gives and extremely","start":"401.84","dur":"4.4"},{"text":"high win rate with this strategy.\nAll I ask for in return is if you","start":"406.24","dur":"3.2"},{"text":"to take 2 seconds of your time and likeÂ \nthis video. If you want to stay up to","start":"409.44","dur":"3.6"},{"text":"date with my future strategies make toÂ \nsubscribe. Because in my next video,","start":"413.04","dur":"3.92"},{"text":"I m planning to release a strategy that worksÂ \neven ever better than this MACD strategy.","start":"416.96","dur":"4.64"},{"text":"Hope you guys learned something from thisÂ \nvideo, and I ll see you guys next time.","start":"421.6","dur":"3.84"}]},{"language":"English (auto-generated)","transcript":[{"text":"this macd strategy I'm about to show you","start":"0.12","dur":"3.96"},{"text":"is one of the highest win rate","start":"2.56","dur":"3.68"},{"text":"strategies you can possibly do in","start":"4.08","dur":"4.599"},{"text":"trading it is very easy to use Works in","start":"6.24","dur":"4.24"},{"text":"almost every single market and most","start":"8.679","dur":"4"},{"text":"importantly it makes money well enough","start":"10.48","dur":"4.399"},{"text":"talk let's get straight into it the macd","start":"12.679","dur":"4.081"},{"text":"or the moving average convergence","start":"14.879","dur":"3.961"},{"text":"Divergence is one of the most popular","start":"16.76","dur":"4.359"},{"text":"technical indicators used by Traders","start":"18.84","dur":"4.199"},{"text":"essentially this indicator uses moving","start":"21.119","dur":"4.08"},{"text":"averages to find Trends in the market","start":"23.039","dur":"4.4"},{"text":"and it's pretty damn good at it too now","start":"25.199","dur":"4.041"},{"text":"if you're an experienced Trader you've","start":"27.439","dur":"4.121"},{"text":"probably used or heard about this macd","start":"29.24","dur":"4.8"},{"text":"indicator before but the macd indicator","start":"31.56","dur":"5.24"},{"text":"by itself is just all right to be honest","start":"34.04","dur":"4.48"},{"text":"so make sure you watch this full video","start":"36.8","dur":"3.56"},{"text":"to see how I pair it with some other","start":"38.52","dur":"4.64"},{"text":"indicators to make it perform so much","start":"40.36","dur":"4.679"},{"text":"better first things first let's add the","start":"43.16","dur":"4.16"},{"text":"macd indicator to our chart to do that","start":"45.039","dur":"3.801"},{"text":"you're going to go to trading view or","start":"47.32","dur":"3.96"},{"text":"whatever chart website you prefer and","start":"48.84","dur":"3.68"},{"text":"then you're going to go up here to the","start":"51.28","dur":"4.759"},{"text":"indicators tab type in","start":"52.52","dur":"6.12"},{"text":"macd and click this top one now that we","start":"56.039","dur":"4.721"},{"text":"have the macd indicator added let's make","start":"58.64","dur":"4.68"},{"text":"sure we know how the macd actually works","start":"60.76","dur":"4.479"},{"text":"the macd is made up of four different","start":"63.32","dur":"4.88"},{"text":"components the macd line the signal line","start":"65.239","dur":"5.56"},{"text":"the histogram and the zero line the macd","start":"68.2","dur":"4.599"},{"text":"line which is the Blue Line in most","start":"70.799","dur":"4.68"},{"text":"cases is usually a 12-day moving average","start":"72.799","dur":"4.96"},{"text":"the signal line which is the orange line","start":"75.479","dur":"5.041"},{"text":"is usually a 26 day moving average next","start":"77.759","dur":"4.841"},{"text":"we have the histogram which represents","start":"80.52","dur":"4.04"},{"text":"the difference between the Mac D line","start":"82.6","dur":"4.44"},{"text":"and the signal line so for example the","start":"84.56","dur":"4.64"},{"text":"smaller the space between the two lines","start":"87.04","dur":"4.2"},{"text":"the smaller the the histogram gets the","start":"89.2","dur":"4.08"},{"text":"bigger the space the bigger it gets you","start":"91.24","dur":"4.72"},{"text":"can also see once the macd line crosses","start":"93.28","dur":"4.6"},{"text":"above the signal line the histogram","start":"95.96","dur":"4.28"},{"text":"turns green and if the macd line crosses","start":"97.88","dur":"4.96"},{"text":"below the signal line it turns red and","start":"100.24","dur":"4.76"},{"text":"finally we have the zero line which","start":"102.84","dur":"4"},{"text":"basically represents the center of the","start":"105","dur":"4.159"},{"text":"macd indicator now that we know the four","start":"106.84","dur":"4.239"},{"text":"components let's make sure we know how","start":"109.159","dur":"4.401"},{"text":"to use them the macd indicator is","start":"111.079","dur":"4.96"},{"text":"insanely good at finding Trends and","start":"113.56","dur":"4.4"},{"text":"markets how you can tell if a chart is","start":"116.039","dur":"3.921"},{"text":"about to have an upward trend is by","start":"117.96","dur":"4.04"},{"text":"looking for a cross upwards between the","start":"119.96","dur":"4.119"},{"text":"macd line and the signal line for","start":"122","dur":"4.52"},{"text":"example here the macd crosses above the","start":"124.079","dur":"4.561"},{"text":"signal line indicating the chart is in","start":"126.52","dur":"4.519"},{"text":"an upward momentum and here the macd","start":"128.64","dur":"4.8"},{"text":"crosses below the signal line indicating","start":"131.039","dur":"4.48"},{"text":"it's in a downward momentum you can also","start":"133.44","dur":"4.36"},{"text":"use the histogram to indicate how much","start":"135.519","dur":"4.681"},{"text":"momentum there actually is so if the","start":"137.8","dur":"4.28"},{"text":"histogram is getting bigger that means","start":"140.2","dur":"4"},{"text":"there is an increase in momentum if it's","start":"142.08","dur":"4.159"},{"text":"getting smaller there's a decrease in","start":"144.2","dur":"4.08"},{"text":"momentum so how you actually want to use","start":"146.239","dur":"3.921"},{"text":"this indicator is by when the line","start":"148.28","dur":"4.64"},{"text":"crosses upwards but only if they cross","start":"150.16","dur":"5.04"},{"text":"below the zero line if they cross and","start":"152.92","dur":"4.24"},{"text":"it's above the zero line you wouldn't","start":"155.2","dur":"3.88"},{"text":"want to enter the trade it's the same","start":"157.16","dur":"3.84"},{"text":"concept with shorting you only want to","start":"159.08","dur":"3.72"},{"text":"enter a short trade if the lines are","start":"161","dur":"3.959"},{"text":"crossing downward and it's above the","start":"162.8","dur":"4.4"},{"text":"zero line so as you can see just by","start":"164.959","dur":"4.241"},{"text":"watching this this indicator is","start":"167.2","dur":"4.56"},{"text":"extremely easy to use but the problem","start":"169.2","dur":"4.959"},{"text":"most Traders encounter is that they only","start":"171.76","dur":"4.92"},{"text":"use this indicator by itself let me tell","start":"174.159","dur":"4.561"},{"text":"you why this doesn't work the macd","start":"176.68","dur":"4.479"},{"text":"indicator works extremely well if the","start":"178.72","dur":"5.32"},{"text":"market is in a trend so for example here","start":"181.159","dur":"5.36"},{"text":"the macd indicator is doing a great job","start":"184.04","dur":"4.16"},{"text":"indicating when the price is about to","start":"186.519","dur":"3.761"},{"text":"move upward because the chart is in an","start":"188.2","dur":"4.36"},{"text":"upward Trend but here the price is in a","start":"190.28","dur":"4.519"},{"text":"downward Trend but the macd is still","start":"192.56","dur":"4.84"},{"text":"signaling to buy long even though the","start":"194.799","dur":"5.041"},{"text":"price is going down a simple fix to this","start":"197.4","dur":"4.479"},{"text":"issue for example if we're Trading long","start":"199.84","dur":"4.319"},{"text":"we only want to trade if the market is","start":"201.879","dur":"4.64"},{"text":"in an uptrend you never want to trade","start":"204.159","dur":"4.241"},{"text":"against the trend because the odds will","start":"206.519","dur":"4.08"},{"text":"always be against you so so an easy way","start":"208.4","dur":"4"},{"text":"to figure out if the market is in an","start":"210.599","dur":"4.36"},{"text":"uptrend you simply just need to add a","start":"212.4","dur":"4.72"},{"text":"200 day moving average to do this you're","start":"214.959","dur":"3.84"},{"text":"going to go to the indicators tab on","start":"217.12","dur":"4.839"},{"text":"trading View and type in EMA which","start":"218.799","dur":"5.44"},{"text":"stands for exponential moving average or","start":"221.959","dur":"5.161"},{"text":"moving average exponential click the top","start":"224.239","dur":"5.2"},{"text":"one then you're going to go here click","start":"227.12","dur":"4.6"},{"text":"the settings of the EMA and you're going","start":"229.439","dur":"5.44"},{"text":"to go to inputs and change the length to","start":"231.72","dur":"6.159"},{"text":"200 which is going to make it a 200","start":"234.879","dur":"5.161"},{"text":"exponential moving average then you're","start":"237.879","dur":"3.801"},{"text":"going to go to style and I like to make","start":"240.04","dur":"3.199"},{"text":"mine red but you can make it whatever","start":"241.68","dur":"3.559"},{"text":"color you want once we have the EMA","start":"243.239","dur":"4.2"},{"text":"indicator added you'll see just a single","start":"245.239","dur":"4.761"},{"text":"line if the price is above that line the","start":"247.439","dur":"4.961"},{"text":"market is in an uptrend if the price is","start":"250","dur":"4.4"},{"text":"below that line the market is in a","start":"252.4","dur":"4.28"},{"text":"downtrend so after learning that we only","start":"254.4","dur":"4.359"},{"text":"want to trade in an uptrend Market if","start":"256.68","dur":"4.2"},{"text":"we're going long so all we have to do is","start":"258.759","dur":"4.601"},{"text":"put it all together we buy if the macd","start":"260.88","dur":"5.08"},{"text":"line crosses below the zero line Mark","start":"263.36","dur":"5.36"},{"text":"and the current price also is above the","start":"265.96","dur":"4.64"},{"text":"200 day moving app average this will","start":"268.72","dur":"3.919"},{"text":"guarantee that you are only trading when","start":"270.6","dur":"4.4"},{"text":"the market is in an uptrend which is a","start":"272.639","dur":"4.321"},{"text":"very powerful combo if you wanted a","start":"275","dur":"4.52"},{"text":"short you would do the exact opposite so","start":"276.96","dur":"4.44"},{"text":"make sure the price is below the 200 day","start":"279.52","dur":"3.72"},{"text":"moving average and the macd lines are","start":"281.4","dur":"4.72"},{"text":"crossing downward above the zero line so","start":"283.24","dur":"4.92"},{"text":"as an example we would want to enter a","start":"286.12","dur":"4.6"},{"text":"long trade right here because the macd","start":"288.16","dur":"4.64"},{"text":"lines are crossing upwards below the","start":"290.72","dur":"4.52"},{"text":"zero line and the current price is above","start":"292.8","dur":"4.76"},{"text":"the 200 day moving average now what I","start":"295.24","dur":"4.44"},{"text":"like to do is set a stop loss below","start":"297.56","dur":"4.359"},{"text":"below the 200 day moving average so the","start":"299.68","dur":"4.56"},{"text":"200 day almost acts as a wall that the","start":"301.919","dur":"4.041"},{"text":"price has to break through to hit the","start":"304.24","dur":"4.6"},{"text":"stop loss then I like to have a 1.5","start":"305.96","dur":"5.32"},{"text":"profit ratio for my profit Target Mark","start":"308.84","dur":"4.52"},{"text":"so as you can see for this example the","start":"311.28","dur":"4.24"},{"text":"strategy worked exactly as we wanted it","start":"313.36","dur":"4.959"},{"text":"to and we made money but we can still","start":"315.52","dur":"5.64"},{"text":"make this trading strategy even better","start":"318.319","dur":"4.961"},{"text":"this macd strategy combined with a","start":"321.16","dur":"4.52"},{"text":"200-day moving average works extremely","start":"323.28","dur":"4.52"},{"text":"well only if there's a lot of price","start":"325.68","dur":"3.84"},{"text":"movement where the strategy starts to","start":"327.8","dur":"3.64"},{"text":"get kind of iffy and giving false","start":"329.52","dur":"4"},{"text":"signals is when the chart starts going","start":"331.44","dur":"4.44"},{"text":"sideways and losing momentum so as you","start":"333.52","dur":"4.04"},{"text":"can see here the chart is moving","start":"335.88","dur":"3.8"},{"text":"sideways and lost almost all of its","start":"337.56","dur":"4.24"},{"text":"upward momentum and the macd is giving","start":"339.68","dur":"4.639"},{"text":"lots of false signals if you traded here","start":"341.8","dur":"4.959"},{"text":"odds are you probably lost money to fix","start":"344.319","dur":"4.801"},{"text":"this issue we have to combine the macd","start":"346.759","dur":"5.16"},{"text":"with price action to do this identify a","start":"349.12","dur":"5.04"},{"text":"key support or resistance where the","start":"351.919","dur":"5.12"},{"text":"price hits and bounces so as you can see","start":"354.16","dur":"5.039"},{"text":"the price goes down hits this point and","start":"357.039","dur":"4.6"},{"text":"reverses is upwards the next step is to","start":"359.199","dur":"4.601"},{"text":"wait for that price to hit the same key","start":"361.639","dur":"4.321"},{"text":"level again and once it does we","start":"363.8","dur":"4.16"},{"text":"expecting the price to bounce off the","start":"365.96","dur":"4.359"},{"text":"support and go upwards just like it did","start":"367.96","dur":"5.04"},{"text":"before but as a clear side note just","start":"370.319","dur":"4.28"},{"text":"because we made this support and it","start":"373","dur":"3.8"},{"text":"bounced off this before doesn't mean","start":"374.599","dur":"4.201"},{"text":"that it'll always do it again it can","start":"376.8","dur":"3.799"},{"text":"easily break through the support and","start":"378.8","dur":"4.2"},{"text":"drop lower if it has enough momentum if","start":"380.599","dur":"4.16"},{"text":"we want to make sure the price is about","start":"383","dur":"3.639"},{"text":"to change in momentum that's when we","start":"384.759","dur":"4.44"},{"text":"bring out the macd indicator so what you","start":"386.639","dur":"4.761"},{"text":"would do is make sure the price is above","start":"389.199","dur":"4.161"},{"text":"the 200 day moving average once the","start":"391.4","dur":"4"},{"text":"price hits the support made wait for the","start":"393.36","dur":"4.08"},{"text":"lines on the macd to cross below the","start":"395.4","dur":"3.96"},{"text":"zero level and that's when you enter the","start":"397.44","dur":"3.759"},{"text":"trade I just revealed to you how the","start":"399.36","dur":"4.52"},{"text":"macd 200 day moving average and using","start":"401.199","dur":"4.521"},{"text":"support and resistance levels gives an","start":"403.88","dur":"3.52"},{"text":"extremely high win rate with this","start":"405.72","dur":"3.72"},{"text":"strategy all I ask in return is if you","start":"407.4","dur":"4.04"},{"text":"can take 2 seconds of your time and like","start":"409.44","dur":"3.72"},{"text":"this video if you want to stay up to","start":"411.44","dur":"3.64"},{"text":"date with my future strategies make sure","start":"413.16","dur":"3.92"},{"text":"to subscribe because in my next video","start":"415.08","dur":"3.92"},{"text":"I'm planning to release a strategy that","start":"417.08","dur":"4.08"},{"text":"works even even better than this macd","start":"419","dur":"3.72"},{"text":"strategy hope you guys all learned","start":"421.16","dur":"3.2"},{"text":"something from this video and I'll see","start":"422.72","dur":"4.919"},{"text":"you guys next time","start":"424.36","dur":"3.279"}]}],"isLive":false,"languages":[{"label":"English","languageCode":"en"},{"label":"English (auto-generated)","languageCode":"en"}],"isLoginRequired":false,"playabilityStatus":{"status":"OK","playableInEmbed":true,"miniplayer":{"miniplayerRenderer":{"playbackMode":"PLAYBACK_MODE_ALLOW"}},"contextParams":"Q0FFU0FnZ0M="},"author":"TradingLab","channelId":"UCCbv0qixG-cyokxEY3kELtg","keywords":["macd indicator","macd trading strategy","macd indicator explained","macd strategy","macd explained","macd forex","macd forex trading strategy","macd trading","how to use macd indicator","how to macd","moving average convergence divergence","macd","day trading","day trading strategies","forex trading strategy","swing trading strategy","best macd trading strategy","best macd settings for swing trading","macd indicator cryptocurrency","best forex macd strategy","macd crypto strategy","tradinglab"]},{"text":"in this video and i sure you trading strategie de weg zodat alles hebt het al je huis in het bos using paul je bent en en rsa het simpel is de used as a pretty high succes reviews rekkelijk wel een avatar dutch treat you first up in descried setting op de ballingen bent heb je never used by your benefit for you like i click this video because this in the greater is absolutely incredible and its great divine support assistant slappe de frosting we willen duwen scoorde training wiel of whatever greeting card platform used-look de indicate er staat en typ in polybag snel de die pot settings screen you give you up for the night blijf noemen change jumper de specifieks try the first in je willen duwen scooter de lengte section and change de balie terreur die mixer de steen er deviation is set to win a mosque and remove the background of de en keter dit is al een persoon preference ziek en duwen de reaper furry zo die dingen 0 dit is shampoo en je bent er wordt dus een online is een moving average zo moeder van mijn tijd lang is dit indicate er is going back daar mini candle sticks in paniek average de toen u me zo verliest reggy were going back to the candle sticks de loor in april ein sof standard deviation light on a budget de bobbins er op pallets edgar's arcadis jiskoot hier in de keten stapt hij in ar saai en ik slikte stapel met 6 relatief strand in de gallery of art salade met modify settings de mixer the upper ben pset7 die en de lower binnen zetten ferdi van de lengtes producenten 14 voor de specifieks guide you would be set for a few have used other side before his degree in de geeter de t liever sorry securely is be over bal erover zo de line-up op de seven the well you it's been over bar at alliance beloofde further than you is tien over zo nauw samen perry die stuw in de kiezers together in dit zijn profiel beeld reeds go monsieur je was de russen deze video bios unexplained crucial chip met de strike eagle verwerking just okÃ© journey into my money making machine zo de tour de france revisie choose from using the syndicate en boten die strategie is er belt oranje concept gold nieuwe provision boxmeer vision i may ask 12 min reversal word and rich en de word revision means to returning to zo support simply de frees nieuwere versie just means returning to be covered with a clean ogende shooting for met discredit ie zo is een simpel in most cases the person extreme price moet me one direction whether it off or down week in pretty much to take a turn up ik prijs me dat de prijs over trajecten die app which the moving average drie keer zo is de prikkels op pad de appelboom je bent die mannen en t-shirt red of de prijs god beloofde balm balm je bent limoen te enter online trade symbool of re wel evident is by itself a jar wonnen worked as well i added the arch sayulee zo aziatische simpel de prijs met ambar or below de bal je bent many times shilling laatste forcing nood zo if you win in every time you probably was montesol this issue where do not one may require you can only do in is de arm saai dit zijn extreme power mini quick en oli en carl andre de echte prijs moest below the lower body ben in de ar side solo de value tony 5 personen wie we onder intertrade enterprise co op bank the upper body ben en ar side over de balie of zeven niveaus zo is een zeer pure biologische apple in de priesters koning below the bottom bal in je bed at this point en de arm saai is still know where i want to be zo we weten dat b en tilde line god beloont kony for which precies go down all the way de koning winter lang schreef at this point en de president in the average just like the product in word en elders en crucial information i mean de nieuwe bad disc reggy eurocent simply just one word is niks type mijn botten tell us the difference between ministratie proverb opmerkingen en manier loser of this crazy he 6 volt is in de markies muziek sideways promo star trading c is mijn de markies moving sideways wit sola harder de productie is een simpel hier de prikkels de loden leeuw bobbins in de ar size de loods polyfibre de prijs christian dripping and dropping zo is uw interview haven in absoluut messen vlaamse naam de chinese lothric synode precies kunnen doen before giving head zo in dus ik simpel know this has kin in de ballingen bent ar het is bonsai hier weer niveaus together and her family in the price met een en de markies moving size you can also see dat de oorzaak is bunbury team in steen en beton de purple rectangle en na tonen bar or below the major point be made before this en wonen jeremy will give you grab my most high zijn de markies like this movie side with for a while en de president brie concern drection ik koos in netter action which you the mountain momenten zo een misstap strik simpels you never wanna grey chine ketch folie live in de priester uiting van lamisha we een undergraduate muse de help zodus networks moet absoluut magic you can see de priesters de drab te lower body je bent en en rebirth en de next time comes down and mix een nieuw logo van de preview slow but something interesting is happening de arm saai middag firewall zo wie hij prees microloon dat de ar saaie smekingen harry with my hier is codee budget en het zijn absoluut grey chine tent er treedt is specially for saai was previously beloofd mini 5 pin en de prijs van polo doel oranje ben je bisschop in dustin x-creen lungri jeans de prijzen reverse en mieke nieuw hi hi hi hi to show you how their body je bent met ar saai en make-up af en toe trading schreef elias khoury treurnis evident weet uw secundaire bio-d en like de video lucide als ze was mijn andere video waar ik over mijn mac the grudge match kids een medisch experts en luigi sap solutions een monnik omstreden sygic data and i'll see you guys nextime Bollinger Bands In this video, I m going to show you a trading strategy that works so good I just have to tell you guys. And it involves using Bollinger Bands and RS. It s simple, easy to use, and has a pretty high success rate if you use it correctly. Well enough talk, let s get straight to it. The first step for this strategy is setting up the Bollinger bands. If you ve never used Bollinger Bands before, your lucky you clicked this video, because this indicator is absolutely incredible and is great way to find support and resistance levels. So the first thing we want to do is to go to trading view or whatever trading chart platform you use, click the indicators tab, and type in Bollinger Bands . Now, the default settings trading view will give you, are nice, but we want to change them for this specific strategy. First thing you want to do is go to the length section and change this value to 30, make sure the standard deviation is set to 2. Then I m also going to remove the background of the indicator, and change the lines to red. This is all personal preference, you can do whatever you prefer here. So if you didn t know, this is how Bollinger bands work. The center line, is a moving average. So whatever amount the length is, this indicator is going back that many candle sticks and finding the average between them. So for this strategy we are going back 30 candlesticks. The lower and upper lines are standard deviation lines. Alright we got the Bollinger Bands setup, now let s add the RSI. To do this, just go to your indicators tab, type in RSI and then click this top one that says Relative strength index Now that we have RSI added let s modify the settings a bit. Make sure that upper band is set to 70, and your lower band is set to 30. Then this length is probably going to be set to 14, make sure to change that to 13 for this strategy. If you haven t used RSI before it s a great indicator to tell you if a certain security is being overbought or oversold. If the line is above the 70 value, its being overbought, if the line is below the 30 value, its being oversold. Now it s time to pair these 2 indicators together and get some profitable trades going. Make sure you watch the rest this video, because im going to explain a crucial tip to make this strategy working just okay, to turn into a money making machine. So there are 2 different strategies you can choose from when using these indicators. Both of these strategies are built around the concept called mean reversion. What s mean reversion you my ask? Well, mean refers to the word average, and the word reversion means returning to So to put it simply, the phrase mean reversion just means returning to the average. Which is exactly what we are going to be shooting for with this strategy. So as an example, in most cases if there is extreme price movement in one direction whether its up or down, we can pretty much predict after that big price movement, the price will return back to the average (the moving average right here). So if the price goes above the upper Bollinger band, we want to enter a short trade. If the prices goes below the bottom Bollinger band, we want to enter a long trade. Simple enough right? Well, if you did this by itself, odds are it wouldn t work to good. That s why we added the RSI earlier. So as you can see in this example the price went above or below the Bollinger bands many times giving lots of false signals. So if you went in every time here, you probably lost money. To solve this issue we are going to add one more requirement. You can only go in if the RSI hits an extreme value. Meaning, we can only enter a long trade if the price moves below the lower Bollinger band and the rsi goes below the value of 25. For shorting, we will only enter a trade if the price goes above the upper Bollinger band, and the rsi goes over the value of 75. So as an example here we are looing at apple and the price starts going below the bottom Bollinger band here, but at this point in time the RSI is still not where we want it to be. So we wait it out a bit until the line goes below 25. which it proceeds to go down all the way to 20, we enter a long trade at this point, and the price returns to the average just like we predicted it would. Now there is some crucial information you need to know about this strategy or else it simply just wont work. This next tip im about to tell you is the difference between making this strategy profitable or making a money loser. Where this strategy has its faults is when the market is moving sideways. For almost all trading strategies when the markets is moving sideways it s a lot harder to predict. So as example here, the price goes below the lower Bollinger band, and the RSI is below 25, but the price just keeps on dropping. So if you entered here, you would have an absolute massive loss. So now im going to show you a nice little trick, so you know before hand before these huge price movement even happen. So in this example notice how skinny the Bollinger bands are at this point in time, they are very close together, and there is barely any price movement, and the market is moving sideways. You can also see that the RSI is being very tame and staying in between the purple rectangle and not going above or below the major points we made before. This alone, should immediately raise a huge red flag. Most times when the market is like this for a while, when the price does break in a certain direction, it goes in that direction with huge amounts of momentum. So in these types of examples, you never want to trade trying to catch a falling knife when the price starts to act like this. Let me show you another strategy we can use, to help solve this, that works like absolute magic. Here you can see the price starts to drop to the lower Bollinger band and then reverses. The next time it comes down, it makes a new lower lower from the previous low, but something interesting is happening. The RSI made a higher lower. So we have price making a lower low, but the RSI is making a higher low. This right here, is called divergence and is an absolute great sign to enter a trade, especially if rsi was previously below 25, and the price went below the lower Bollinger band. If this happens, there s an extremely great chance the price will reverse and make a new higher high. I just showed you how to pair Bollinger bands with RSI and make it a profitable trading strategy. All I ask for in return is if you can take 2 seconds out of your day and like this video. You should also watch my other video where I go over a MACD strategy which gets an 86% win rate, which is absolutely insane when it comes to trading. So go check that out, and ill see you guys next time.","id":"pCmJ8wsAS_w","title":"Bollinger Band + RSI Trading Strategy That Actually Works","microformat":{"playerMicroformatRenderer":{"thumbnail":{"thumbnails":[{"url":"https://i.ytimg.com/vi/pCmJ8wsAS_w/maxresdefault.jpg","width":1280,"height":720}]},"embed":{"iframeUrl":"https://www.youtube.com/embed/pCmJ8wsAS_w","width":1280,"height":720},"title":{"simpleText":"Bollinger Band + RSI Trading Strategy That Actually Works"},"description":{"simpleText":"Bollinger Bands. A very powerful indicator when it comes to trading. They are very good at showing strong supports & resistances.\n\nIn this video, I pair them with the RSI indicator. This strategy is easy to use and I show you exactly how to use it effectively. This can be used for a forex trading strategy, stocks, crypto, and futures.\n\nIf you learned something new, leave a like.\n\nðŸ”´ Subscribe for more videos just like this: https://www.youtube.com/channel/UCCbv0qixG-cyokxEY3kELtg?sub_confirmation=1\n\nMy trading Discord: https://discord.gg/nHqDYZuuK2\n\nFollow TradingLab: \n===============================\nðŸ“¸ - IG: https://www.instagram.com/tradinglabofficial/"},"lengthSeconds":"401","ownerProfileUrl":"http://www.youtube.com/@TradingLabOfficial","externalChannelId":"UCCbv0qixG-cyokxEY3kELtg","isFamilySafe":true,"availableCountries":["AD","AE","AF","AG","AI","AL","AM","AO","AQ","AR","AS","AT","AU","AW","AX","AZ","BA","BB","BD","BE","BF","BG","BH","BI","BJ","BL","BM","BN","BO","BQ","BR","BS","BT","BV","BW","BY","BZ","CA","CC","CD","CF","CG","CH","CI","CK","CL","CM","CN","CO","CR","CU","CV","CW","CX","CY","CZ","DE","DJ","DK","DM","DO","DZ","EC","EE","EG","EH","ER","ES","ET","FI","FJ","FK","FM","FO","FR","GA","GB","GD","GE","GF","GG","GH","GI","GL","GM","GN","GP","GQ","GR","GS","GT","GU","GW","GY","HK","HM","HN","HR","HT","HU","ID","IE","IL","IM","IN","IO","IQ","IR","IS","IT","JE","JM","JO","JP","KE","KG","KH","KI","KM","KN","KP","KR","KW","KY","KZ","LA","LB","LC","LI","LK","LR","LS","LT","LU","LV","LY","MA","MC","MD","ME","MF","MG","MH","MK","ML","MM","MN","MO","MP","MQ","MR","MS","MT","MU","MV","MW","MX","MY","MZ","NA","NC","NE","NF","NG","NI","NL","NO","NP","NR","NU","NZ","OM","PA","PE","PF","PG","PH","PK","PL","PM","PN","PR","PS","PT","PW","PY","QA","RE","RO","RS","RU","RW","SA","SB","SC","SD","SE","SG","SH","SI","SJ","SK","SL","SM","SN","SO","SR","SS","ST","SV","SX","SY","SZ","TC","TD","TF","TG","TH","TJ","TK","TL","TM","TN","TO","TR","TT","TV","TW","TZ","UA","UG","UM","US","UY","UZ","VA","VC","VE","VG","VI","VN","VU","WF","WS","YE","YT","ZA","ZM","ZW"],"isUnlisted":false,"hasYpcMetadata":false,"viewCount":"1335855","category":"Education","publishDate":"2021-10-07T13:54:15-07:00","ownerChannelName":"TradingLab","uploadDate":"2021-10-07T13:54:15-07:00","isShortsEligible":false,"externalVideoId":"pCmJ8wsAS_w","likeCount":"55414"}},"tracks":[{"language":"Dutch (auto-generated)","transcript":[{"text":"in this video and i sure you trading","start":"0","dur":"4.92"},{"text":"strategie de weg zodat alles hebt het al","start":"1.829","dur":"6.061"},{"text":"je huis in het bos using paul je bent en","start":"4.92","dur":"6.75"},{"text":"en rsa het simpel is de used as a pretty","start":"7.89","dur":"6.51"},{"text":"high succes reviews rekkelijk wel een","start":"11.67","dur":"5.1"},{"text":"avatar dutch treat you first up in","start":"14.4","dur":"4.44"},{"text":"descried setting op de ballingen bent","start":"16.77","dur":"4.08"},{"text":"heb je never used by your benefit for","start":"18.84","dur":"4.5"},{"text":"you like i click this video because this","start":"20.85","dur":"5.13"},{"text":"in the greater is absolutely incredible","start":"23.34","dur":"5.429"},{"text":"and its great divine support assistant","start":"25.98","dur":"4.619"},{"text":"slappe de frosting we willen duwen","start":"28.769","dur":"3.481"},{"text":"scoorde training wiel of whatever","start":"30.599","dur":"3.96"},{"text":"greeting card platform used-look de","start":"32.25","dur":"5.55"},{"text":"indicate er staat en typ in polybag snel","start":"34.559","dur":"5.43"},{"text":"de die pot settings screen you give you","start":"37.8","dur":"4.59"},{"text":"up for the night blijf noemen change","start":"39.989","dur":"4.531"},{"text":"jumper de specifieks try the first in je","start":"42.39","dur":"4.11"},{"text":"willen duwen scooter de lengte section","start":"44.52","dur":"4.65"},{"text":"and change de balie terreur die mixer de","start":"46.5","dur":"4.98"},{"text":"steen er deviation is set to win a","start":"49.17","dur":"4.139"},{"text":"mosque and remove the background of de","start":"51.48","dur":"3.509"},{"text":"en keter dit is al een persoon","start":"53.309","dur":"3.811"},{"text":"preference ziek en duwen de reaper furry","start":"54.989","dur":"4.59"},{"text":"zo die dingen 0 dit is shampoo en je","start":"57.12","dur":"4.11"},{"text":"bent er wordt dus een online is een","start":"59.579","dur":"4.021"},{"text":"moving average zo moeder van mijn tijd","start":"61.23","dur":"4.679"},{"text":"lang is dit indicate er is going back","start":"63.6","dur":"4.98"},{"text":"daar mini candle sticks in paniek","start":"65.909","dur":"5.431"},{"text":"average de toen u me zo verliest reggy","start":"68.58","dur":"5.52"},{"text":"were going back to the candle sticks de","start":"71.34","dur":"4.889"},{"text":"loor in april ein sof standard deviation","start":"74.1","dur":"4.83"},{"text":"light on a budget de bobbins er op","start":"76.229","dur":"6.091"},{"text":"pallets edgar's arcadis jiskoot hier in","start":"78.93","dur":"5.759"},{"text":"de keten stapt hij in ar saai en ik","start":"82.32","dur":"5.1"},{"text":"slikte stapel met 6 relatief strand in","start":"84.689","dur":"5.551"},{"text":"de gallery of art salade met modify","start":"87.42","dur":"5.58"},{"text":"settings de mixer the upper ben pset7","start":"90.24","dur":"5.37"},{"text":"die en de lower binnen zetten ferdi van","start":"93","dur":"5.22"},{"text":"de lengtes producenten 14 voor de","start":"95.61","dur":"5.369"},{"text":"specifieks guide you would be set for a","start":"98.22","dur":"5.16"},{"text":"few have used other side before his","start":"100.979","dur":"4.441"},{"text":"degree in de geeter de t liever sorry","start":"103.38","dur":"5.19"},{"text":"securely is be over bal erover zo de","start":"105.42","dur":"5.28"},{"text":"line-up op de seven the well you it's","start":"108.57","dur":"4.47"},{"text":"been over bar at alliance beloofde","start":"110.7","dur":"4.77"},{"text":"further than you is tien over zo nauw","start":"113.04","dur":"4.32"},{"text":"samen perry die stuw in de kiezers","start":"115.47","dur":"3.87"},{"text":"together in dit zijn profiel beeld reeds","start":"117.36","dur":"4.38"},{"text":"go monsieur je was de russen deze video","start":"119.34","dur":"5.099"},{"text":"bios unexplained crucial chip met de","start":"121.74","dur":"5.55"},{"text":"strike eagle verwerking just okÃ© journey","start":"124.439","dur":"5.761"},{"text":"into my money making machine zo de tour","start":"127.29","dur":"5.52"},{"text":"de france revisie choose from using the","start":"130.2","dur":"5.069"},{"text":"syndicate en boten die strategie is er","start":"132.81","dur":"4.5"},{"text":"belt oranje concept gold nieuwe","start":"135.269","dur":"3.511"},{"text":"provision","start":"137.31","dur":"4.8"},{"text":"boxmeer vision i may ask 12 min reversal","start":"138.78","dur":"6.179"},{"text":"word and rich en de word revision means","start":"142.11","dur":"4.26"},{"text":"to returning to","start":"144.959","dur":"3.541"},{"text":"zo support simply de frees nieuwere","start":"146.37","dur":"4.38"},{"text":"versie just means returning to be","start":"148.5","dur":"5.489"},{"text":"covered with a clean ogende shooting for","start":"150.75","dur":"5.819"},{"text":"met discredit ie zo is een simpel in","start":"153.989","dur":"5.191"},{"text":"most cases the person extreme price moet","start":"156.569","dur":"5.881"},{"text":"me one direction whether it off or down","start":"159.18","dur":"5.58"},{"text":"week in pretty much to take a turn up ik","start":"162.45","dur":"5.039"},{"text":"prijs me dat de prijs over trajecten die","start":"164.76","dur":"4.68"},{"text":"app which the moving average drie keer","start":"167.489","dur":"4.83"},{"text":"zo is de prikkels op pad de appelboom je","start":"169.44","dur":"5.25"},{"text":"bent die mannen en t-shirt red of de","start":"172.319","dur":"4.56"},{"text":"prijs god beloofde balm balm je bent","start":"174.69","dur":"5.01"},{"text":"limoen te enter online trade symbool of","start":"176.879","dur":"6.45"},{"text":"re wel evident is by itself a jar wonnen","start":"179.7","dur":"6.96"},{"text":"worked as well i added the arch sayulee","start":"183.329","dur":"6.511"},{"text":"zo aziatische simpel de prijs met ambar","start":"186.66","dur":"5.189"},{"text":"or below de bal je bent many times","start":"189.84","dur":"4.679"},{"text":"shilling laatste forcing nood zo if you","start":"191.849","dur":"5.521"},{"text":"win in every time you probably was","start":"194.519","dur":"5.881"},{"text":"montesol this issue where do not one may","start":"197.37","dur":"5.88"},{"text":"require you can only do in is de arm","start":"200.4","dur":"5.61"},{"text":"saai dit zijn extreme power mini quick","start":"203.25","dur":"5.31"},{"text":"en oli en carl andre de echte prijs","start":"206.01","dur":"5.309"},{"text":"moest below the lower body ben in de ar","start":"208.56","dur":"6.81"},{"text":"side solo de value tony 5 personen wie","start":"211.319","dur":"6.301"},{"text":"we onder intertrade enterprise co op","start":"215.37","dur":"5.64"},{"text":"bank the upper body ben en ar side over","start":"217.62","dur":"6"},{"text":"de balie of zeven niveaus zo is een zeer","start":"221.01","dur":"5.25"},{"text":"pure biologische apple in de priesters","start":"223.62","dur":"5.25"},{"text":"koning below the bottom bal in je bed at","start":"226.26","dur":"5.339"},{"text":"this point en de arm saai is still know","start":"228.87","dur":"5.489"},{"text":"where i want to be zo we weten dat b en","start":"231.599","dur":"5.161"},{"text":"tilde line god beloont kony for which","start":"234.359","dur":"5.1"},{"text":"precies go down all the way de koning","start":"236.76","dur":"5.129"},{"text":"winter lang schreef at this point en de","start":"239.459","dur":"5.071"},{"text":"president in the average just like the","start":"241.889","dur":"5.371"},{"text":"product in word en elders en crucial","start":"244.53","dur":"4.47"},{"text":"information i mean de nieuwe bad disc","start":"247.26","dur":"4.379"},{"text":"reggy eurocent simply just one word is","start":"249","dur":"4.41"},{"text":"niks type mijn botten tell us the","start":"251.639","dur":"4.291"},{"text":"difference between ministratie proverb","start":"253.41","dur":"5.009"},{"text":"opmerkingen en manier loser of this","start":"255.93","dur":"5.399"},{"text":"crazy he 6 volt is in de markies muziek","start":"258.419","dur":"6.18"},{"text":"sideways promo star trading c is mijn de","start":"261.329","dur":"6.06"},{"text":"markies moving sideways wit sola harder","start":"264.599","dur":"4.921"},{"text":"de productie is een simpel hier de","start":"267.389","dur":"4.921"},{"text":"prikkels de loden leeuw bobbins in de ar","start":"269.52","dur":"4.95"},{"text":"size de loods polyfibre de prijs","start":"272.31","dur":"4.77"},{"text":"christian dripping and dropping","start":"274.47","dur":"5.61"},{"text":"zo is uw interview haven in absoluut","start":"277.08","dur":"5.94"},{"text":"messen vlaamse naam de chinese lothric","start":"280.08","dur":"4.649"},{"text":"synode precies kunnen doen","start":"283.02","dur":"4.44"},{"text":"before giving head zo in dus ik simpel","start":"284.729","dur":"4.921"},{"text":"know this has kin in de ballingen bent","start":"287.46","dur":"4.62"},{"text":"ar het is bonsai hier weer niveaus","start":"289.65","dur":"5.07"},{"text":"together and her family in the price met","start":"292.08","dur":"5.55"},{"text":"een en de markies moving size you can","start":"294.72","dur":"6.18"},{"text":"also see dat de oorzaak is bunbury team","start":"297.63","dur":"6.45"},{"text":"in steen en beton de purple rectangle en","start":"300.9","dur":"5.97"},{"text":"na tonen bar or below the major point be","start":"304.08","dur":"5.55"},{"text":"made before this en wonen jeremy will","start":"306.87","dur":"5.789"},{"text":"give you grab my most high zijn de","start":"309.63","dur":"5.159"},{"text":"markies like this movie side with for a","start":"312.659","dur":"4.38"},{"text":"while en de president brie concern","start":"314.789","dur":"4.68"},{"text":"drection ik koos in netter action which","start":"317.039","dur":"5.1"},{"text":"you the mountain momenten zo een misstap","start":"319.469","dur":"4.861"},{"text":"strik simpels you never wanna grey chine","start":"322.139","dur":"5.221"},{"text":"ketch folie live in de priester uiting","start":"324.33","dur":"3.72"},{"text":"van","start":"327.36","dur":"3.059"},{"text":"lamisha we een undergraduate muse de","start":"328.05","dur":"5.64"},{"text":"help zodus networks moet absoluut magic","start":"330.419","dur":"5.161"},{"text":"you can see de priesters de drab te","start":"333.69","dur":"4.83"},{"text":"lower body je bent en en rebirth en de","start":"335.58","dur":"4.889"},{"text":"next time comes down and mix een nieuw","start":"338.52","dur":"4.739"},{"text":"logo van de preview slow but something","start":"340.469","dur":"5.01"},{"text":"interesting is happening de arm saai","start":"343.259","dur":"4.621"},{"text":"middag firewall zo wie hij prees","start":"345.479","dur":"3.84"},{"text":"microloon","start":"347.88","dur":"3.96"},{"text":"dat de ar saaie smekingen harry with my","start":"349.319","dur":"4.921"},{"text":"hier is codee budget en het zijn","start":"351.84","dur":"5.129"},{"text":"absoluut grey chine tent er treedt is","start":"354.24","dur":"4.979"},{"text":"specially for saai was previously","start":"356.969","dur":"5.19"},{"text":"beloofd mini 5 pin en de prijs van polo","start":"359.219","dur":"5.88"},{"text":"doel oranje ben je bisschop in dustin","start":"362.159","dur":"5.37"},{"text":"x-creen lungri jeans de prijzen reverse","start":"365.099","dur":"5.37"},{"text":"en mieke nieuw hi hi hi hi to show you","start":"367.529","dur":"5.551"},{"text":"how their body je bent met ar saai en","start":"370.469","dur":"4.98"},{"text":"make-up af en toe trading schreef elias","start":"373.08","dur":"4.05"},{"text":"khoury treurnis evident weet uw","start":"375.449","dur":"4.411"},{"text":"secundaire bio-d en like de video lucide","start":"377.13","dur":"4.469"},{"text":"als ze was mijn andere video waar ik","start":"379.86","dur":"4.23"},{"text":"over mijn mac the grudge match kids een","start":"381.599","dur":"5.461"},{"text":"medisch experts en luigi sap solutions","start":"384.09","dur":"6.09"},{"text":"een monnik omstreden sygic data and i'll","start":"387.06","dur":"6.53"},{"text":"see you guys nextime","start":"390.18","dur":"3.41"}]},{"language":"English","transcript":[{"text":"Bollinger Bands\nIn this video, I m going to show you a trading","start":"0.08","dur":"1.78"},{"text":"strategy that works so good I just have to\ntell you guys. And it involves using Bollinger","start":"1.86","dur":"5.86"},{"text":"Bands and RS. It s simple, easy to use, and\nhas a pretty high success rate if you use","start":"7.72","dur":"5.579"},{"text":"it correctly. Well enough talk, let s get\nstraight to it.","start":"13.299","dur":"2.811"},{"text":"The first step for this strategy is setting\nup the Bollinger bands. If you ve never used","start":"16.11","dur":"3.87"},{"text":"Bollinger Bands before, your lucky you clicked\nthis video, because this indicator is absolutely","start":"19.98","dur":"5.43"},{"text":"incredible and is great way to find support\nand resistance levels.","start":"25.41","dur":"4.07"},{"text":"So the first thing we want to do is to go\nto trading view or whatever trading chart","start":"29.48","dur":"3.61"},{"text":"platform you use, click the indicators tab,\nand type in Bollinger Bands .","start":"33.09","dur":"4.7"},{"text":"Now, the default settings trading view will\ngive you, are nice, but we want to change","start":"37.79","dur":"4.67"},{"text":"them for this specific strategy.\nFirst thing you want to do is go to the length","start":"42.46","dur":"3.63"},{"text":"section and change this value to 30, make\nsure the standard deviation is set to 2.","start":"46.09","dur":"5.44"},{"text":"Then I m also going to remove the background\nof the indicator, and change the lines to","start":"51.53","dur":"2.64"},{"text":"red. This is all personal preference, you\ncan do whatever you prefer here.","start":"54.17","dur":"3.36"},{"text":"So if you didn t know, this is how Bollinger\nbands work. The center line, is a moving average.","start":"57.53","dur":"4.98"},{"text":"So whatever amount the length is, this indicator\nis going back that many candle sticks and","start":"62.51","dur":"5.57"},{"text":"finding the average between them. So for this\nstrategy we are going back 30 candlesticks.","start":"68.08","dur":"6.03"},{"text":"The lower and upper lines are standard deviation\nlines.","start":"74.11","dur":"3.21"},{"text":"Alright we got the Bollinger Bands setup,\nnow let s add the RSI.","start":"77.32","dur":"3.51"},{"text":"To do this, just go to your indicators tab,\ntype in RSI and then click this top one that","start":"80.83","dur":"5.05"},{"text":"says Relative strength index\nNow that we have RSI added let s modify the","start":"85.88","dur":"4.49"},{"text":"settings a bit. Make sure that upper band\nis set to 70, and your lower band is set to","start":"90.37","dur":"4.75"},{"text":"30.\nThen this length is probably going to be set","start":"95.12","dur":"2.96"},{"text":"to 14, make sure to change that to 13 for\nthis strategy.","start":"98.08","dur":"3.38"},{"text":"If you haven t used RSI before it s a great\nindicator to tell you if a certain security","start":"101.46","dur":"4.64"},{"text":"is being overbought or oversold.\nIf the line is above the 70 value, its being","start":"106.1","dur":"4.9"},{"text":"overbought, if the line is below the 30 value,\nits being oversold.","start":"111","dur":"4.37"},{"text":"Now it s time to pair these 2 indicators together\nand get some profitable trades going.","start":"115.37","dur":"4.679"},{"text":"Make sure you watch the rest this video, because\nim going to explain a crucial tip to make","start":"120.049","dur":"4.311"},{"text":"this strategy working just okay, to turn into\na money making machine.","start":"124.36","dur":"5.12"},{"text":"So there are 2 different strategies you can\nchoose from when using these indicators. Both","start":"129.48","dur":"4.58"},{"text":"of these strategies are built around the concept\ncalled mean reversion.","start":"134.06","dur":"4.97"},{"text":"What s mean reversion you my ask? Well, mean\nrefers to the word average, and the word reversion","start":"139.03","dur":"5.74"},{"text":"means returning to\nSo to put it simply, the phrase mean reversion","start":"144.77","dur":"4.39"},{"text":"just means returning to the average. Which\nis exactly what we are going to be shooting","start":"149.16","dur":"4.21"},{"text":"for with this strategy.\nSo as an example, in most cases if there is","start":"153.37","dur":"5.27"},{"text":"extreme price movement in one direction whether\nits up or down, we can pretty much predict","start":"158.64","dur":"5.36"},{"text":"after that big price movement, the price will\nreturn back to the average (the moving average","start":"164","dur":"5.06"},{"text":"right here).\nSo if the price goes above the upper Bollinger","start":"169.06","dur":"3.69"},{"text":"band, we want to enter a short trade. If the\nprices goes below the bottom Bollinger band,","start":"172.75","dur":"4.46"},{"text":"we want to enter a long trade.\nSimple enough right? Well, if you did this","start":"177.21","dur":"4.05"},{"text":"by itself, odds are it wouldn t work to good.\nThat s why we added the RSI earlier.","start":"181.26","dur":"5.54"},{"text":"So as you can see in this example the price\nwent above or below the Bollinger bands many","start":"186.8","dur":"4.85"},{"text":"times giving lots of false signals. So if\nyou went in every time here, you probably","start":"191.65","dur":"5.56"},{"text":"lost money.\nTo solve this issue we are going to add one","start":"197.21","dur":"3.06"},{"text":"more requirement. You can only go in if the\nRSI hits an extreme value.","start":"200.27","dur":"5.39"},{"text":"Meaning, we can only enter a long trade if\nthe price moves below the lower Bollinger","start":"205.66","dur":"4.61"},{"text":"band and the rsi goes below the value of 25.\nFor shorting, we will only enter a trade if","start":"210.27","dur":"6.53"},{"text":"the price goes above the upper Bollinger band,\nand the rsi goes over the value of 75.","start":"216.8","dur":"6.1"},{"text":"So as an example here we are looing at apple\nand the price starts going below the bottom","start":"222.9","dur":"4.96"},{"text":"Bollinger band here, but at this point in\ntime the RSI is still not where we want it","start":"227.86","dur":"4.451"},{"text":"to be. So we wait it out a bit until the line\ngoes below 25. which it proceeds to go down","start":"232.311","dur":"6.008"},{"text":"all the way to 20, we enter a long trade at\nthis point, and the price returns to the average","start":"238.319","dur":"5.731"},{"text":"just like we predicted it would.\nNow there is some crucial information you","start":"244.05","dur":"4.019"},{"text":"need to know about this strategy or else it\nsimply just wont work. This next tip im about","start":"248.069","dur":"4.541"},{"text":"to tell you is the difference between making\nthis strategy profitable or making a money","start":"252.61","dur":"5.26"},{"text":"loser.\nWhere this strategy has its faults is when","start":"257.87","dur":"2.449"},{"text":"the market is moving sideways. For almost\nall trading strategies when the markets is","start":"260.319","dur":"4.831"},{"text":"moving sideways it s a lot harder to predict.\nSo as example here, the price goes below the","start":"265.15","dur":"5.449"},{"text":"lower Bollinger band, and the RSI is below\n25, but the price just keeps on dropping.","start":"270.599","dur":"6.66"},{"text":"So if you entered here, you would have an\nabsolute massive loss.","start":"277.259","dur":"4.041"},{"text":"So now im going to show you a nice little\ntrick, so you know before hand before these","start":"281.3","dur":"3.22"},{"text":"huge price movement even happen.\nSo in this example notice how skinny the Bollinger","start":"284.52","dur":"5.149"},{"text":"bands are at this point in time, they are\nvery close together, and there is barely any","start":"289.669","dur":"4.31"},{"text":"price movement, and the market is moving sideways.\nYou can also see that the RSI is being very","start":"293.979","dur":"6.62"},{"text":"tame and staying in between the purple rectangle\nand not going above or below the major points","start":"300.599","dur":"6.171"},{"text":"we made before. This alone, should immediately\nraise a huge red flag.","start":"306.77","dur":"5.06"},{"text":"Most times when the market is like this for\na while, when the price does break in a certain","start":"311.83","dur":"5.389"},{"text":"direction, it goes in that direction with\nhuge amounts of momentum.","start":"317.219","dur":"4.211"},{"text":"So in these types of examples, you never want\nto trade trying to catch a falling knife when","start":"321.43","dur":"4.829"},{"text":"the price starts to act like this.\nLet me show you another strategy we can use,","start":"326.259","dur":"4.171"},{"text":"to help solve this, that works like absolute\nmagic.","start":"330.43","dur":"3.579"},{"text":"Here you can see the price starts to drop\nto the lower Bollinger band and then reverses.","start":"334.009","dur":"4.53"},{"text":"The next time it comes down, it makes a new\nlower lower from the previous low, but something","start":"338.539","dur":"4.91"},{"text":"interesting is happening. The RSI made a higher\nlower.","start":"343.449","dur":"3.72"},{"text":"So we have price making a lower low, but the\nRSI is making a higher low. This right here,","start":"347.169","dur":"5.22"},{"text":"is called divergence and is an absolute great\nsign to enter a trade, especially if rsi was","start":"352.389","dur":"7.08"},{"text":"previously below 25, and the price went below\nthe lower Bollinger band.","start":"359.469","dur":"4.26"},{"text":"If this happens, there s an extremely great\nchance the price will reverse and make a new","start":"363.729","dur":"5.101"},{"text":"higher high.\nI just showed you how to pair Bollinger bands","start":"368.83","dur":"3.23"},{"text":"with RSI and make it a profitable trading\nstrategy. All I ask for in return is if you","start":"372.06","dur":"4.539"},{"text":"can take 2 seconds out of your day and like\nthis video.","start":"376.599","dur":"3.051"},{"text":"You should also watch my other video where\nI go over a MACD strategy which gets an 86%","start":"379.65","dur":"5.09"},{"text":"win rate, which is absolutely insane when\nit comes to trading.","start":"384.74","dur":"3.989"},{"text":"So go check that out, and ill see you guys\nnext time.","start":"388.729","dur":"3.05"}]}],"isLive":false,"languages":[{"label":"English","languageCode":"en"},{"label":"Dutch (auto-generated)","languageCode":"nl"}],"isLoginRequired":false,"playabilityStatus":{"status":"OK","playableInEmbed":true,"miniplayer":{"miniplayerRenderer":{"playbackMode":"PLAYBACK_MODE_ALLOW"}},"contextParams":"Q0FFU0FnZ0M="},"author":"TradingLab","channelId":"UCCbv0qixG-cyokxEY3kELtg","keywords":["bollinger bands","rsi","bollinger bands and rsi strategy","bollinger bands trading strategy","rsi trading strategy","rsi indicator","rsi divergence trading strategy","bollinger bands forex","forex","swing trading strategy","bollinger band swing trading strategy","bollinger bands squeeze trading strategy","how to trade bollinger band breakout","how to use bollinger bands in day trading","bollinger bands indicator strategy","stocks","bollinger bands strategy","bollinger bands indicator"]},{"text":"in this video I'm going to show you a strategy using the hakashi indicator it's great at finding Trends and even better at finding reversals I'm also going to be adding another indicator to this strategy to make it that much more effective let's get straight to it for all the beginners out there or for the people who don't know what the hakashi indicator is let me give you a quick overview so what we're looking at now looks as if it's just a normal chart right well actually we're looking at the hakashi indicator at work hakashi actually means average bar in Japanese so that's exactly what it's doing finding the average in the candlesticks so this is the real time chart and this is the hakashi chart so just make sure in the back of your head you know the hakashi is not the real price it's the average price instead of just looking at the hakashi candles we're going to be looking at both the real time and the hakashi at the same time so we can read and understand the chart better to do this just go to trading view go to the indicators tab and type in hakashi this will show both the real-time candles above and the hakashi candlesticks right below it now that we have the indicator added let's move on to the strategy so when trading it's a lot harder to find Trends than you might think not all Trends are going to look this simple and just have all green candlesticks going up most of the time they're going to look like this a strong Trend going up but having multiple pullbacks with red candlesticks which also might give you false signals on when to sell that's where the hakashi comes in instead of looking at this trend with a bunch of false signals that may get you to panic cell we're going to be looking at the hakashi in most cases it'll have all the same color candlesticks and a strong Trend this way it's easier to identify the trend in real time that's exactly what the hakashi is for it helps eliminate unwanted noise and shows a clearer version of the price movement let's move on to how to identify the trend there are three simple rules you must follow to identify an uptrend the hakashi candlesticks must be green they must have large bodies and they have no lower wicks in this example this would be a strong long Trend all the candles are green they have large bodies and they don't have lower Wicks it's the complete opposite for a downtrend all the candlesticks must be red have large bodies and have no upper Wicks so we all know charts gain and lose momentum all the time after a strong upwards Trend most of the time the chart will lose momentum and do a reversal in the opposite direction luckily the hocky gashi is great at finding when that moment is about to happen you can identify when a reversal is about to happen by this a doge candle a dogee candle is a Candlestick with Wix on both sides has a small body and it can be either color depending if you want to go long or short so we're going to take advantage of what we just learned the Only Rule you have to follow is you only enter after you see a dogee candle and you wait for two candles in the opposite direction with opposite features let me show you an example so you know what I mean so here you can see the price is making a downtrend then we see the chart make a dogee candle in the opposite color which indicates that there's a very good chance the price will make a reversal then we wait for two green candles with only Wicks on the top to appear to confirm the reversal if the candle has a wick on the top and the bottom we do not count that candle once the second candle with a wick only on the top appears we enter the trade so this right here will be our entry signal let me show you an example of a short the market is in an uptrend we wait to see a dogee candle appear in the opposite color we then wait for two large red candles to appear with only Wicks on the bottom once we see the two candlesticks we enter the trade so that's the hakashi indicator explains simply in a nutshell now I'm going to show you how to add another indicator to this strategy to make it that much more effective and more importantly more profitable the indicator we're going to be adding to the strategy is the stastics indicator I'm not going to be going too in depth with this indicator because one it's very simple to use and two I don't want this video to be too long to describe it simply the stochastics indicator is a lot like RSI as in if the lines are crossing above the Top Line the market is being overbought if the lines are crossing below the bottom line the market is being oversold so as an example here the lines are crossing below the bottom line indicating the market is oversold and it's likely to reverse up upwards just like most indicators though this indicator by itself isn't very good but combined with other indicators it's extremely powerful to add this indicator go to indicators tab type in stochastics and click this one right here now let me show you how to combine these two indicators to make a very powerful strategy first things first if we want to go long we want to find a point in the chart where the Scholastics indicator is crossing below the bottom line and there is weak downwards momentum we we do not want to enter a trade if the Scholastics lines are crossing below the bottom line and there's strong downwards momentum because odds are the price will keep on falling here's a perfect example the Scholastic lines are crossing below the bottom line there's a downtrend but a very weak downtrend we then wait for a dogee candle to appear once it does wait for two large body candlesticks with only Wicks at the top then we enter the trade here's one more example Scholastic lines are crossing below the bottom line there's a weak downtrend wait for the dogee candle wait for two large green candles with only Wicks on top enter the trade profit I just showed you a profitable trading strategy using the hakashi and Scholastics indicator all I ask in return is if you take 2 seconds out of your day and like this video if you want to see one of the strategies I use when day trading check out this video right here because this strategy works great on the one minute time frame I'll see you guys next time","id":"2G78zkuQSc0","title":"The Heikin Ashi Trading Strategy (Simple & Effective)","microformat":{"playerMicroformatRenderer":{"thumbnail":{"thumbnails":[{"url":"https://i.ytimg.com/vi/2G78zkuQSc0/maxresdefault.jpg","width":1280,"height":720}]},"embed":{"iframeUrl":"https://www.youtube.com/embed/2G78zkuQSc0","width":1280,"height":720},"title":{"simpleText":"The Heikin Ashi Trading Strategy (Simple & Effective)"},"description":{"simpleText":"The Heikin Ashi is a very popular indicator. Whether you've used it or not, it's a great weapon to add to your trading strategies. In this video, I pair it with the stochastics indicator. \n\nIf you learned something new, leave a like.\n\nTradingView: https://www.tradingview.com/?offer_id=10&aff_id=28566\n\nMy trading discord: https://discord.gg/nHqDYZuuK2\n\nðŸ”´ Subscribe for more videos just like this: https://www.youtube.com/channel/UCCbv0qixG-cyokxEY3kELtg?sub_confirmation=1\n\nFollow TradingLab: \n===============================\nðŸ“¸ - IG: https://www.instagram.com/tradinglabofficial/"},"lengthSeconds":"365","ownerProfileUrl":"http://www.youtube.com/@TradingLabOfficial","externalChannelId":"UCCbv0qixG-cyokxEY3kELtg","isFamilySafe":true,"availableCountries":["AD","AE","AF","AG","AI","AL","AM","AO","AQ","AR","AS","AT","AU","AW","AX","AZ","BA","BB","BD","BE","BF","BG","BH","BI","BJ","BL","BM","BN","BO","BQ","BR","BS","BT","BV","BW","BY","BZ","CA","CC","CD","CF","CG","CH","CI","CK","CL","CM","CN","CO","CR","CU","CV","CW","CX","CY","CZ","DE","DJ","DK","DM","DO","DZ","EC","EE","EG","EH","ER","ES","ET","FI","FJ","FK","FM","FO","FR","GA","GB","GD","GE","GF","GG","GH","GI","GL","GM","GN","GP","GQ","GR","GS","GT","GU","GW","GY","HK","HM","HN","HR","HT","HU","ID","IE","IL","IM","IN","IO","IQ","IR","IS","IT","JE","JM","JO","JP","KE","KG","KH","KI","KM","KN","KP","KR","KW","KY","KZ","LA","LB","LC","LI","LK","LR","LS","LT","LU","LV","LY","MA","MC","MD","ME","MF","MG","MH","MK","ML","MM","MN","MO","MP","MQ","MR","MS","MT","MU","MV","MW","MX","MY","MZ","NA","NC","NE","NF","NG","NI","NL","NO","NP","NR","NU","NZ","OM","PA","PE","PF","PG","PH","PK","PL","PM","PN","PR","PS","PT","PW","PY","QA","RE","RO","RS","RU","RW","SA","SB","SC","SD","SE","SG","SH","SI","SJ","SK","SL","SM","SN","SO","SR","SS","ST","SV","SX","SY","SZ","TC","TD","TF","TG","TH","TJ","TK","TL","TM","TN","TO","TR","TT","TV","TW","TZ","UA","UG","UM","US","UY","UZ","VA","VC","VE","VG","VI","VN","VU","WF","WS","YE","YT","ZA","ZM","ZW"],"isUnlisted":false,"hasYpcMetadata":false,"viewCount":"693564","category":"Education","publishDate":"2021-10-17T10:10:21-07:00","ownerChannelName":"TradingLab","uploadDate":"2021-10-17T10:10:21-07:00","isShortsEligible":false,"externalVideoId":"2G78zkuQSc0","likeCount":"37442"}},"tracks":[{"language":"English (auto-generated)","transcript":[{"text":"in this video I'm going to show you a","start":"0.28","dur":"3.96"},{"text":"strategy using the hakashi indicator","start":"1.8","dur":"4.44"},{"text":"it's great at finding Trends and even","start":"4.24","dur":"4.12"},{"text":"better at finding reversals I'm also","start":"6.24","dur":"4.2"},{"text":"going to be adding another indicator to","start":"8.36","dur":"4.159"},{"text":"this strategy to make it that much more","start":"10.44","dur":"4"},{"text":"effective let's get straight to it for","start":"12.519","dur":"3.84"},{"text":"all the beginners out there or for the","start":"14.44","dur":"3.919"},{"text":"people who don't know what the hakashi","start":"16.359","dur":"3.961"},{"text":"indicator is let me give you a quick","start":"18.359","dur":"4.121"},{"text":"overview so what we're looking at now","start":"20.32","dur":"4.64"},{"text":"looks as if it's just a normal chart","start":"22.48","dur":"4.48"},{"text":"right well actually we're looking at the","start":"24.96","dur":"4.76"},{"text":"hakashi indicator at work hakashi","start":"26.96","dur":"5.68"},{"text":"actually means average bar in Japanese","start":"29.72","dur":"4.679"},{"text":"so that's exactly what it's doing","start":"32.64","dur":"4.079"},{"text":"finding the average in the candlesticks","start":"34.399","dur":"4.68"},{"text":"so this is the real time chart and this","start":"36.719","dur":"4.68"},{"text":"is the hakashi chart so just make sure","start":"39.079","dur":"3.96"},{"text":"in the back of your head you know the","start":"41.399","dur":"4.64"},{"text":"hakashi is not the real price it's the","start":"43.039","dur":"5"},{"text":"average price instead of just looking at","start":"46.039","dur":"3.84"},{"text":"the hakashi candles we're going to be","start":"48.039","dur":"4.081"},{"text":"looking at both the real time and the","start":"49.879","dur":"5.2"},{"text":"hakashi at the same time so we can read","start":"52.12","dur":"5.119"},{"text":"and understand the chart better to do","start":"55.079","dur":"4.12"},{"text":"this just go to trading view go to the","start":"57.239","dur":"4.64"},{"text":"indicators tab and type in hakashi this","start":"59.199","dur":"4.561"},{"text":"will show both the real-time candles","start":"61.879","dur":"4.161"},{"text":"above and the hakashi candlesticks right","start":"63.76","dur":"4.039"},{"text":"below it now that we have the indicator","start":"66.04","dur":"4.04"},{"text":"added let's move on to the strategy so","start":"67.799","dur":"4.481"},{"text":"when trading it's a lot harder to find","start":"70.08","dur":"3.92"},{"text":"Trends than you might think not all","start":"72.28","dur":"3.479"},{"text":"Trends are going to look this simple and","start":"74","dur":"3.799"},{"text":"just have all green candlesticks going","start":"75.759","dur":"3.561"},{"text":"up most of the time they're going to","start":"77.799","dur":"4.201"},{"text":"look like this a strong Trend going up","start":"79.32","dur":"4.92"},{"text":"but having multiple pullbacks with red","start":"82","dur":"4.439"},{"text":"candlesticks which also might give you","start":"84.24","dur":"4.4"},{"text":"false signals on when to sell that's","start":"86.439","dur":"4.401"},{"text":"where the hakashi comes in instead of","start":"88.64","dur":"3.68"},{"text":"looking at this trend with a bunch of","start":"90.84","dur":"3.279"},{"text":"false signals that may get you to panic","start":"92.32","dur":"3.24"},{"text":"cell we're going to be looking at the","start":"94.119","dur":"4.04"},{"text":"hakashi in most cases it'll have all the","start":"95.56","dur":"4.64"},{"text":"same color candlesticks and a strong","start":"98.159","dur":"4.64"},{"text":"Trend this way it's easier to identify","start":"100.2","dur":"4.84"},{"text":"the trend in real time that's exactly","start":"102.799","dur":"4.161"},{"text":"what the hakashi is for it helps","start":"105.04","dur":"3.96"},{"text":"eliminate unwanted noise and shows a","start":"106.96","dur":"4"},{"text":"clearer version of the price movement","start":"109","dur":"3.88"},{"text":"let's move on to how to identify the","start":"110.96","dur":"4.199"},{"text":"trend there are three simple rules you","start":"112.88","dur":"4.96"},{"text":"must follow to identify an uptrend the","start":"115.159","dur":"5.28"},{"text":"hakashi candlesticks must be green they","start":"117.84","dur":"5.12"},{"text":"must have large bodies and they have no","start":"120.439","dur":"5.121"},{"text":"lower wicks in this example this would","start":"122.96","dur":"5.159"},{"text":"be a strong long Trend all the candles","start":"125.56","dur":"4.52"},{"text":"are green they have large bodies and","start":"128.119","dur":"3.84"},{"text":"they don't have lower Wicks it's the","start":"130.08","dur":"4.08"},{"text":"complete opposite for a downtrend all","start":"131.959","dur":"4.28"},{"text":"the candlesticks must be red have large","start":"134.16","dur":"4.92"},{"text":"bodies and have no upper Wicks so we all","start":"136.239","dur":"5.121"},{"text":"know charts gain and lose momentum all","start":"139.08","dur":"4.799"},{"text":"the time after a strong upwards Trend","start":"141.36","dur":"4.36"},{"text":"most of the time the chart will lose","start":"143.879","dur":"4"},{"text":"momentum and do a reversal in the","start":"145.72","dur":"4.2"},{"text":"opposite direction luckily the hocky","start":"147.879","dur":"4.36"},{"text":"gashi is great at finding when that","start":"149.92","dur":"4.039"},{"text":"moment is about to happen you can","start":"152.239","dur":"3.72"},{"text":"identify when a reversal is about to","start":"153.959","dur":"4.92"},{"text":"happen by this a doge candle a dogee","start":"155.959","dur":"5.441"},{"text":"candle is a Candlestick with Wix on both","start":"158.879","dur":"4.961"},{"text":"sides has a small body and it can be","start":"161.4","dur":"4.32"},{"text":"either color depending if you want to go","start":"163.84","dur":"3.92"},{"text":"long or short so we're going to take","start":"165.72","dur":"4"},{"text":"advantage of what we just learned the","start":"167.76","dur":"4.64"},{"text":"Only Rule you have to follow is you only","start":"169.72","dur":"5.519"},{"text":"enter after you see a dogee candle and","start":"172.4","dur":"5.44"},{"text":"you wait for two candles in the opposite","start":"175.239","dur":"4.92"},{"text":"direction with opposite features let me","start":"177.84","dur":"3.84"},{"text":"show you an example so you know what I","start":"180.159","dur":"3.561"},{"text":"mean so here you can see the price is","start":"181.68","dur":"4.16"},{"text":"making a downtrend then we see the chart","start":"183.72","dur":"4.239"},{"text":"make a dogee candle in the opposite","start":"185.84","dur":"4.16"},{"text":"color which indicates that there's a","start":"187.959","dur":"4.041"},{"text":"very good chance the price will make a","start":"190","dur":"4.48"},{"text":"reversal then we wait for two green","start":"192","dur":"4.959"},{"text":"candles with only Wicks on the top to","start":"194.48","dur":"4.679"},{"text":"appear to confirm the reversal if the","start":"196.959","dur":"4.2"},{"text":"candle has a wick on the top and the","start":"199.159","dur":"4.481"},{"text":"bottom we do not count that candle once","start":"201.159","dur":"4.761"},{"text":"the second candle with a wick only on","start":"203.64","dur":"4.92"},{"text":"the top appears we enter the trade so","start":"205.92","dur":"4.879"},{"text":"this right here will be our entry signal","start":"208.56","dur":"4.2"},{"text":"let me show you an example of a short","start":"210.799","dur":"3.961"},{"text":"the market is in an uptrend we wait to","start":"212.76","dur":"3.88"},{"text":"see a dogee candle appear in the","start":"214.76","dur":"4.119"},{"text":"opposite color we then wait for two","start":"216.64","dur":"4.64"},{"text":"large red candles to appear with only","start":"218.879","dur":"4.36"},{"text":"Wicks on the bottom once we see the two","start":"221.28","dur":"4.239"},{"text":"candlesticks we enter the trade so","start":"223.239","dur":"4.521"},{"text":"that's the hakashi indicator explains","start":"225.519","dur":"4.041"},{"text":"simply in a nutshell now I'm going to","start":"227.76","dur":"4.039"},{"text":"show you how to add another indicator to","start":"229.56","dur":"4.519"},{"text":"this strategy to make it that much more","start":"231.799","dur":"4.321"},{"text":"effective and more importantly more","start":"234.079","dur":"3.641"},{"text":"profitable the indicator we're going to","start":"236.12","dur":"3.64"},{"text":"be adding to the strategy is the","start":"237.72","dur":"3.799"},{"text":"stastics indicator I'm not going to be","start":"239.76","dur":"4.119"},{"text":"going too in depth with this indicator","start":"241.519","dur":"5.08"},{"text":"because one it's very simple to use and","start":"243.879","dur":"4.841"},{"text":"two I don't want this video to be too","start":"246.599","dur":"3.92"},{"text":"long to describe it simply the","start":"248.72","dur":"4.84"},{"text":"stochastics indicator is a lot like RSI","start":"250.519","dur":"5"},{"text":"as in if the lines are crossing above","start":"253.56","dur":"3.84"},{"text":"the Top Line the market is being","start":"255.519","dur":"3.68"},{"text":"overbought if the lines are crossing","start":"257.4","dur":"3.679"},{"text":"below the bottom line the market is","start":"259.199","dur":"4.801"},{"text":"being oversold so as an example here the","start":"261.079","dur":"5.081"},{"text":"lines are crossing below the bottom line","start":"264","dur":"4.44"},{"text":"indicating the market is oversold and","start":"266.16","dur":"4.52"},{"text":"it's likely to reverse up upwards just","start":"268.44","dur":"4.16"},{"text":"like most indicators though this","start":"270.68","dur":"4.64"},{"text":"indicator by itself isn't very good but","start":"272.6","dur":"4.8"},{"text":"combined with other indicators it's","start":"275.32","dur":"4.84"},{"text":"extremely powerful to add this indicator","start":"277.4","dur":"5.68"},{"text":"go to indicators tab type in stochastics","start":"280.16","dur":"5.12"},{"text":"and click this one right here now let me","start":"283.08","dur":"3.6"},{"text":"show you how to combine these two","start":"285.28","dur":"3.84"},{"text":"indicators to make a very powerful","start":"286.68","dur":"4.28"},{"text":"strategy first things first if we want","start":"289.12","dur":"4"},{"text":"to go long we want to find a point in","start":"290.96","dur":"3.72"},{"text":"the chart where the Scholastics","start":"293.12","dur":"3.84"},{"text":"indicator is crossing below the bottom","start":"294.68","dur":"4.239"},{"text":"line and there is weak downwards","start":"296.96","dur":"4.12"},{"text":"momentum we we do not want to enter a","start":"298.919","dur":"4.201"},{"text":"trade if the Scholastics lines are","start":"301.08","dur":"4.119"},{"text":"crossing below the bottom line and","start":"303.12","dur":"4.24"},{"text":"there's strong downwards momentum","start":"305.199","dur":"4.28"},{"text":"because odds are the price will keep on","start":"307.36","dur":"4.32"},{"text":"falling here's a perfect example the","start":"309.479","dur":"4.241"},{"text":"Scholastic lines are crossing below the","start":"311.68","dur":"4.2"},{"text":"bottom line there's a downtrend but a","start":"313.72","dur":"4.44"},{"text":"very weak downtrend we then wait for a","start":"315.88","dur":"4.8"},{"text":"dogee candle to appear once it does wait","start":"318.16","dur":"4.599"},{"text":"for two large body candlesticks with","start":"320.68","dur":"4.799"},{"text":"only Wicks at the top then we enter the","start":"322.759","dur":"5.521"},{"text":"trade here's one more example Scholastic","start":"325.479","dur":"4.761"},{"text":"lines are crossing below the bottom line","start":"328.28","dur":"3.639"},{"text":"there's a weak downtrend wait for the","start":"330.24","dur":"3.76"},{"text":"dogee candle wait for two large green","start":"331.919","dur":"4.441"},{"text":"candles with only Wicks on top enter the","start":"334","dur":"4.84"},{"text":"trade profit I just showed you a","start":"336.36","dur":"4.44"},{"text":"profitable trading strategy using the","start":"338.84","dur":"4.6"},{"text":"hakashi and Scholastics indicator all I","start":"340.8","dur":"4.6"},{"text":"ask in return is if you take 2 seconds","start":"343.44","dur":"3.96"},{"text":"out of your day and like this video if","start":"345.4","dur":"3.919"},{"text":"you want to see one of the strategies I","start":"347.4","dur":"3.88"},{"text":"use when day trading check out this","start":"349.319","dur":"3.841"},{"text":"video right here because this strategy","start":"351.28","dur":"4.24"},{"text":"works great on the one minute time frame","start":"353.16","dur":"6.879"},{"text":"I'll see you guys next time","start":"355.52","dur":"4.519"}]}],"isLive":false,"languages":[{"label":"English (auto-generated)","languageCode":"en"}],"isLoginRequired":false,"playabilityStatus":{"status":"OK","playableInEmbed":true,"miniplayer":{"miniplayerRenderer":{"playbackMode":"PLAYBACK_MODE_ALLOW"}},"contextParams":"Q0FFU0FnZ0M="},"author":"TradingLab","channelId":"UCCbv0qixG-cyokxEY3kELtg","keywords":["data trader","day trading","heikin ashi trading","heikin ashi strategy","heikin ashi trading strategies","how to use heikin ashi candlesticks","heikin ashi tutorial","heiken ashi indicator strategy","heikin ashi candlestick strategy","heikin ashi candlesticks","heiken ashi stochastic strategy","heiken ashi scalping strategy","heikin ashi candles explained","heikin ashi trading strategy","Heikin Ashi scalping strategy","Heikin Ashi how to read","What is heikin ashi candle","heikin ashi"]},{"text":"The super trend indicator. Known for it s simplicity, and it s scary predictiveness of the market. Even by itself, this indicator is pretty decent. But in this video, I m going to share one of my secret strategies I like to do with this indicator, that make s it so much better. Let s get straight to it. If you haven t heard or used this indicator before, well its pretty good at finding trends in the market. Hence the name. Why this indicator is so powerful is because it does not only track the momentum of the market, but it also uses ATR. Which basically means that it also takes volatility into consideration. I m going to show you how to take advantage of this and make a lot of profitable trades. First, let s add the indicator to our chart. To do this, just go to the indicators tab on trading view, type in super trend and make sure your select this one right here. It s probably one of the easiest indicators to use on the planet. When the line s green, you buy. When the line is red you sell. Pretty self explanatory. But just like any other indicator, this indicator by itself has some problems. Let me explain. As you can see here, the indicator is doing a great job at finding the trend. It s great at showing when the market has high momentum in either direction. The problem is, the indictor is always giving buy and sell signals, even when the market is moving sideways and doesn t have a lot of momentum. And as we all know when the market is moving sideways with little momentum, it s very risky, and very hard to predict which direction it will go. And as you can see, whenever the market does moves sideways, the indicator has some losing trades. That s exactly why, if you just use this indicator by itself, and went in every time it said buy your portfolio probably wouldn t look too hot. But, I m going to show you a solution to this problem, so we only go in if the market is truly in a trend. The first strategy I m going to share with you is a great one to have in your trading arsenal. And that involves adding 3 super tend indicators. Let s go a little more in depth. Once you have 3 super tend indicators added to your chart, you re going to want to change the settings a bit. Go to the inputs tab and change the ATR period to 12 and the atr multiplier to 3. The next one you are going to set it as 10, then 1. Then the 3rd one you are going to set it as 11, then 2. Then go to the style tab and turn off these long and short icons. So when you are done, your chart should look something like this. Now how this strategy works, is we will only go in if all the lines are the same color. Let me show you an example. So here you can two of the lines are green, but one of the lines are red. This is telling us that market isn t in full momentum, and is moving sideways. So we don t go in yet. We wait for a little bit, until all the lines turn green, we enter a long posistion here. And look what happens, the chart goes up. Let s look at one more example. Here we are looking for a short trade, 2 of the top lines are red, but the bottom line is still green. We wait it out until all the lines turn red, enter a short trade here, profit. Now, you may be asking yourself, but how do I know when to exit the trade ? Well that s a good question, there are actually a lot of different ways to know when to exit the trade. You can do the classic, set a take profit at a 1.5 ratio. Whenever the price hit s that mark you exit the trade. Another exit strategy is when one of the lines change color. So here you can see all the lines turned the same color, we entered, we got a bunch of profit, then once one of the lines turn red, we exit the trade. Another strategy can use is the pairing the super trend indicator with a 200 day moving average. Why this strategy is so powerful, is because the super trend indicator is very good at finding short term trend, and the 200 day is good at finding long term trends. Let s add these indicators to our chart. Go to the indicators tab, add the super trend indicator, and just keep the default settings. Next had an exponential moving average, and change the length to 200. Now that we have the indicators set up, lets move on to how to actually use this strategy. The strategy is simple. We will only enter a long trade if the super trend line is green, and the price is above the 200 day moving average. We only enter a short trade, if the super trend line is red, and the price is below the 200 day moving average. let me show you an example. So here you can see the super trend line is green, but the price is not above the 200 day moving average yet, so we wait. Once the price is over the 200 day, and the line is still green, this is where we enter the trade. You can exit the trade, by doing a 1.5 profit ratio, or by selling simply when the super trend line turns red. Let s take a look at a short example. As you can see, the super trend line is red. But, the price is still above the 200 day, we wait for the price to go below the 200 day, make sure the super trend line is still red, and then we enter a short trade. Next, I m going to show you a bonus strategy using the ichimoku indicator. To add this indicator, go to the indicators tab and type in ichimoku. We are also going to clean up our chart because this indicator s default setting are really messy. Just uncheck the top 3 box, and the change these plot backgrounds to purple, so it s easier to see. Now that we have that setup, let me explain how the strategy works. So this purple are is called the kumo cloud. We will only enter a long trade if the super trend line is green, and the price is above the kumo cloud. We will not enter the trade if the price is is in, or below the cloud. It s the exact opposite for shorting. We only enter a short trade if the super trend line red, and the price is below the kumo cloud. Let me show you an example. So here the super trend line is green, but the price is still below the kumo cloud, so we wait. Then the price enters the kumo cloud, but we still wait until it is above the kumo cloud. We wait, then it finally goes above, we make sure are super trend line is still green. We enter the trade. Here s a short example. The super trend line is red, we don t enter until the price goes below the kumo cloud, once it does, we enter the trade. For exit strategies, you can again do a 1.5 profit ration, or you can exit the trade once the price goes inside the kumo cloud. Let me show you an example. So here we entered a trade because the super trend line was green and the price was above the kumo cloud. The price starts go, the heads back down into the kumo cloud. The moment the price hits the cloud, we exit the trade. I just showed 3 different strategies to use with the super trend indicator. All I ask in return is if you take 2 seconds out of your day and like this video. Try these three strategies and let me know which one worked the best for you! If you want to see 4 price action secrets that only the top 5% of traders know, watch this video, because I give away some pretty insane secrets. Thanks for watching, and ill see you guys next time.","id":"21b5QF-b0rE","microformat":{"playerMicroformatRenderer":{"category":"Education","description":{"simpleText":"Want to learn how to find trends in markets? Well, you made it to the right video. In this video, I explain three different strategies to help you find not only trends, but powerful ones. Enjoy!\n\nIf you learned something new, leave a like.\n\nðŸ”´ Subscribe for more videos just like this: https://www.youtube.com/channel/UCCbv0qixG-cyokxEY3kELtg?sub_confirmation=1\n\nMy trading Discord: https://discord.gg/nHqDYZuuK2\n\nFollow TradingLab: \n===============================\nðŸ“¸ - IG: https://www.instagram.com/tradinglabofficial/"},"externalChannelId":"UCCbv0qixG-cyokxEY3kELtg","lengthSeconds":"402","ownerChannelName":"TradingLab","publishDate":"2021-10-25","title":{"simpleText":"How To Identify Trends in Markets (Never Guess Again)"}}},"isLive":false,"isLoginRequired":false,"languages":[{"label":"en","languageCode":"en"}],"playabilityStatus":{"status":"OK","reason":""},"title":"How To Identify Trends in Markets (Never Guess Again)","tracks":[{"language":"en","transcript":[{"start":"0.359","dur":"4.831","text":"The super trend indicator. Known for it s\nsimplicity, and it s scary predictiveness"},{"start":"5.19","dur":"5.21","text":"of the market. Even by itself, this indicator\nis pretty decent. But in this video, I m going"},{"start":"10.4","dur":"4.439","text":"to share one of my secret strategies I like\nto do with this indicator, that make s it"},{"start":"14.839","dur":"4.831","text":"so much better. Let s get straight to it.\nIf you haven t heard or used this indicator"},{"start":"19.67","dur":"5.34","text":"before, well its pretty good at finding trends\nin the market. Hence the name. Why this indicator"},{"start":"25.01","dur":"4.91","text":"is so powerful is because it does not only\ntrack the momentum of the market, but it also"},{"start":"29.92","dur":"4.67","text":"uses ATR. Which basically means that it also\ntakes volatility into consideration."},{"start":"34.59","dur":"4.87","text":"I m going to show you how to take advantage\nof this and make a lot of profitable trades."},{"start":"39.46","dur":"4.349","text":"First, let s add the indicator to our chart.\nTo do this, just go to the indicators tab"},{"start":"43.81","dur":"4.34","text":"on trading view, type in super trend and make\nsure your select this one right here."},{"start":"48.15","dur":"4.79","text":"It s probably one of the easiest indicators\nto use on the planet. When the line s green,"},{"start":"52.94","dur":"3.709","text":"you buy. When the line is red you sell. Pretty\nself explanatory."},{"start":"56.649","dur":"4.84","text":"But just like any other indicator, this indicator\nby itself has some problems. Let me explain."},{"start":"61.489","dur":"4.411","text":"As you can see here, the indicator is doing\na great job at finding the trend. It s great"},{"start":"65.9","dur":"5.63","text":"at showing when the market has high momentum\nin either direction. The problem is, the indictor"},{"start":"71.53","dur":"4.86","text":"is always giving buy and sell signals, even\nwhen the market is moving sideways and doesn"},{"start":"76.39","dur":"3.31","text":"t have a lot of momentum.\nAnd as we all know when the market is moving"},{"start":"79.7","dur":"5.48","text":"sideways with little momentum, it s very risky,\nand very hard to predict which direction it"},{"start":"85.18","dur":"1","text":"will go.\nAnd as you can see, whenever the market does"},{"start":"86.18","dur":"1","text":"moves sideways, the indicator has some losing\ntrades."},{"start":"87.18","dur":"3.799","text":"That s exactly why, if you just use this indicator\nby itself, and went in every time it said"},{"start":"90.979","dur":"2.941","text":"buy your portfolio probably wouldn t look\ntoo hot."},{"start":"93.92","dur":"4.92","text":"But, I m going to show you a solution to this\nproblem, so we only go in if the market is"},{"start":"98.84","dur":"2.9","text":"truly in a trend.\nThe first strategy I m going to share with"},{"start":"101.74","dur":"4.948","text":"you is a great one to have in your trading\narsenal. And that involves adding 3 super"},{"start":"106.689","dur":"2.661","text":"tend indicators. Let s go a little more in\ndepth."},{"start":"109.35","dur":"3.92","text":"Once you have 3 super tend indicators added\nto your chart, you re going to want to change"},{"start":"113.27","dur":"3.848","text":"the settings a bit.\nGo to the inputs tab and change the ATR period"},{"start":"117.119","dur":"6.061","text":"to 12 and the atr multiplier to 3. The next\none you are going to set it as 10, then 1."},{"start":"123.18","dur":"3.24","text":"Then the 3rd one you are going to set it as\n11, then 2."},{"start":"126.42","dur":"3.89","text":"Then go to the style tab and turn off these\nlong and short icons."},{"start":"130.31","dur":"2.64","text":"So when you are done, your chart should look\nsomething like this."},{"start":"132.95","dur":"5.63","text":"Now how this strategy works, is we will only\ngo in if all the lines are the same color."},{"start":"138.58","dur":"3.53","text":"Let me show you an example.\nSo here you can two of the lines are green,"},{"start":"142.11","dur":"5.56","text":"but one of the lines are red. This is telling\nus that market isn t in full momentum, and"},{"start":"147.67","dur":"5.55","text":"is moving sideways. So we don t go in yet.\nWe wait for a little bit, until all the lines"},{"start":"153.22","dur":"4.29","text":"turn green, we enter a long posistion here.\nAnd look what happens, the chart goes up."},{"start":"157.51","dur":"3.49","text":"Let s look at one more example.\nHere we are looking for a short trade, 2 of"},{"start":"161","dur":"5.271","text":"the top lines are red, but the bottom line\nis still green. We wait it out until all the"},{"start":"166.271","dur":"2.589","text":"lines turn red, enter a short trade here,\nprofit."},{"start":"168.86","dur":"4.63","text":"Now, you may be asking yourself, but how do\nI know when to exit the trade ? Well that"},{"start":"173.49","dur":"4.23","text":"s a good question, there are actually a lot\nof different ways to know when to exit the"},{"start":"177.72","dur":"2.659","text":"trade.\nYou can do the classic, set a take profit"},{"start":"180.379","dur":"4.231","text":"at a 1.5 ratio. Whenever the price hit s that\nmark you exit the trade."},{"start":"184.61","dur":"3.8","text":"Another exit strategy is when one of the lines\nchange color."},{"start":"188.41","dur":"4.549","text":"So here you can see all the lines turned the\nsame color, we entered, we got a bunch of"},{"start":"192.959","dur":"3.261","text":"profit, then once one of the lines turn red,\nwe exit the trade."},{"start":"196.22","dur":"5","text":"Another strategy can use is the pairing the\nsuper trend indicator with a 200 day moving"},{"start":"201.22","dur":"5.01","text":"average. Why this strategy is so powerful,\nis because the super trend indicator is very"},{"start":"206.23","dur":"6.74","text":"good at finding short term trend, and the\n200 day is good at finding long term trends."},{"start":"212.97","dur":"6.129","text":"Let s add these indicators to our chart. Go\nto the indicators tab, add the super trend"},{"start":"219.099","dur":"4.882","text":"indicator, and just keep the default settings.\nNext had an exponential moving average, and"},{"start":"223.981","dur":"3.728","text":"change the length to 200.\nNow that we have the indicators set up, lets"},{"start":"227.709","dur":"4.95","text":"move on to how to actually use this strategy.\nThe strategy is simple. We will only enter"},{"start":"232.659","dur":"5.181","text":"a long trade if the super trend line is green,\nand the price is above the 200 day moving"},{"start":"237.84","dur":"2.509","text":"average.\nWe only enter a short trade, if the super"},{"start":"240.349","dur":"4.311","text":"trend line is red, and the price is below\nthe 200 day moving average."},{"start":"244.66","dur":"3.13","text":"let me show you an example.\nSo here you can see the super trend line is"},{"start":"247.79","dur":"4.949","text":"green, but the price is not above the 200\nday moving average yet, so we wait. Once the"},{"start":"252.739","dur":"6.11","text":"price is over the 200 day, and the line is\nstill green, this is where we enter the trade."},{"start":"258.849","dur":"5.171","text":"You can exit the trade, by doing a 1.5 profit\nratio, or by selling simply when the super"},{"start":"264.02","dur":"3.269","text":"trend line turns red.\nLet s take a look at a short example."},{"start":"267.289","dur":"4.611","text":"As you can see, the super trend line is red.\nBut, the price is still above the 200 day,"},{"start":"271.9","dur":"4.12","text":"we wait for the price to go below the 200\nday, make sure the super trend line is still"},{"start":"276.02","dur":"4.34","text":"red, and then we enter a short trade.\nNext, I m going to show you a bonus strategy"},{"start":"280.36","dur":"4.579","text":"using the ichimoku indicator. To add this\nindicator, go to the indicators tab and type"},{"start":"284.94","dur":"3.42","text":"in ichimoku.\nWe are also going to clean up our chart because"},{"start":"288.36","dur":"5.11","text":"this indicator s default setting are really\nmessy. Just uncheck the top 3 box, and the"},{"start":"293.471","dur":"3.628","text":"change these plot backgrounds to purple, so\nit s easier to see."},{"start":"297.099","dur":"3.49","text":"Now that we have that setup, let me explain\nhow the strategy works."},{"start":"300.589","dur":"5.241","text":"So this purple are is called the kumo cloud.\nWe will only enter a long trade if the super"},{"start":"305.83","dur":"5.588","text":"trend line is green, and the price is above\nthe kumo cloud. We will not enter the trade"},{"start":"311.419","dur":"5.33","text":"if the price is is in, or below the cloud.\nIt s the exact opposite for shorting. We only"},{"start":"316.749","dur":"5.271","text":"enter a short trade if the super trend line\nred, and the price is below the kumo cloud."},{"start":"322.02","dur":"3.221","text":"Let me show you an example.\nSo here the super trend line is green, but"},{"start":"325.241","dur":"5.648","text":"the price is still below the kumo cloud, so\nwe wait. Then the price enters the kumo cloud,"},{"start":"330.889","dur":"5.15","text":"but we still wait until it is above the kumo\ncloud. We wait, then it finally goes above,"},{"start":"336.039","dur":"4.22","text":"we make sure are super trend line is still\ngreen. We enter the trade."},{"start":"340.259","dur":"5.78","text":"Here s a short example. The super trend line\nis red, we don t enter until the price goes"},{"start":"346.039","dur":"4.301","text":"below the kumo cloud, once it does, we enter\nthe trade."},{"start":"350.34","dur":"5.74","text":"For exit strategies, you can again do a 1.5\nprofit ration, or you can exit the trade once"},{"start":"356.08","dur":"2.678","text":"the price goes inside the kumo cloud.\nLet me show you an example."},{"start":"358.759","dur":"4.59","text":"So here we entered a trade because the super\ntrend line was green and the price was above"},{"start":"363.349","dur":"5.19","text":"the kumo cloud. The price starts go, the heads\nback down into the kumo cloud. The moment"},{"start":"368.539","dur":"5.22","text":"the price hits the cloud, we exit the trade.\nI just showed 3 different strategies to use"},{"start":"373.759","dur":"4.231","text":"with the super trend indicator. All I ask\nin return is if you take 2 seconds out of"},{"start":"377.99","dur":"3.62","text":"your day and like this video.\nTry these three strategies and let me know"},{"start":"381.61","dur":"4.049","text":"which one worked the best for you!\nIf you want to see 4 price action secrets"},{"start":"385.659","dur":"5.391","text":"that only the top 5% of traders know, watch\nthis video, because I give away some pretty"},{"start":"391.05","dur":"3.428","text":"insane secrets.\nThanks for watching, and ill see you guys"},{"start":"394.479","dur":"7.83","text":"next time."}]}]},{"text":"I found a trading strategy that profited 130% in just 2 months of trading. It involves using just 2 indicators, and best of all, both of them are completely free on TradingView. The strategy is extremely easy to use, works in all markets, and it s insanely profitable. Make sure you stick around till the end of the video, because Ill be sharing some secrets to make this strategy even better and I m going to share the backtest results, to show you how it performed while taking 100 trades. Let s get straight to it. First things first, you need to get on tradingview. I ll leave a link in the description. Once your on the chart, type in any security you want to trade with. Like I said earlier, this strategy works with basically any security, so there really isn t a wrong answer. For this example, I m going to use doge. Because, why not. Once you ve selected what you want to trade. Your going to add the first indicator. The first indicator is the dema, or the double ema. If you don t know what the dema is, its basically an upgraded version of the exponential moving average. It was created in 1994 and was made to give faster signals with less lag compared to a normal ema. So this is a double exponential moving average (the blue one) and a normal exponential moving average (the red one). As you can see, the double exponential moving average is a lot lower, and is giving entry signals a lot faster than the normal ema. Which in return is giving us a lot less lag. You should also understand though, that less lag is not always a good thing. This Is because lag can sometimes help filter out noise and give a higher success rate at times. But I backtested this strategy with both a double exponential moving average and a normal moving average. And the dema performed better with this specific strategy. Once you have the double exponential moving average added, we have to change the settings a bit. Go to the settings of double exponential moving average, and we want to change the length to 200. Then go to the style tab and we are going to change it to blue, just so it s a bit easier to see. The second indicator for this strategy is one that we ve used on this channel before, and that is the supertrend indicator. To add it, go to the indicators tab, and type in super trend. Make sure to choose this one right here. Go to the settings of the super trend indicator, and make sure to change the ATR period to 12 and the ATR multiplier to 3. Now that we have the indicators added and all the settings are correct. Lets get on with how to use this strategy. In this example we are trading on DOGE/USD on the 15 minute time frame. The first rule of the strategy, is that we will only enter a long trade if the price is above the dema, the blue line. If the price isn t above the blue line, we will not enter the trade. The 2nd rule we must follow is that, the supertrend indicator must give a buy signal. Let me show you an example. So here, the price is above the 200 dema, but the super trend indicator hasn t given a buy signal yet, so we wait. We then wait and the super trend gives a buy signal. It is also important to note, that you must wait for the buy signal candle to close before entering. This candle could give a buy signal, but change before it closes. Keeping it a sell signal. So make sure you are only entering after the buy signal candle closes. Once the candle closes, we enter the trade. You are going to set your stop loss at the buy signal line of the super trend indicator. So for this example right here. Then the cool thing about this strategy is that we basically have infinite profit potential. Unlike my other trading strategies, where you set a 1.5 or 2 profit ratio, we are going to do something different with this strategy. We are only going to sell once the supertrend indicator becomes a sell signal. That s one of the reasons why this strategy is so powerful because you are going to have some trades where there s going to be a 4.2 profit ratio, or even higher. So going back to the example. We saw that the price was above the 200 dema, and the supertrend indicator gave a buy signal. We then enter the trade after the candle closed, and set our stop loss at the buy signal of the supertrend indicator. We the wait while the price goes up, for a sell signal from the supertrend indicator. The supertrend indicator then turns red and gives a sell signal. This is when we exit the trade. And as you can see, we got a profitable trade with a 4.1 profit ratio. Let s do one more example. We see price just crossed the dema, we wait for a buy signal from the supertrend, we enter, set our stop loss at the buy signal of the supertrend, then wait for a sell signal. Once we see one. We exit the trade. Profit. Lets go over an example of a short trade. After that, I will be sharing some secrets tips for you guys to help make this strategy even more profitable. Ill also share how this strategy did while making 100 trades. So for a short trade, you are going to be doing the exact opposite. Make sure the price is below the 200 dema, wait for a sell signal to occur, once it does, enter the trade, set the stop loss at the sell signal, then stay in the trade till you see a buy signal. Once you see one. Exit the trade. Profit. Now, it s time to go over some secret tips to make this strategy even better. One tip I would recommend, is for a situation like this. Where the price is below the blue line, but the super trend indicator is giving a buy signal. What I d recommend doing here, is waiting for the price to cross the 200 dema, and then entering. Rather then not going in this trade because the buy signal came before crossing the dema, we will still enter once the price crosses the dema line. If you only entered when the price is above the blue line, and then the super trend indicator gives a buy signal, in that order. you would miss out on a lot of opportunities like this one. Another tip for using this strategy is maybe implementing another indicator called the Fibonacci Bollinger Bands. I didn t end up backtesting the strategy with this indicator, but I did look at a couple examples and saw you would get potentially more profit if using this indicator with the strategy. If one you wants to backtest this strategy with the Fibonnaci bolling bands added, leave in the comments what the results were, if the strategy was better with, or without them. Because again, I want to make this channel a community where we all help each other out. But lets get on to how to use the fibonnaci Bollinger bands with this strategy. So all you have to do is go to the indicators tab, and type in fbb for fibonnaci bolliner bands. Then go to the settings of the indicator, and uncheck all the boxes besides the boxes with the 1 s. Then change the colors to red just so you can see the lines better. These lines are basically going to be acting as the absolute highs and lows for the price. So if the price ever touches the red line, we are going to sell immediately, even if the super trend indicator still has a buy signal. If the price does ever hit the fibonnaci Bollinger band, it usually reflects off it and goes the opposite direction. So as you can see in this example. The price hit our Bollinger band, so we sold here, even though the super trend indicator was still green. And if we fast forward, we made more money selling here, then if sold when the super trend indicator told us. The price will rarely high these fibonnaci Bollinger bands, but if it does. Sell. Like Is said, I didn t backtest this strategy with the Bollinger bands, but I did check a couple example with it, and it was more profitable a majority of the time. Next, let s take a look at the back test results for the original strategy. For this backtest, I traded both doge/usd and LTC/usd. I did 100 trades. Which took a round 2.5 months. The most wins in a row I had with this strategy was 8, and the most losses in a row was 3. This stat by itself, is insanely good for a trading strategy. The total amount of gains from the 100 trades was 130.14% and the trading strategy had a success rate of 60% with 60 winning trades, and 40 loosing trades. If you want to learn how to backtest trades like this and test your own personal strategies, watch this video where I go over how to do so and backtest your strategies with years of data on tradingview, so you can see just how profitable your strategies actually are. Thanks for watching and ill see you guys, next time.","id":"g-PLctW8aU0","microformat":{"playerMicroformatRenderer":{"category":"Education","description":{"simpleText":"I found a strategy that profited 130.14% in just 2 and half months of trading. Thought Id share it with you guys. Hope you enjoy!\n\nIf you learned something new, leave a like.\n\nâ–º My Trading Discord: https://discord.gg/nHqDYZuuK2\n\nâ–º TradingView (Chart Software I Use): https://www.tradingview.com/?offer_id=10&aff_id=28566\n\nâ–º Get 2 FREE stocks valued up to $1850 (when you deposit $100): https://act.webull.com/on/A6BoDyk5xy2A/zbk/inviteUs/main\n\nâ–º Get up to $250 in Crypto Currency: https://blockfi.com/?ref=ca9f3260\n\nðŸ”´ Subscribe for more videos just like this: https://www.youtube.com/channel/UCCbv0qixG-cyokxEY3kELtg?sub_confirmation=1\n\nFollow TradingLab: \n===============================\nðŸ“¸ - IG: https://www.instagram.com/tradinglabofficial/\n\nâ±ï¸ Timestamps\n00:00 - Start\n00:46 - Indicators\n02:20 - Long Examples\n04:46 - Short Examples\n05:06 - Secret Trading Tips\n07:19 - BackTest Results\n\n\n*None of this is meant to be construed as investment advice, it's for entertainment purposes only. The links above include affiliate commissions or referrals. I'm part of an affiliate network and I receive compensation from partnering websites. The video is accurate as of the posting date but may not be accurate in the future."},"externalChannelId":"UCCbv0qixG-cyokxEY3kELtg","lengthSeconds":"504","ownerChannelName":"TradingLab","publishDate":"2021-11-18","title":{"simpleText":"Highly Profitable DEMA + SuperTrend Trading Strategy"}}},"isLive":false,"isLoginRequired":false,"languages":[{"label":"en","languageCode":"en"}],"playabilityStatus":{"status":"OK","reason":""},"title":"Highly Profitable DEMA + SuperTrend Trading Strategy","tracks":[{"language":"en","transcript":[{"start":"0.229","dur":"6.491","text":"I found a trading strategy that profited 130%\nin just 2 months of trading. It involves using"},{"start":"6.72","dur":"4.94","text":"just 2 indicators, and best of all, both of\nthem are completely free on TradingView. The"},{"start":"11.66","dur":"5.679","text":"strategy is extremely easy to use, works in\nall markets, and it s insanely profitable."},{"start":"17.339","dur":"3.69","text":"Make sure you stick around till the end of\nthe video, because Ill be sharing some secrets"},{"start":"21.029","dur":"4.32","text":"to make this strategy even better and I m\ngoing to share the backtest results, to show"},{"start":"25.35","dur":"4.339","text":"you how it performed while taking 100 trades.\nLet s get straight to it."},{"start":"29.689","dur":"3.771","text":"First things first, you need to get on tradingview.\nI ll leave a link in the description. Once"},{"start":"33.46","dur":"4.22","text":"your on the chart, type in any security you\nwant to trade with. Like I said earlier, this"},{"start":"37.68","dur":"4.309","text":"strategy works with basically any security,\nso there really isn t a wrong answer."},{"start":"41.989","dur":"3.979","text":"For this example, I m going to use doge. Because,\nwhy not."},{"start":"45.969","dur":"3.282","text":"Once you ve selected what you want to trade.\nYour going to add the first indicator. The"},{"start":"49.251","dur":"3.467","text":"first indicator is the dema, or the double\nema."},{"start":"52.719","dur":"6.211","text":"If you don t know what the dema is, its basically\nan upgraded version of the exponential moving"},{"start":"58.93","dur":"5.94","text":"average. It was created in 1994 and was made\nto give faster signals with less lag compared"},{"start":"64.87","dur":"4.35","text":"to a normal ema.\nSo this is a double exponential moving average"},{"start":"69.22","dur":"3.54","text":"(the blue one) and a normal exponential moving\naverage (the red one)."},{"start":"72.76","dur":"4.61","text":"As you can see, the double exponential moving\naverage is a lot lower, and is giving entry"},{"start":"77.37","dur":"6.08","text":"signals a lot faster than the normal ema.\nWhich in return is giving us a lot less lag."},{"start":"83.45","dur":"5.33","text":"You should also understand though, that less\nlag is not always a good thing. This Is because"},{"start":"88.78","dur":"4.589","text":"lag can sometimes help filter out noise and\ngive a higher success rate at times."},{"start":"93.37","dur":"5.1","text":"But I backtested this strategy with both a\ndouble exponential moving average and a normal"},{"start":"98.47","dur":"5.66","text":"moving average. And the dema performed better\nwith this specific strategy."},{"start":"104.13","dur":"4.25","text":"Once you have the double exponential moving\naverage added, we have to change the settings"},{"start":"108.38","dur":"2.65","text":"a bit.\nGo to the settings of double exponential moving"},{"start":"111.03","dur":"4.79","text":"average, and we want to change the length\nto 200. Then go to the style tab and we are"},{"start":"115.82","dur":"3","text":"going to change it to blue, just so it s a\nbit easier to see."},{"start":"118.82","dur":"4.36","text":"The second indicator for this strategy is\none that we ve used on this channel before,"},{"start":"123.18","dur":"5.288","text":"and that is the supertrend indicator.\nTo add it, go to the indicators tab, and type"},{"start":"128.469","dur":"3.391","text":"in super trend. Make sure to choose this one\nright here."},{"start":"131.86","dur":"4.41","text":"Go to the settings of the super trend indicator,\nand make sure to change the ATR period to"},{"start":"136.27","dur":"5.299","text":"12 and the ATR multiplier to 3.\nNow that we have the indicators added and"},{"start":"141.569","dur":"3.81","text":"all the settings are correct. Lets get on\nwith how to use this strategy."},{"start":"145.379","dur":"4.75","text":"In this example we are trading on DOGE/USD\non the 15 minute time frame."},{"start":"150.129","dur":"5.39","text":"The first rule of the strategy, is that we\nwill only enter a long trade if the price"},{"start":"155.519","dur":"6.8","text":"is above the dema, the blue line. If the price\nisn t above the blue line, we will not enter"},{"start":"162.319","dur":"3.7","text":"the trade.\nThe 2nd rule we must follow is that, the supertrend"},{"start":"166.019","dur":"3.181","text":"indicator must give a buy signal. Let me show\nyou an example."},{"start":"169.2","dur":"4.42","text":"So here, the price is above the 200 dema,\nbut the super trend indicator hasn t given"},{"start":"173.62","dur":"5.11","text":"a buy signal yet, so we wait.\nWe then wait and the super trend gives a buy"},{"start":"178.73","dur":"4.729","text":"signal. It is also important to note, that\nyou must wait for the buy signal candle to"},{"start":"183.459","dur":"5.381","text":"close before entering. This candle could give\na buy signal, but change before it closes."},{"start":"188.84","dur":"4.75","text":"Keeping it a sell signal. So make sure you\nare only entering after the buy signal candle"},{"start":"193.59","dur":"2.97","text":"closes.\nOnce the candle closes, we enter the trade."},{"start":"196.56","dur":"4.86","text":"You are going to set your stop loss at the\nbuy signal line of the super trend indicator."},{"start":"201.42","dur":"4.399","text":"So for this example right here.\nThen the cool thing about this strategy is"},{"start":"205.819","dur":"4.751","text":"that we basically have infinite profit potential.\nUnlike my other trading strategies, where"},{"start":"210.57","dur":"5.44","text":"you set a 1.5 or 2 profit ratio, we are going\nto do something different with this strategy."},{"start":"216.01","dur":"4.44","text":"We are only going to sell once the supertrend\nindicator becomes a sell signal."},{"start":"220.45","dur":"4.569","text":"That s one of the reasons why this strategy\nis so powerful because you are going to have"},{"start":"225.019","dur":"5.28","text":"some trades where there s going to be a 4.2\nprofit ratio, or even higher."},{"start":"230.299","dur":"6.33","text":"So going back to the example. We saw that\nthe price was above the 200 dema, and the"},{"start":"236.629","dur":"5.11","text":"supertrend indicator gave a buy signal. We\nthen enter the trade after the candle closed,"},{"start":"241.739","dur":"4.039","text":"and set our stop loss at the buy signal of\nthe supertrend indicator."},{"start":"245.779","dur":"4.41","text":"We the wait while the price goes up, for a\nsell signal from the supertrend indicator."},{"start":"250.189","dur":"3.871","text":"The supertrend indicator then turns red and\ngives a sell signal."},{"start":"254.06","dur":"4.19","text":"This is when we exit the trade. And as you\ncan see, we got a profitable trade with a"},{"start":"258.25","dur":"1.76","text":"4.1 profit ratio.\nLet s do one more example."},{"start":"260.01","dur":"6.74","text":"We see price just crossed the dema, we wait\nfor a buy signal from the supertrend, we enter,"},{"start":"266.75","dur":"5.131","text":"set our stop loss at the buy signal of the\nsupertrend, then wait for a sell signal. Once"},{"start":"271.881","dur":"5.009","text":"we see one. We exit the trade. Profit.\nLets go over an example of a short trade."},{"start":"276.89","dur":"3.59","text":"After that, I will be sharing some secrets\ntips for you guys to help make this strategy"},{"start":"280.48","dur":"5.97","text":"even more profitable. Ill also share how this\nstrategy did while making 100 trades."},{"start":"286.45","dur":"4.46","text":"So for a short trade, you are going to be\ndoing the exact opposite. Make sure the price"},{"start":"290.91","dur":"7.191","text":"is below the 200 dema, wait for a sell signal\nto occur, once it does, enter the trade, set"},{"start":"298.101","dur":"4.749","text":"the stop loss at the sell signal, then stay\nin the trade till you see a buy signal. Once"},{"start":"302.85","dur":"8.95","text":"you see one. Exit the trade. Profit.\nNow, it s time to go over some secret tips"},{"start":"311.8","dur":"4.82","text":"to make this strategy even better. One tip\nI would recommend, is for a situation like"},{"start":"316.62","dur":"5.23","text":"this. Where the price is below the blue line,\nbut the super trend indicator is giving a"},{"start":"321.85","dur":"2.95","text":"buy signal.\nWhat I d recommend doing here, is waiting"},{"start":"324.8","dur":"3.299","text":"for the price to cross the 200 dema, and then\nentering."},{"start":"328.1","dur":"5.44","text":"Rather then not going in this trade because\nthe buy signal came before crossing the dema,"},{"start":"333.54","dur":"3.42","text":"we will still enter once the price crosses\nthe dema line."},{"start":"336.96","dur":"4.82","text":"If you only entered when the price is above\nthe blue line, and then the super trend indicator"},{"start":"341.78","dur":"4.89","text":"gives a buy signal, in that order. you would\nmiss out on a lot of opportunities like this"},{"start":"346.67","dur":"2.97","text":"one.\nAnother tip for using this strategy is maybe"},{"start":"349.64","dur":"4.2","text":"implementing another indicator called the\nFibonacci Bollinger Bands."},{"start":"353.84","dur":"4.93","text":"I didn t end up backtesting the strategy with\nthis indicator, but I did look at a couple"},{"start":"358.77","dur":"4.04","text":"examples and saw you would get potentially\nmore profit if using this indicator with the"},{"start":"362.811","dur":"1","text":"strategy.\nIf one you wants to backtest this strategy"},{"start":"363.811","dur":"2.139","text":"with the Fibonnaci bolling bands added, leave\nin the comments what the results were, if"},{"start":"365.95","dur":"4.93","text":"the strategy was better with, or without them.\nBecause again, I want to make this channel"},{"start":"370.88","dur":"4.71","text":"a community where we all help each other out.\nBut lets get on to how to use the fibonnaci"},{"start":"375.59","dur":"3.94","text":"Bollinger bands with this strategy.\nSo all you have to do is go to the indicators"},{"start":"379.53","dur":"4.3","text":"tab, and type in fbb for fibonnaci bolliner\nbands."},{"start":"383.83","dur":"4.75","text":"Then go to the settings of the indicator,\nand uncheck all the boxes besides the boxes"},{"start":"388.58","dur":"4.6","text":"with the 1 s. Then change the colors to red\njust so you can see the lines better."},{"start":"393.18","dur":"5.69","text":"These lines are basically going to be acting\nas the absolute highs and lows for the price."},{"start":"398.87","dur":"4.37","text":"So if the price ever touches the red line,\nwe are going to sell immediately, even if"},{"start":"403.24","dur":"2.6","text":"the super trend indicator still has a buy\nsignal."},{"start":"405.84","dur":"4.87","text":"If the price does ever hit the fibonnaci Bollinger\nband, it usually reflects off it and goes"},{"start":"410.71","dur":"3.76","text":"the opposite direction.\nSo as you can see in this example. The price"},{"start":"414.47","dur":"5.11","text":"hit our Bollinger band, so we sold here, even\nthough the super trend indicator was still"},{"start":"419.58","dur":"4.79","text":"green. And if we fast forward, we made more\nmoney selling here, then if sold when the"},{"start":"424.37","dur":"3.88","text":"super trend indicator told us.\nThe price will rarely high these fibonnaci"},{"start":"428.25","dur":"4.93","text":"Bollinger bands, but if it does. Sell.\nLike Is said, I didn t backtest this strategy"},{"start":"433.18","dur":"4.519","text":"with the Bollinger bands, but I did check\na couple example with it, and it was more"},{"start":"437.7","dur":"4.47","text":"profitable a majority of the time.\nNext, let s take a look at the back test results"},{"start":"442.17","dur":"4.98","text":"for the original strategy.\nFor this backtest, I traded both doge/usd"},{"start":"447.15","dur":"6.239","text":"and LTC/usd. I did 100 trades. Which took\na round 2.5 months. The most wins in a row"},{"start":"453.39","dur":"6.76","text":"I had with this strategy was 8, and the most\nlosses in a row was 3. This stat by itself,"},{"start":"460.15","dur":"2.28","text":"is insanely good for a trading strategy.\nThe total amount of gains from the 100 trades"},{"start":"462.43","dur":"5.489","text":"was 130.14% and the trading strategy had a\nsuccess rate of 60% with 60 winning trades,"},{"start":"467.92","dur":"11.75","text":"and 40 loosing trades.\nIf you want to learn how to backtest trades"},{"start":"479.67","dur":"5.33","text":"like this and test your own personal strategies,\nwatch this video where I go over how to do"},{"start":"485","dur":"5.14","text":"so and backtest your strategies with years\nof data on tradingview, so you can see just"},{"start":"490.14","dur":"5.26","text":"how profitable your strategies actually are.\nThanks for watching and ill see you guys,"},{"start":"495.4","dur":"5.84","text":"next time."}]}]},{"text":"The Fibonacci sequence. Seen in many forms of nature all around the world. Flower petals, shells, galaxies, hurricanes, and even faces? So it s seen all around in nature, but can we use it in trading to help predict markets? The Fibonacci sequence starts like this. Each number is the sum of the two numbers before that. It s a simple pattern, but it appears to be a kind of built in numbering system in nature. And it s one of the reasons why charts, look like this, creating higher highs and higher lows. So can we use this tool to help find a specific spot where a pullback has a high chance of bouncing off and creating a new higher high? Yes. And I m going to tell you exactly how to use the fibonnaci retracement tool the right way, what a common mistake people make while using it, and show you how to exit your trades correctly so you get the most profit as possible. Let s get straight to it. So what are fibonnaci retracements? They are key levels from the fibonnaci retracement tool, that can help you find the reversal of a pullback. Let me show you a great example of when to use these levels. A lot of traders like to wait and trade off a pullback. Considering 1. it s usually at a cheap and great price and 2. It s usually a place where a change in price will happen. This is usually how a normal trade would go. You see an uptrend. You also notice there is a key level acting as both a support and resistance. So you now know, if the price does end up making a pullback at that level, there s a great chance of it bouncing off and creating new higher high. Making it a great level to buy if It shows confirmation. But what if you were in a position like this? Where the price went up and made a pullback, but there weren t any previous key levels of support or resistance. How do you know where the key levels are for a reversal to happen? The answer? The fibonnaci retracement tool. If we plot these levels, you can see the price respected them, and actually used these levels as a key support. Another great example of the finbonnci s magic is the Snp 500. If we go back to when Corona hit, you can see this Fibonacci tool predicted the exact bottom for the crash. Let s go over the best settings for this tool. To do that, get on Tradingview. If you don t have it, ill leave a link in the description. Next, click this icon right here, and make sure it s on fibonnaci retracement. Just place it anywhere on the chart, and click the setting icon. What we want to do, is uncheck 0.382 and the uncheck all the other boxes after 1. Next, uncheck the background. I know the colors are fancy, but this mostly just makes your chart messy. Then uncheck prices, and change the levels from values, to precents. These are the settings that I have found work the best for me, and it make s it look really clean on the chart. So now that we have the correct settings, let move on to how to use tool correctly. First things first, we need to find a clear trend. In this example, you can see a clear trend. With an swing high, and an swing low. The next step is to drag your fibonnaci retracement tool from the swing low, to the swing high. One common mistake that I see a lot of traders making is that drag from the candles body, rather than the candles wick. The price didn t stop here. Sure it might of ended up here, but this was not the lowest it went. So when making your fibonnaci levels, make sure you are going all the way down to the wick. So once you have dragged your fibonnaci retracement tool from the swing low, to the swing high. It s time to understand how to read these levels. So with my specific settings you are going to have 6 levels. The 0% level is basically you starting point. The other 5 levels are your pullback levels. Meaning that if price hits one of these levels and respects it, and starts reversing. It s very likely that it will go up to the next highest level or even higher. The most common levels you will see this happen with, are these three levels. 23.60, 50, and 61.80. A lot of traders will call this area the golden zone . This tool will also tell us what is considered a pullback. If the price bounces off any of these lines, its considered a pullback. Meaning there s a chance for it to bounce off and go to the next level. If the price beaks below the 100 line, it will likely try to come back, and fall. Starting a downtrend. So it s important to note. If the price ever goes below your 100 line, it s pretty likely it will fall a lot more after that. You should also understand that you need to treat these levels just as you would for support and resistances. They are not solid line, they are areas. Meaning, the price is not always going to respect the exact level where the line is. Just because the price falls below a line, doesn t necessarily mean it has broken that area. It could still reverse from this point. So I guess what I m trying to say, is don t treat these levels as an exact measurement. You just should be treating them as a guide. How do you know which level the price will reverse at? Well how about I show you an example. So, here we found a clear trend upwards. We identified the swing low of the trend, and the swing high. Next, we select our fibonnaci retracement tool, and dragged from the swing lows wick, to the swing high s wick. Next, we see what price does. We see the price retested this 0% level, but just as I said before, just because price breaks through a level, doesn t necessarily mean its certain. So as you can see it test the level and got rejected. It end up doing that two more times, telling us that it really want to go above this level. Next we see come down to the 23.60% level. And look how much it Is respecting this line. Once I see this candle right here, I m probably entering the trade, because I can be pretty certain the price will go up from here as a pullback, or at lease go to the 0% level. So I set my stop loss right below the 23.60% line and then I m going to sell half my shares at the 0% line. Let s see what the price does. It turns out we were right, and the price went up the 0% line, give us a nice little profit. So, we sell half our shares so guarantee that profit. But we are not done. As I said before. Price has tried breaking through this line multiple times, telling us it really wants to go up from here. So that s why we are keeping half our shares in the game. We see that price breaks through the level, and comes back down and respects it. This right here, is like seeing gold on your screen. The price broke through, made a slight pull back and respected the highest level. Meaning, it s about to make a big move upward. After I see a bit of confirmation. I raise my stop loss below the 0% level. Then look what happens. The price sky rockets. So as a quick overview. Let s go over some key moments of this trade. There were multiple times price tried breaking through the 0 line, but we never entered at these points, because there was never any confirmation it was going up. Another key point is when the price went down to the 23.60% level, we only entered after seeing the price respected this line, and gave us confirmation it was going up. Just because the price hits a line, doesn t mean it will respect it. You should always be looking for confirmation. It is a very important concept to understand when using the fibonnaci retracement tool. Example is ltcusd Nov 9 Here Is another great example. We found a clear trend upwards. We identified the swing low and the swing high. We made sure to put our levels all the way to the wicks. Then we wait and see what price does. We see that price slightly respects this level by 1 candle resisting it, but probably not enough information to enter the trade yet. Then price tries to break the 0 line and then come and reverses back to the 23.60 line. We then see a candle appear, not even thinking about respecting this line at all, breaking right through it. This might be a good spot to enter a short, but you probably need a bit more confirmation. So, we wait. We see it kind of bounce off the 50% line, then hits it again, going through it. Then the price consolidates in this area, not know what it wants to do. Whenever price consolidates like this. Price can go in either direction. So it s usually not a good time to enter. It ends up breaking up wards, going all the way to the 23.60 line again, but then gets rejected. After seeing this confirmation candle, this would be a pretty nice place to enter a short trade. Considering the price is respecting this resistance, and last time this happened it went down to the 61.80 line. We see price goes back down to where it did before, and does another one of those reversals going back to the 23.60 line and respecting it another time. So if you missed going in the time before this, the is an absolute great time to enter a short trade. So now that we are for sure in the trade now. I should also mention. That you should be selling a percentage of your trade for each level that gets hit. Get the profit confirmation. Its very important rule, and is critical to become a profitable trader. So what does price do? It drops back down to the 50% line. It sort of respects, but is still kind of unsure. We still sell around 25% of our shares at this level, for guaranteed profit. Next we see a monster of a candle break through the 61.80 line. The next couple candles start respecting this line. We sell another 25% of our original entry and see what price does. It goes up breaking through the 61.80 line and doesn t quite make it to the 50 line, after losing momentum, it drops back down to the 78.60 line. So we now know, this 78.60 line is a pretty strong support, considering the price keeps stoping right around here. So we know, if price ever breaks through this point, It s going to drop hard. And look what happens, price breaks through it. Making it go all the way down below the 100 level. We sell another 25% of our original entry and keep the last of the money in the trade for high return gains. We ve now made a really good profit, and we are even still in the trade. And look what happens the price price comes back up the to the 100 level, starts resisting. This right here, is that gold moment I was talking about before. After seeing this, we have a pretty good idea the price will drop. A lot. And look what happens. Price drops. Another key tip will help you guys out a lot, is if you ever find a fibonnaci level where it matches up with a key level of support, like this example. The white line was placed here, because it way key support level on the daily time frame. Then we have the red 23.60% line from the fibonnaci right by it. This means, that this level right here, is very likely to be a strong support or resistance. And as you can see. The price did exactly that and treated this area as a strong resistance. So some key takeaways. You should be treating your fibonnaci levels as areas not solid lines. Always wait for confirmation before entering a trade. Sell percentage of position for every level that is hit. If you find an area with a strong daily support and a fibonnaci level, there is greater chance price will respect that level. If you want to use the fibonnaci retracement tool to grow a small sized stock account. Watch this video, because I go over the best way to grow a stock account with a small balance efficiently as possible. Thanks for watching, and I ll see you guys next time.","id":"iL76k2A9ono","microformat":{"playerMicroformatRenderer":{"category":"Education","description":{"simpleText":"The Fibonacci retracement tool can be a very great guide for finding important levels if used right. In this video, I tell you how to use the Fibonacci retracement tool, a common mistake people make while using it, and how to find the right place to sell. Enjoy!\n\nIf you learned something new, leave a like.\n\nâ–º TradingView (Chart Software I Use): https://www.tradingview.com/?offer_id=10&aff_id=28566\n\nâ–º Get 2 FREE stocks valued up to $1850 (when you deposit $100): https://act.webull.com/on/A6BoDyk5xy2A/zbk/inviteUs/main\n\nâ–º Get up to $250 in Crypto Currency: https://blockfi.com/?ref=ca9f3260\n\nðŸ”´ Subscribe for more videos just like this: https://www.youtube.com/channel/UCCbv0qixG-cyokxEY3kELtg?sub_confirmation=1\n\nFollow TradingLab: \n===============================\nðŸ“¸ - IG: https://www.instagram.com/tradinglabofficial/\n\nâ±ï¸ Timestamps\n00:00 - The Fibonacci Sequence\n00:58 - Why You Should Be Using The Fibonacci Retracement Tool\n02:16 - Best Fibonacci Settings\n02:54 - How to Use The Fibonacci Retracement Tool\n05:06 - Example One (Long Example)\n07:45 - Example Two (Short Example)\n11:04 - Fibonacci Retracement Tool Tip\n\n\n*None of this is meant to be construed as investment advice, it's for entertainment purposes only. The links above include affiliate commissions or referrals. I'm part of an affiliate network and I receive compensation from partnering websites. The video is accurate as of the posting date but may not be accurate in the future."},"externalChannelId":"UCCbv0qixG-cyokxEY3kELtg","lengthSeconds":"737","ownerChannelName":"TradingLab","publishDate":"2021-11-28","title":{"simpleText":"The ULTIMATE Fibonacci Retracement Tool Guide - Best Tips & Tricks"}}},"isLive":false,"isLoginRequired":false,"languages":[{"label":"en","languageCode":"en"}],"playabilityStatus":{"status":"OK","reason":""},"title":"The ULTIMATE Fibonacci Retracement Tool Guide - Best Tips & Tricks","tracks":[{"language":"en","transcript":[{"start":"0.299","dur":"6.81","text":"The Fibonacci sequence. Seen in many forms\nof nature all around the world. Flower petals,"},{"start":"7.11","dur":"5.79","text":"shells, galaxies, hurricanes, and even faces?\nSo it s seen all around in nature, but can"},{"start":"12.9","dur":"5.469","text":"we use it in trading to help predict markets?\nThe Fibonacci sequence starts like this. Each"},{"start":"18.37","dur":"5.309","text":"number is the sum of the two numbers before\nthat. It s a simple pattern, but it appears"},{"start":"23.679","dur":"2.76","text":"to be a kind of built in numbering system\nin nature."},{"start":"26.439","dur":"5.799","text":"And it s one of the reasons why charts, look\nlike this, creating higher highs and higher"},{"start":"32.239","dur":"3.791","text":"lows.\nSo can we use this tool to help find a specific"},{"start":"36.03","dur":"5.189","text":"spot where a pullback has a high chance of\nbouncing off and creating a new higher high?"},{"start":"41.22","dur":"4.95","text":"Yes. And I m going to tell you exactly how\nto use the fibonnaci retracement tool the"},{"start":"46.17","dur":"4.63","text":"right way, what a common mistake people make\nwhile using it, and show you how to exit your"},{"start":"50.8","dur":"7.38","text":"trades correctly so you get the most profit\nas possible. Let s get straight to it."},{"start":"58.18","dur":"5.05","text":"So what are fibonnaci retracements? They are\nkey levels from the fibonnaci retracement"},{"start":"63.23","dur":"3.54","text":"tool, that can help you find the reversal\nof a pullback."},{"start":"66.77","dur":"3.559","text":"Let me show you a great example of when to\nuse these levels."},{"start":"70.33","dur":"5.08","text":"A lot of traders like to wait and trade off\na pullback. Considering 1. it s usually at"},{"start":"75.41","dur":"5.68","text":"a cheap and great price and 2. It s usually\na place where a change in price will happen."},{"start":"81.09","dur":"4.379","text":"This is usually how a normal trade would go.\nYou see an uptrend. You also notice there"},{"start":"85.47","dur":"5.5","text":"is a key level acting as both a support and\nresistance. So you now know, if the price"},{"start":"90.97","dur":"4.5","text":"does end up making a pullback at that level,\nthere s a great chance of it bouncing off"},{"start":"95.47","dur":"5.56","text":"and creating new higher high. Making it a\ngreat level to buy if It shows confirmation."},{"start":"101.03","dur":"5.46","text":"But what if you were in a position like this?\nWhere the price went up and made a pullback,"},{"start":"106.49","dur":"4.79","text":"but there weren t any previous key levels\nof support or resistance. How do you know"},{"start":"111.28","dur":"2.72","text":"where the key levels are for a reversal to\nhappen?"},{"start":"114","dur":"5.11","text":"The answer? The fibonnaci retracement tool.\nIf we plot these levels, you can see the price"},{"start":"119.11","dur":"4.06","text":"respected them, and actually used these levels\nas a key support."},{"start":"123.17","dur":"5.91","text":"Another great example of the finbonnci s magic\nis the Snp 500. If we go back to when Corona"},{"start":"129.08","dur":"4.43","text":"hit, you can see this Fibonacci tool predicted\nthe exact bottom for the crash."},{"start":"133.51","dur":"5.33","text":"Let s go over the best settings for this tool.\nTo do that, get on Tradingview. If you don"},{"start":"138.84","dur":"4.851","text":"t have it, ill leave a link in the description.\nNext, click this icon right here, and make"},{"start":"143.691","dur":"5.158","text":"sure it s on fibonnaci retracement. Just place\nit anywhere on the chart, and click the setting"},{"start":"148.85","dur":"6.63","text":"icon. What we want to do, is uncheck 0.382\nand the uncheck all the other boxes after"},{"start":"155.48","dur":"2.83","text":"1.\nNext, uncheck the background. I know the colors"},{"start":"158.31","dur":"5.78","text":"are fancy, but this mostly just makes your\nchart messy. Then uncheck prices, and change"},{"start":"164.09","dur":"7.41","text":"the levels from values, to precents.\nThese are the settings that I have found work"},{"start":"171.5","dur":"2.94","text":"the best for me, and it make s it look really\nclean on the chart."},{"start":"174.44","dur":"4.54","text":"So now that we have the correct settings,\nlet move on to how to use tool correctly."},{"start":"178.98","dur":"2.86","text":"First things first, we need to find a clear\ntrend."},{"start":"181.84","dur":"4.869","text":"In this example, you can see a clear trend.\nWith an swing high, and an swing low."},{"start":"186.71","dur":"5.68","text":"The next step is to drag your fibonnaci retracement\ntool from the swing low, to the swing high."},{"start":"192.39","dur":"5.21","text":"One common mistake that I see a lot of traders\nmaking is that drag from the candles body,"},{"start":"197.6","dur":"3.96","text":"rather than the candles wick.\nThe price didn t stop here. Sure it might"},{"start":"201.56","dur":"5.399","text":"of ended up here, but this was not the lowest\nit went. So when making your fibonnaci levels,"},{"start":"206.959","dur":"2.331","text":"make sure you are going all the way down to\nthe wick."},{"start":"209.29","dur":"4.509","text":"So once you have dragged your fibonnaci retracement\ntool from the swing low, to the swing high."},{"start":"213.8","dur":"4.769","text":"It s time to understand how to read these\nlevels. So with my specific settings you are"},{"start":"218.569","dur":"5.611","text":"going to have 6 levels. The 0% level is basically\nyou starting point. The other 5 levels are"},{"start":"224.18","dur":"4.669","text":"your pullback levels. Meaning that if price\nhits one of these levels and respects it,"},{"start":"228.849","dur":"3.331","text":"and starts reversing.\nIt s very likely that it will go up to the"},{"start":"232.18","dur":"4.86","text":"next highest level or even higher.\nThe most common levels you will see this happen"},{"start":"237.04","dur":"7.97","text":"with, are these three levels. 23.60, 50, and\n61.80. A lot of traders will call this area"},{"start":"245.01","dur":"4.03","text":"the golden zone .\nThis tool will also tell us what is considered"},{"start":"249.04","dur":"5.39","text":"a pullback. If the price bounces off any of\nthese lines, its considered a pullback. Meaning"},{"start":"254.43","dur":"3.398","text":"there s a chance for it to bounce off and\ngo to the next level."},{"start":"257.829","dur":"11.631","text":"If the price beaks below the 100 line, it\nwill likely try to come back, and fall. Starting"},{"start":"269.46","dur":"4.389","text":"a downtrend.\nSo it s important to note. If the price ever"},{"start":"273.849","dur":"5.1","text":"goes below your 100 line, it s pretty likely\nit will fall a lot more after that."},{"start":"278.949","dur":"4.58","text":"You should also understand that you need to\ntreat these levels just as you would for support"},{"start":"283.529","dur":"4.241","text":"and resistances. They are not solid line,\nthey are areas."},{"start":"287.77","dur":"5.169","text":"Meaning, the price is not always going to\nrespect the exact level where the line is."},{"start":"292.939","dur":"5.04","text":"Just because the price falls below a line,\ndoesn t necessarily mean it has broken that"},{"start":"297.979","dur":"4.74","text":"area. It could still reverse from this point.\nSo I guess what I m trying to say, is don"},{"start":"302.719","dur":"4.57","text":"t treat these levels as an exact measurement.\nYou just should be treating them as a guide."},{"start":"307.289","dur":"4.77","text":"How do you know which level the price will\nreverse at? Well how about I show you an example."},{"start":"312.059","dur":"5.591","text":"So, here we found a clear trend upwards. We\nidentified the swing low of the trend, and"},{"start":"317.65","dur":"3","text":"the swing high.\nNext, we select our fibonnaci retracement"},{"start":"320.65","dur":"3.9","text":"tool, and dragged from the swing lows wick,\nto the swing high s wick."},{"start":"324.55","dur":"6.03","text":"Next, we see what price does. We see the price\nretested this 0% level, but just as I said"},{"start":"330.58","dur":"4.7","text":"before, just because price breaks through\na level, doesn t necessarily mean its certain."},{"start":"335.28","dur":"3.449","text":"So as you can see it test the level and got\nrejected."},{"start":"338.729","dur":"6.03","text":"It end up doing that two more times, telling\nus that it really want to go above this level."},{"start":"344.759","dur":"5.921","text":"Next we see come down to the 23.60% level.\nAnd look how much it Is respecting this line."},{"start":"350.68","dur":"5.229","text":"Once I see this candle right here, I m probably\nentering the trade, because I can be pretty"},{"start":"355.909","dur":"17.801","text":"certain the price will go up from here as\na pullback, or at lease go to the 0% level."},{"start":"373.71","dur":"9.019","text":"So I set my stop loss right below the 23.60%\nline and then I m going to sell half my shares"},{"start":"382.729","dur":"4.08","text":"at the 0% line.\nLet s see what the price does. It turns out"},{"start":"386.809","dur":"5.51","text":"we were right, and the price went up the 0%\nline, give us a nice little profit. So, we"},{"start":"392.32","dur":"6.1","text":"sell half our shares so guarantee that profit.\nBut we are not done. As I said before. Price"},{"start":"398.42","dur":"5.089","text":"has tried breaking through this line multiple\ntimes, telling us it really wants to go up"},{"start":"403.509","dur":"3.88","text":"from here. So that s why we are keeping half\nour shares in the game."},{"start":"407.389","dur":"4.641","text":"We see that price breaks through the level,\nand comes back down and respects it. This"},{"start":"412.03","dur":"5.319","text":"right here, is like seeing gold on your screen.\nThe price broke through, made a slight pull"},{"start":"417.349","dur":"5.25","text":"back and respected the highest level.\nMeaning, it s about to make a big move upward."},{"start":"422.599","dur":"6.171","text":"After I see a bit of confirmation. I raise\nmy stop loss below the 0% level. Then look"},{"start":"428.77","dur":"4.84","text":"what happens. The price sky rockets.\nSo as a quick overview. Let s go over some"},{"start":"433.61","dur":"5.75","text":"key moments of this trade. There were multiple\ntimes price tried breaking through the 0 line,"},{"start":"439.36","dur":"4.579","text":"but we never entered at these points, because\nthere was never any confirmation it was going"},{"start":"443.94","dur":"2.879","text":"up.\nAnother key point is when the price went down"},{"start":"446.819","dur":"6.331","text":"to the 23.60% level, we only entered after\nseeing the price respected this line, and"},{"start":"453.15","dur":"4.269","text":"gave us confirmation it was going up.\nJust because the price hits a line, doesn"},{"start":"457.419","dur":"4.491","text":"t mean it will respect it. You should always\nbe looking for confirmation. It is a very"},{"start":"461.91","dur":"3.879","text":"important concept to understand when using\nthe fibonnaci retracement tool."},{"start":"465.789","dur":"5.38","text":"Example is ltcusd Nov 9\nHere Is another great example. We found a"},{"start":"471.169","dur":"5.241","text":"clear trend upwards. We identified the swing\nlow and the swing high. We made sure to put"},{"start":"476.41","dur":"4.119","text":"our levels all the way to the wicks. Then\nwe wait and see what price does."},{"start":"480.529","dur":"5.37","text":"We see that price slightly respects this level\nby 1 candle resisting it, but probably not"},{"start":"485.899","dur":"5.681","text":"enough information to enter the trade yet.\nThen price tries to break the 0 line and then"},{"start":"491.58","dur":"5.898","text":"come and reverses back to the 23.60 line.\nWe then see a candle appear, not even thinking"},{"start":"497.479","dur":"3.81","text":"about respecting this line at all, breaking\nright through it."},{"start":"501.289","dur":"5.94","text":"This might be a good spot to enter a short,\nbut you probably need a bit more confirmation."},{"start":"507.229","dur":"5.961","text":"So, we wait. We see it kind of bounce off\nthe 50% line, then hits it again, going through"},{"start":"513.19","dur":"4.96","text":"it. Then the price consolidates in this area,\nnot know what it wants to do."},{"start":"518.15","dur":"8.57","text":"Whenever price consolidates like this. Price\ncan go in either direction. So it s usually"},{"start":"526.72","dur":"5.26","text":"not a good time to enter.\nIt ends up breaking up wards, going all the"},{"start":"531.98","dur":"6.359","text":"way to the 23.60 line again, but then gets\nrejected. After seeing this confirmation candle,"},{"start":"538.339","dur":"3.341","text":"this would be a pretty nice place to enter\na short trade."},{"start":"541.68","dur":"5.07","text":"Considering the price is respecting this resistance,\nand last time this happened it went down to"},{"start":"546.75","dur":"6.13","text":"the 61.80 line. We see price goes back down\nto where it did before, and does another one"},{"start":"552.88","dur":"6.209","text":"of those reversals going back to the 23.60\nline and respecting it another time."},{"start":"559.089","dur":"4.821","text":"So if you missed going in the time before\nthis, the is an absolute great time to enter"},{"start":"563.91","dur":"3.46","text":"a short trade.\nSo now that we are for sure in the trade now."},{"start":"567.37","dur":"4.34","text":"I should also mention. That you should be\nselling a percentage of your trade for each"},{"start":"571.71","dur":"5.749","text":"level that gets hit.\nGet the profit confirmation. Its very important"},{"start":"577.459","dur":"4.211","text":"rule, and is critical to become a profitable\ntrader. So what does price do?"},{"start":"581.67","dur":"5.849","text":"It drops back down to the 50% line. It sort\nof respects, but is still kind of unsure."},{"start":"587.519","dur":"5.56","text":"We still sell around 25% of our shares at\nthis level, for guaranteed profit."},{"start":"593.079","dur":"6.01","text":"Next we see a monster of a candle break through\nthe 61.80 line. The next couple candles start"},{"start":"599.089","dur":"4.75","text":"respecting this line.\nWe sell another 25% of our original entry"},{"start":"603.839","dur":"5.581","text":"and see what price does. It goes up breaking\nthrough the 61.80 line and doesn t quite make"},{"start":"609.42","dur":"6.18","text":"it to the 50 line, after losing momentum,\nit drops back down to the 78.60 line."},{"start":"615.6","dur":"6.539","text":"So we now know, this 78.60 line is a pretty\nstrong support, considering the price keeps"},{"start":"622.139","dur":"4.601","text":"stoping right around here. So we know, if\nprice ever breaks through this point, It s"},{"start":"626.74","dur":"3.469","text":"going to drop hard.\nAnd look what happens, price breaks through"},{"start":"630.209","dur":"6.19","text":"it. Making it go all the way down below the\n100 level. We sell another 25% of our original"},{"start":"636.399","dur":"4.701","text":"entry and keep the last of the money in the\ntrade for high return gains."},{"start":"641.1","dur":"6.739","text":"We ve now made a really good profit, and we\nare even still in the trade."},{"start":"647.839","dur":"5.49","text":"And look what happens the price price comes\nback up the to the 100 level, starts resisting."},{"start":"653.329","dur":"4.841","text":"This right here, is that gold moment I was\ntalking about before. After seeing this, we"},{"start":"658.17","dur":"3.359","text":"have a pretty good idea the price will drop.\nA lot."},{"start":"661.529","dur":"5.471","text":"And look what happens. Price drops.\nAnother key tip will help you guys out a lot,"},{"start":"667","dur":"4.62","text":"is if you ever find a fibonnaci level where\nit matches up with a key level of support,"},{"start":"671.62","dur":"4.05","text":"like this example. The white line was placed\nhere, because it way key support level on"},{"start":"675.67","dur":"3.9","text":"the daily time frame.\nThen we have the red 23.60% line from the"},{"start":"679.57","dur":"8.24","text":"fibonnaci right by it. This means, that this\nlevel right here, is very likely to be a strong"},{"start":"687.81","dur":"3.839","text":"support or resistance.\nAnd as you can see. The price did exactly"},{"start":"691.649","dur":"4.75","text":"that and treated this area as a strong resistance.\nSo some key takeaways."},{"start":"696.399","dur":"4.711","text":"You should be treating your fibonnaci levels\nas areas not solid lines."},{"start":"701.11","dur":"3.12","text":"Always wait for confirmation before entering\na trade."},{"start":"704.23","dur":"3.81","text":"Sell percentage of position for every level\nthat is hit."},{"start":"708.04","dur":"5.46","text":"If you find an area with a strong daily support\nand a fibonnaci level, there is greater chance"},{"start":"713.5","dur":"3.92","text":"price will respect that level.\nIf you want to use the fibonnaci retracement"},{"start":"717.42","dur":"4.62","text":"tool to grow a small sized stock account.\nWatch this video, because I go over the best"},{"start":"722.04","dur":"5.68","text":"way to grow a stock account with a small balance\nefficiently as possible. Thanks for watching,"},{"start":"727.72","dur":"1.408","text":"and I ll see you guys next time."}]}]},{"text":"Has this ever happened to you? Your trading strategy gives you all the signals to enter a trade, so you enter. The chart is looking extremely nice, and you re confident the price is about to go up. You set your stop loss, set your take profit, and then have you eyes glued to the monitor. It turns out you were right about the chart going up, but unfortunately, the price barely hit your stop loss before doing so. Resulting this as a losing trade, and most importantly, missing out on all this potential profit. What if there was a way to know exactly where to set you stop loss? To have an indicator tell you the exact position where to set it, so it lowers the chance immensely of it ever getting hit. Well lucky for you, there is a way. And I m going to tell you exactly how to execute it on all your trading strategies. Let s get straight to it. So here we have our rookie trader. They saw their indicators line up, so they entered a trade. They set their stop loss at the recent swing low. Thinking it was a good idea, because if the price does go below the swing low, they want to be out of the trade anyway. Then we have our professional trader. Who entered the trade the same price, but used the special strategy I m about to share with you to set their stop loss. Look what happened. The rookie trader ended up losing this trade, and the professional came out with a huge profit. Even though they entered at the exact same price. The only difference, is the position of their stop loss. So what is this mysterious indicator that will help you place your stop loss and lowering the chance of it getting stopped out? It is the ATR, or the average true range. I use this indicator in basically all of my trading strategies to help decide where to place my stop losses. We are going to talk about what the ATR is, why you should be using it, and how to implement it in your strategies so you set your stop losses at the correct position every time. So what is the ATR? The ATR is the average true range. What this indicator is doing, is taking the past 14 candles, and is telling us what the average size of those 14 candles is. Now whenever you add this indicator to your chart, you can change the settings of it to whatever you want. So you can make it look at the past 50 candles, or 5 candles, whatever number you wanted. Me personally, I like keeping it at the default of 14. So this indicator on the bottom is the ATR indicator. It s just a simple line chart, that has a changing value in the top left. This number is presenting the average size of the past 14 candles of this specific security, which is Etherium. So it s saying, the average candle size of the past 14 candles for Ethereum is $17.32 Now, why is it important to know the average candle size of the past 14 candles? The simple answer is knowing the recent volatility of the market. Let me show you an example. So say just for simplicity sake, you wanted to enter right here. You want to set your stop loss right below this recent swing low, which is actually what a lot of other traders are doing. And lets say, you think, to prevent the price from hitting your stop loss, you are going to move your stop loss down $10 from the original, so if the price does go down to the recent swing low. It still has a chance to bounce off, and go back up. While you re strategy is some what in the right direction. Let me tell you why this will not work. Every crypto, every stock, every currency, is going to have different amounts of volatility. So bitcoin is going to move up and down a lot more than a blue chip stock, like apple. You don t want to be moving your stop loss down the same amount for crypto as you would a blue chip stock. Considering they are two completely different markets, and have way different price movements. Depending on what your trading. Your stop loss might have to be larger or smaller. Same goes with different time frames. Here you can see the average candle size of the past 14 candles for bitcoin on the 15 minute time frame is $200, but if we move to the daily time frame. The average candle size is $3000. So this is a perfect example of why you need larger stop losses on higher time frames compared to smaller time frames. You also want your stop losses to be as effective as possible. Like this. So lets say, we know there is a great probability that the price will fall a lot if it goes below this line. But, we also know that we have to take volatility into consideration. But we will say the price can go below this line the amount of an average candle from the past 14 candles. But we don t want to just guess the average size, because if we do any more than what the actual size is, that s just wasting extra money. We want our stop loss to be as precise as possible. This is where, ATR comes into play. First things first, get on your chart platform, I use tradingview, I ll leave a link in the description. Go to the indicators tab, and type in ATR, for average true range. This will put the atr on the bottom of your screen. Now it s also important to note, this value in the top left will change based on where your cursor is. So if you have your cursor in the middle of the chart, it s taking the past 14 candles to the left of that line. So when reading the ATR, make sure your cursor is all the way to the right of price, or off the chart completely So in this example, this number, is the average candle size from the last 14 candles for etherium. So once you find where you want to place your stop place, say this recent swing low for example. Instead of dropping your stop loss a random amount below that level, you should be taking volatility into consideration. So what you do, is take the price of the stock, crypto, or whatever your trading. And subtract it with the ATR value. So in this example our stop loss level is at 4339 and our atr value is 16.02. So what you do is take 4339 and subtract 16.02 from it. Giving us 4,322.98. This is the new level of where we are going to be setting our stop loss So in this example . So yes, we do have a larger stop loss, but that s the whole point. We don t want to get stopped out because the market is more volatile than we thought. Let s do one more example. So here we set our stop loss at the most recent swing low, which is at 310 . We then see what the ATR value is, which is 2.58. We then do 310.75 2.58 which equals 308.17. 308.17 is where we move our top loss too. If you use this strategy for placing your stop losses. It s pretty safe to say your stop losses wont be hit as often. So for all my strategies, where I say to set your stop loss at a certain point. You should be adding the ATR to it, to give it that extra amount of room for volatility. It will help the strategy perform so much better. Try it with this strategy. Where I made a 130% return in just 2 months of trading. It s a crazy strategy and is insanely powerful. Thanks for watching, and ill see you guys next time.","id":"txXUUeMDos8","microformat":{"playerMicroformatRenderer":{"category":"Education","description":{"simpleText":"Want to know how and where to set your stop loss? This video will explain exactly how to get the most out of your stop losses, so you can place them as effectively as possible. Enjoy!\n\nIf you learned something new, leave a like.\n\nâ–º TradingView (Chart Software I Use): https://www.tradingview.com/?offer_id=10&aff_id=28566\n\nâ–º Get 2 FREE stocks valued up to $1850 (when you deposit $100): https://act.webull.com/on/A6BoDyk5xy2A/zbk/inviteUs/main\n\nâ–º Get up to $250 in Crypto Currency: https://blockfi.com/?ref=ca9f3260\n\nðŸ”´ Subscribe for more videos just like this: https://www.youtube.com/channel/UCCbv0qixG-cyokxEY3kELtg?sub_confirmation=1\n\nFollow TradingLab: \n===============================\nðŸ“¸ - IG: https://www.instagram.com/tradinglabofficial/\n\nâ±ï¸ Timestamps\n00:00 - Start\n00:49 - Rookie Trader vs Professional Trader\n01:23 - What is ATR?\n02:03 - How to Use The ATR\n03:20 - Why You Should Be Using ATR\n04:44 - Stop Loss Example\n\n\n*None of this is meant to be construed as investment advice, it's for entertainment purposes only. The links above include affiliate commissions or referrals. I'm part of an affiliate network and I receive compensation from partnering websites. The video is accurate as of the posting date but may not be accurate in the future."},"externalChannelId":"UCCbv0qixG-cyokxEY3kELtg","lengthSeconds":"445","ownerChannelName":"TradingLab","publishDate":"2021-11-23","title":{"simpleText":"How To Know Where to Set Your Stop Loss"}}},"isLive":false,"isLoginRequired":false,"languages":[{"label":"en","languageCode":"en"}],"playabilityStatus":{"status":"OK","reason":""},"title":"How To Know Where to Set Your Stop Loss","tracks":[{"language":"en","transcript":[{"start":"0.179","dur":"4.881","text":"Has this ever happened to you? Your trading\nstrategy gives you all the signals to enter"},{"start":"5.06","dur":"5.39","text":"a trade, so you enter. The chart is looking\nextremely nice, and you re confident the price"},{"start":"10.45","dur":"4.96","text":"is about to go up. You set your stop loss,\nset your take profit, and then have you eyes"},{"start":"15.41","dur":"3.18","text":"glued to the monitor.\nIt turns out you were right about the chart"},{"start":"18.59","dur":"5.75","text":"going up, but unfortunately, the price barely\nhit your stop loss before doing so. Resulting"},{"start":"24.34","dur":"5.77","text":"this as a losing trade, and most importantly,\nmissing out on all this potential profit."},{"start":"30.11","dur":"4.73","text":"What if there was a way to know exactly where\nto set you stop loss? To have an indicator"},{"start":"34.84","dur":"5.3","text":"tell you the exact position where to set it,\nso it lowers the chance immensely of it ever"},{"start":"40.14","dur":"3.37","text":"getting hit.\nWell lucky for you, there is a way. And I"},{"start":"43.51","dur":"4.16","text":"m going to tell you exactly how to execute\nit on all your trading strategies."},{"start":"47.67","dur":"3.34","text":"Let s get straight to it.\nSo here we have our rookie trader. They saw"},{"start":"51.01","dur":"5.099","text":"their indicators line up, so they entered\na trade. They set their stop loss at the recent"},{"start":"56.11","dur":"4.81","text":"swing low. Thinking it was a good idea, because\nif the price does go below the swing low,"},{"start":"60.92","dur":"3.94","text":"they want to be out of the trade anyway.\nThen we have our professional trader. Who"},{"start":"64.86","dur":"4.92","text":"entered the trade the same price, but used\nthe special strategy I m about to share with"},{"start":"69.78","dur":"2.81","text":"you to set their stop loss.\nLook what happened."},{"start":"72.59","dur":"4.36","text":"The rookie trader ended up losing this trade,\nand the professional came out with a huge"},{"start":"76.95","dur":"5.44","text":"profit. Even though they entered at the exact\nsame price. The only difference, is the position"},{"start":"82.39","dur":"3.6","text":"of their stop loss.\nSo what is this mysterious indicator that"},{"start":"85.99","dur":"4.53","text":"will help you place your stop loss and lowering\nthe chance of it getting stopped out?"},{"start":"90.52","dur":"6.238","text":"It is the ATR, or the average true range.\nI use this indicator in basically all of my"},{"start":"96.759","dur":"3.561","text":"trading strategies to help decide where to\nplace my stop losses."},{"start":"100.32","dur":"4.83","text":"We are going to talk about what the ATR is,\nwhy you should be using it, and how to implement"},{"start":"105.15","dur":"5.62","text":"it in your strategies so you set your stop\nlosses at the correct position every time."},{"start":"110.77","dur":"5.84","text":"So what is the ATR? The ATR is the average\ntrue range. What this indicator is doing,"},{"start":"116.61","dur":"5.75","text":"is taking the past 14 candles, and is telling\nus what the average size of those 14 candles"},{"start":"122.36","dur":"2.82","text":"is.\nNow whenever you add this indicator to your"},{"start":"125.18","dur":"4.309","text":"chart, you can change the settings of it to\nwhatever you want. So you can make it look"},{"start":"129.489","dur":"4.021","text":"at the past 50 candles, or 5 candles, whatever\nnumber you wanted."},{"start":"133.51","dur":"4.11","text":"Me personally, I like keeping it at the default\nof 14."},{"start":"137.62","dur":"4.97","text":"So this indicator on the bottom is the ATR\nindicator. It s just a simple line chart,"},{"start":"142.59","dur":"4.968","text":"that has a changing value in the top left.\nThis number is presenting the average size"},{"start":"147.559","dur":"3.671","text":"of the past 14 candles of this specific security,\nwhich is Etherium."},{"start":"151.23","dur":"8.149","text":"So it s saying, the average candle size of\nthe past 14 candles for Ethereum is $17.32"},{"start":"159.379","dur":"5.521","text":"Now, why is it important to know the average\ncandle size of the past 14 candles?"},{"start":"164.9","dur":"3.979","text":"The simple answer is knowing the recent volatility\nof the market."},{"start":"168.879","dur":"3.5","text":"Let me show you an example.\nSo say just for simplicity sake, you wanted"},{"start":"172.379","dur":"5.03","text":"to enter right here. You want to set your\nstop loss right below this recent swing low,"},{"start":"177.409","dur":"2.94","text":"which is actually what a lot of other traders\nare doing."},{"start":"180.349","dur":"4.37","text":"And lets say, you think, to prevent the price\nfrom hitting your stop loss, you are going"},{"start":"184.719","dur":"5.58","text":"to move your stop loss down $10 from the original,\nso if the price does go down to the recent"},{"start":"190.299","dur":"3.901","text":"swing low. It still has a chance to bounce\noff, and go back up."},{"start":"194.2","dur":"4.05","text":"While you re strategy is some what in the\nright direction. Let me tell you why this"},{"start":"198.25","dur":"4.15","text":"will not work.\nEvery crypto, every stock, every currency,"},{"start":"202.4","dur":"4.839","text":"is going to have different amounts of volatility.\nSo bitcoin is going to move up and down a"},{"start":"207.239","dur":"4.83","text":"lot more than a blue chip stock, like apple.\nYou don t want to be moving your stop loss"},{"start":"212.07","dur":"4.789","text":"down the same amount for crypto as you would\na blue chip stock. Considering they are two"},{"start":"216.859","dur":"4","text":"completely different markets, and have way\ndifferent price movements."},{"start":"220.859","dur":"4.66","text":"Depending on what your trading. Your stop\nloss might have to be larger or smaller."},{"start":"225.519","dur":"4","text":"Same goes with different time frames. Here\nyou can see the average candle size of the"},{"start":"229.519","dur":"6.271","text":"past 14 candles for bitcoin on the 15 minute\ntime frame is $200, but if we move to the"},{"start":"235.79","dur":"4.298","text":"daily time frame. The average candle size\nis $3000."},{"start":"240.089","dur":"5.63","text":"So this is a perfect example of why you need\nlarger stop losses on higher time frames compared"},{"start":"245.719","dur":"4.13","text":"to smaller time frames.\nYou also want your stop losses to be as effective"},{"start":"249.849","dur":"4.911","text":"as possible. Like this. So lets say, we know\nthere is a great probability that the price"},{"start":"254.76","dur":"6.8","text":"will fall a lot if it goes below this line.\nBut, we also know that we have to take volatility"},{"start":"261.56","dur":"4","text":"into consideration.\nBut we will say the price can go below this"},{"start":"265.56","dur":"5.389","text":"line the amount of an average candle from\nthe past 14 candles. But we don t want to"},{"start":"270.949","dur":"5.151","text":"just guess the average size, because if we\ndo any more than what the actual size is,"},{"start":"276.1","dur":"5.3","text":"that s just wasting extra money. We want our\nstop loss to be as precise as possible."},{"start":"281.4","dur":"4.669","text":"This is where, ATR comes into play.\nFirst things first, get on your chart platform,"},{"start":"286.069","dur":"2.651","text":"I use tradingview, I ll leave a link in the\ndescription."},{"start":"288.72","dur":"5.509","text":"Go to the indicators tab, and type in ATR,\nfor average true range. This will put the"},{"start":"294.229","dur":"5.111","text":"atr on the bottom of your screen.\nNow it s also important to note, this value"},{"start":"299.34","dur":"4.69","text":"in the top left will change based on where\nyour cursor is. So if you have your cursor"},{"start":"304.03","dur":"5.06","text":"in the middle of the chart, it s taking the\npast 14 candles to the left of that line."},{"start":"309.09","dur":"5.41","text":"So when reading the ATR, make sure your cursor\nis all the way to the right of price, or off"},{"start":"314.5","dur":"3.979","text":"the chart completely\nSo in this example, this number, is the average"},{"start":"318.479","dur":"5.99","text":"candle size from the last 14 candles for etherium.\nSo once you find where you want to place your"},{"start":"324.469","dur":"4.902","text":"stop place, say this recent swing low for\nexample. Instead of dropping your stop loss"},{"start":"329.371","dur":"4.999","text":"a random amount below that level, you should\nbe taking volatility into consideration."},{"start":"334.37","dur":"5.049","text":"So what you do, is take the price of the stock,\ncrypto, or whatever your trading. And subtract"},{"start":"339.419","dur":"4.641","text":"it with the ATR value.\nSo in this example our stop loss level is"},{"start":"344.06","dur":"13.109","text":"at 4339 and our atr value is 16.02. So what\nyou do is take 4339 and subtract 16.02 from"},{"start":"357.169","dur":"8.151","text":"it. Giving us 4,322.98. This is the new level\nof where we are going to be setting our stop"},{"start":"365.32","dur":"5.069","text":"loss\nSo in this example ."},{"start":"370.389","dur":"4.691","text":"So yes, we do have a larger stop loss, but\nthat s the whole point. We don t want to get"},{"start":"375.08","dur":"3.209","text":"stopped out because the market is more volatile\nthan we thought."},{"start":"378.289","dur":"5.291","text":"Let s do one more example. So here we set\nour stop loss at the most recent swing low,"},{"start":"383.58","dur":"10.049","text":"which is at 310 . We then see what the ATR\nvalue is, which is 2.58. We then do 310.75"},{"start":"393.629","dur":"8.87","text":"2.58 which equals 308.17. 308.17 is where\nwe move our top loss too."},{"start":"402.499","dur":"4.76","text":"If you use this strategy for placing your\nstop losses. It s pretty safe to say your"},{"start":"407.259","dur":"6.63","text":"stop losses wont be hit as often.\nSo for all my strategies, where I say to set"},{"start":"413.889","dur":"5.21","text":"your stop loss at a certain point. You should\nbe adding the ATR to it, to give it that extra"},{"start":"419.099","dur":"4.731","text":"amount of room for volatility.\nIt will help the strategy perform so much"},{"start":"423.83","dur":"2.549","text":"better.\nTry it with this strategy. Where I made a"},{"start":"426.379","dur":"7.151","text":"130% return in just 2 months of trading. It\ns a crazy strategy and is insanely powerful."},{"start":"433.53","dur":"8.08","text":"Thanks for watching, and ill see you guys\nnext time."}]}]},{"text":"here's a recent trade i just finished a huge 10 gain and massive profit helping out my portfolio so much how did i know this chart was about to go up because of this candlestick pattern right here and in this video i'm gonna share my favorite candlestick patterns just like this one that i use on a daily basis that way you can read and understand chart patterns predict chart direction become a more successful trader and make plays just like this one let's get straight to it shall we one of my favorite and most used candlestick patterns i like to trade with is the engulfing candle i've used it in many of my previous videos it's such a strong candlestick because it can give you the exact point of when a reversal is about to happen what is an engulfing candlestick well it basically explains itself in the name it's a candlestick in the opposite color of the previous candle and it simply engulfs it a bullish engulfing candle opens at or is lower than the previous candles close and closes above the previous candles open so basically being bigger than the previous candle on both sides making it look as if it's engulfing it let me show you an example so here we found a pretty strong support where price bounced off it multiple times telling us it really respects it we see the price comes back down to the support we can expect it to bounce back up but before entering we need a little more confirmation rather than just assuming the support will hold that's when we see a bullish engulfing candle it completely engulfs the previous red candle and is exactly at the support this is an extremely bullish sign and we can be pretty confident the price will go up from here so we enter the trade and look what happens now it's also important to note that just because there is a bullish or bearish engulfing candle doesn't mean the price is going to reverse in that direction every time you shouldn't be just trading purely off candlestick patterns you should be using them as almost if they were hints on which way the market is about to go not pure decision makers you should be using other tools with candlestick patterns like support and resistances indicators different strategies etc so just to be clear just because you see a bullish engulfing candle doesn't mean the price will go up from there but it can be a good indicator that the price will head in that direction let me show you a bearish example so here we have the same type of setup a strong resistance where the price respected it multiple times before and we see the price comes back up and starts to slow down giving us a bearish engulfing candle completely engulfing the previous green candle we see that it got rejected at the resistance and there was a bearish engulfing candle indicating this is a good sign to go short and look what happens price goes down next we have the momentum candle the momentum candle is a lot easier to spot than the engulfing candle purely because of its size a momentum candle is simply a candle that is two to three times bigger than the previous candles before it this candle can be insanely powerful because most of the time after it happens the price will continue to go in that direction making this point a great time to enter the most efficient and effective way to use this candlestick pattern is in choppy markets where the price is moving sideways if you ever see a sideways market then a huge momentum candlestick appears being two to three times bigger than the previous candles you can be pretty certain that the price will continue in that direction why is that well think of it like this whenever there is a sideways market like this there are a lot of shorters stuck in their trades they don't want to exit their trade yet because the price is moving sideways and it can honestly still move in either direction they draw their support and resistance and set their stop losses right above the support so that means they're going to be tons of traders setting stop losses all over this area meaning if there's a sudden price movement and price hits this liquidation zone all these stop losses will be hit just adding fuel to the fire for this price to keep moving up also when price breaks a choppy market like this it'll usually start a trend in that direction it's the same type of strategy with shorts if there's a choppy sideways market and you see a huge red candle two to three times bigger than the candles before it this is a great indicator to enter a short position because it's likely the price will continue to move downwards next we have the multiple candlestick pattern this is one of my favorites as it usually holds pretty true on charts and it's also pretty simple all it is is when you have three or more candles that have wicks going one direction the more candles the better i like to pair this candlestick pattern with support and resistances so look at this chart what do you see happening well for one we have a key support where price bounces off multiple times then we have multiple candles with wicks going downwards exactly at the support as you can see all these candles have downward wicks telling us that sellers are trying to break the support but buyers keep fighting them off and are winning multiple times confirming that this is a key support and price has a good chance of bouncing upwards as said before the more candles the better the probability the price will respect that pattern let's go over a short example price moved to the resistance there are multiple candles with wicks heading upwards telling us that price really doesn't want to move up from here giving us a good short entry so we enter here expecting price to reverse from this point and look what happens it does next we have the doji candle the doji candle is a candlestick with a very thin body and it has wicks on each side why this one is so important to understand is because it can be a great indicator on when the price is about to reverse in a direction what this candle basically represents is the market is uncertain on which way it wants to go and is having resistance whenever there is uncertainty or resistance the price will more often than not head in the opposite direction let's see an example so here we have price moving down pretty hard then a green candle appears and it just so happens to be a doji candle this is telling us that sellers are starting to be less confident and buyers are starting to enter making this point a great potential place to enter what i normally like to do with doji candles is after i see one i'll wait for two or more candles the same color to confirm that the price will reverse so in this example i see a green doji candle i wait see two more green candles heading upwards telling me i can be confident that the price will continue in that direction so this is the point where i enter the trade and boom the price goes up from here there are multiple different variations of the doji candle that you might see there is the regular one which is the one that we just talked about in the last example the long-legged doji candle which is basically the same candle but just has larger wicks the dragonfly which has a small body and a big bottom wick then the gravestone which has a small body and has a big upper wick all of these tell the same exact story a reversal in price the next candlestick we'll be looking at is the hammer the hammer is usually a candle that looks like this a decent sized body and a long wick what this candle is telling us is that sellers got the price all the way down to here but the buyers absorbed all that selling pressure and raised the price all the way back up this is usually an extremely bullish sign and can tell us that the market will continue to go in that direction a candlestick that is very similar to the hammer is the shooting star the shooting star is just like the hammer but it has a small wake on the opposite side you should be playing this just like the hammer where if you see a shooting star candle like this you can have a good suspicion that the price will start reversing this next candlestick pattern is called the tweezer this pattern is a red candlestick followed by a green candlestick both having similar wicks on the bottom if you see this pair you can have a pretty good idea this chart is about to move upwards let's see an example so here we can see price is about to hit this support we see a red candle with a wick on the bottom right at the support then we see a green candle that also has a wick heading downwards this is telling us that the price is respecting this support and is now getting some momentum upwards this would be a great time to buy and look what happens price raises it's the exact opposite for a bearish signal so you want to see a green candlestick then a red both having wicks at the top we see that exact pattern here and boom price falls the last and final candlestick pattern i want to talk about is the marabozu the bullish maribozu is going to be a big green candle without any wicks so basically just a big green rectangle the cool thing about this pattern is that it's a good indicator that price will keep heading in the same direction it's going you will usually see this candle in the middle of a trend confirming that the trend will keep moving upwards let's see an example so here we saw a price reversal price is starting to head upwards then we see a bullish maribozu candle notice how the candle has no upper or lower wicks this means that the lowest price of this candle was the exact same as its opening price and the highest point of this candle is the exact same as its closing price this is telling us that buyers have complete control and we can almost certainly predict that price will continue to go upwards and look what happens it does the bearish maribozu is the same idea a red candle with no winks here we see the price had a reversal we see a bearish maribozu candle telling us sellers have control and the price will probably keep moving downwards we enter making this a winning trade now it's time to give you a bonus tip for all those who made it to the end of the video this is a way of me saying thanks for watching all the way to the end even though you should probably try to memorize these patterns so when you see them you can have an idea of what the market is going to do in the back of your head i completely understand that it's hard sometimes to look for them or even remember what they look like well lucky for you there is a way to make it so you can have your chart tell you exactly where a certain type of candlestick pattern occurs which makes it really easy for you to spot them and you don't even necessarily have to memorize them to do this just go to trading view click the indicators tab type in whatever candlestick pattern you want so for this example we'll do a bullish engulfing simply click it and training view will notify you on the chart when the bullish engulfing candle appears making it extremely easy to spot when it happens and you don't even have to look that hard you can also add multiple candlestick patterns to your chart so you can identify when any of them occur i hope you guys got some value out of this and you learned something new if you did i would really appreciate it if you took five seconds out of your day and like this video the one and only problem trading with candlestick patterns is false breakouts where a certain candlestick pattern occurs but the price actually does the exact opposite of what the pattern predicts if you want to learn how to avoid situations like this watch this video where i go over my secret strategy to avoid false breakouts thanks for watching and i'll see you guys next time you","id":"tW13N4Hll88","title":"The ONLY Candlestick Pattern Guide You'll EVER NEED","microformat":{"playerMicroformatRenderer":{"thumbnail":{"thumbnails":[{"url":"https://i.ytimg.com/vi/tW13N4Hll88/maxresdefault.jpg","width":1280,"height":720}]},"embed":{"iframeUrl":"https://www.youtube.com/embed/tW13N4Hll88","width":1280,"height":720},"title":{"simpleText":"The ONLY Candlestick Pattern Guide You'll EVER NEED"},"description":{"simpleText":"Learning candlestick patterns can be absolutely crucial in the success of your trading. In this video, I show you multiple different candlestick patterns, so you can use them to help predict which direction the chart will go. Enjoy!\n\nðŸ”¥ My private Indicator: https://tradinglab.ai/ \n\nðŸ“ˆ See all of my trades live (Entries/Exits): https://tradinglab.ai/premium/\n\nðŸ’µ HankoTrade (Where I Trade Forex): https://login.hankotrade.com/register?franchiseLead=MjQxNg==\n\nðŸš€ Webull (Where I Trade Stocks): https://a.webull.com/i/TradingLab\n\nðŸ’¬ My Trading Discord: https://discord.gg/nHqDYZuuK2\n\nâš¡ Bybit (Where I Buy Crypto) Up To $30,000 in Rewards: https://partner.bybit.com/b/TradingLab\n\nðŸ“Š TradingView (Chart Software I Use): https://www.tradingview.com/?offer_id=10&aff_id=28566\n\nðŸ“° Benzinga (News Scanner I Use): https://benzinga.grsm.io/TradingLab\n\nðŸ”´ Subscribe for more videos just like this: https://www.youtube.com/channel/UCCbv0qixG-cyokxEY3kELtg?sub_confirmation=1\n\nFollow TradingLab: \n===============================\nðŸ“¸ - IG: https://www.instagram.com/tradinglabofficial/?hl=en\nðŸ“± - TikTok: https://www.tiktok.com/@thetradinglab\n\nâ±ï¸ Timestamps\n00:00 - The ONLY Candlestick Pattern Guide You'll EVER NEED\n00:33 - Engulfing Candlestick Pattern\n02:50 - Momentum Candlestick Pattern\n04:30 - Multiple Candlestick Pattern\n05:43 - Doji Candlestick Pattern\n07:17 - Hammer Candlestick Pattern\n07:41 - Shooting Star Candlestick Pattern\n07:59 - Tweezer Candlestick Pattern\n08:49 - Marubozu Candlestick Pattern\n10:00 - Bonus Tip\n\n*None of this is meant to be construed as investment advice, it's for entertainment purposes only. The links above include affiliate commissions or referrals. I'm part of an affiliate network and I receive compensation from partnering websites. The video is accurate as of the posting date but may not be accurate in the future."},"lengthSeconds":"705","ownerProfileUrl":"http://www.youtube.com/@TradingLabOfficial","externalChannelId":"UCCbv0qixG-cyokxEY3kELtg","isFamilySafe":true,"availableCountries":["AD","AE","AF","AG","AI","AL","AM","AO","AQ","AR","AS","AT","AU","AW","AX","AZ","BA","BB","BD","BE","BF","BG","BH","BI","BJ","BL","BM","BN","BO","BQ","BR","BS","BT","BV","BW","BY","BZ","CA","CC","CD","CF","CG","CH","CI","CK","CL","CM","CN","CO","CR","CU","CV","CW","CX","CY","CZ","DE","DJ","DK","DM","DO","DZ","EC","EE","EG","EH","ER","ES","ET","FI","FJ","FK","FM","FO","FR","GA","GB","GD","GE","GF","GG","GH","GI","GL","GM","GN","GP","GQ","GR","GS","GT","GU","GW","GY","HK","HM","HN","HR","HT","HU","ID","IE","IL","IM","IN","IO","IQ","IR","IS","IT","JE","JM","JO","JP","KE","KG","KH","KI","KM","KN","KP","KR","KW","KY","KZ","LA","LB","LC","LI","LK","LR","LS","LT","LU","LV","LY","MA","MC","MD","ME","MF","MG","MH","MK","ML","MM","MN","MO","MP","MQ","MR","MS","MT","MU","MV","MW","MX","MY","MZ","NA","NC","NE","NF","NG","NI","NL","NO","NP","NR","NU","NZ","OM","PA","PE","PF","PG","PH","PK","PL","PM","PN","PR","PS","PT","PW","PY","QA","RE","RO","RS","RU","RW","SA","SB","SC","SD","SE","SG","SH","SI","SJ","SK","SL","SM","SN","SO","SR","SS","ST","SV","SX","SY","SZ","TC","TD","TF","TG","TH","TJ","TK","TL","TM","TN","TO","TR","TT","TV","TW","TZ","UA","UG","UM","US","UY","UZ","VA","VC","VE","VG","VI","VN","VU","WF","WS","YE","YT","ZA","ZM","ZW"],"isUnlisted":false,"hasYpcMetadata":false,"viewCount":"4405813","category":"Education","publishDate":"2021-12-10T09:27:19-08:00","ownerChannelName":"TradingLab","uploadDate":"2021-12-10T09:27:19-08:00","isShortsEligible":false,"externalVideoId":"tW13N4Hll88","likeCount":"237592"}},"tracks":[{"language":"English (auto-generated)","transcript":[{"text":"here's a recent trade i just finished a","start":"0.08","dur":"5.44"},{"text":"huge 10 gain and massive profit helping","start":"2.24","dur":"6.64"},{"text":"out my portfolio so much how did i know","start":"5.52","dur":"5.36"},{"text":"this chart was about to go up because of","start":"8.88","dur":"4.56"},{"text":"this candlestick pattern right here and","start":"10.88","dur":"4.32"},{"text":"in this video i'm gonna share my","start":"13.44","dur":"3.759"},{"text":"favorite candlestick patterns just like","start":"15.2","dur":"5.12"},{"text":"this one that i use on a daily basis","start":"17.199","dur":"5.201"},{"text":"that way you can read and understand","start":"20.32","dur":"4.48"},{"text":"chart patterns predict chart direction","start":"22.4","dur":"4.959"},{"text":"become a more successful trader and make","start":"24.8","dur":"4.799"},{"text":"plays just like this one let's get","start":"27.359","dur":"3.711"},{"text":"straight to it shall we","start":"29.599","dur":"4.001"},{"text":"one of my favorite and most used","start":"33.6","dur":"3.92"},{"text":"candlestick patterns i like to trade","start":"35.6","dur":"4.32"},{"text":"with is the engulfing candle i've used","start":"37.52","dur":"4.4"},{"text":"it in many of my previous videos it's","start":"39.92","dur":"4.08"},{"text":"such a strong candlestick because it can","start":"41.92","dur":"4.319"},{"text":"give you the exact point of when a","start":"44","dur":"5.039"},{"text":"reversal is about to happen what is an","start":"46.239","dur":"4.96"},{"text":"engulfing candlestick well it basically","start":"49.039","dur":"4.081"},{"text":"explains itself in the name it's a","start":"51.199","dur":"4.321"},{"text":"candlestick in the opposite color of the","start":"53.12","dur":"5.119"},{"text":"previous candle and it simply engulfs it","start":"55.52","dur":"5.519"},{"text":"a bullish engulfing candle opens at or","start":"58.239","dur":"5.361"},{"text":"is lower than the previous candles close","start":"61.039","dur":"5.201"},{"text":"and closes above the previous candles","start":"63.6","dur":"5.199"},{"text":"open so basically being bigger than the","start":"66.24","dur":"5.12"},{"text":"previous candle on both sides making it","start":"68.799","dur":"4.401"},{"text":"look as if it's engulfing it let me show","start":"71.36","dur":"4.079"},{"text":"you an example so here we found a pretty","start":"73.2","dur":"4.32"},{"text":"strong support where price bounced off","start":"75.439","dur":"4.561"},{"text":"it multiple times telling us it really","start":"77.52","dur":"4.56"},{"text":"respects it we see the price comes back","start":"80","dur":"4"},{"text":"down to the support we can expect it to","start":"82.08","dur":"4.16"},{"text":"bounce back up but before entering we","start":"84","dur":"4.56"},{"text":"need a little more confirmation rather","start":"86.24","dur":"4.48"},{"text":"than just assuming the support will hold","start":"88.56","dur":"4.48"},{"text":"that's when we see a bullish engulfing","start":"90.72","dur":"4.399"},{"text":"candle it completely engulfs the","start":"93.04","dur":"4.8"},{"text":"previous red candle and is exactly at","start":"95.119","dur":"5.521"},{"text":"the support this is an extremely bullish","start":"97.84","dur":"5.36"},{"text":"sign and we can be pretty confident the","start":"100.64","dur":"5.04"},{"text":"price will go up from here so we enter","start":"103.2","dur":"4.879"},{"text":"the trade and look what happens now it's","start":"105.68","dur":"4.56"},{"text":"also important to note that just because","start":"108.079","dur":"4.241"},{"text":"there is a bullish or bearish engulfing","start":"110.24","dur":"4.08"},{"text":"candle doesn't mean the price is going","start":"112.32","dur":"4.56"},{"text":"to reverse in that direction every time","start":"114.32","dur":"4.72"},{"text":"you shouldn't be just trading purely off","start":"116.88","dur":"4.16"},{"text":"candlestick patterns you should be using","start":"119.04","dur":"4.399"},{"text":"them as almost if they were hints on","start":"121.04","dur":"4.56"},{"text":"which way the market is about to go not","start":"123.439","dur":"4.401"},{"text":"pure decision makers you should be using","start":"125.6","dur":"4.48"},{"text":"other tools with candlestick patterns","start":"127.84","dur":"5.039"},{"text":"like support and resistances indicators","start":"130.08","dur":"5.44"},{"text":"different strategies etc so just to be","start":"132.879","dur":"4.401"},{"text":"clear just because you see a bullish","start":"135.52","dur":"3.68"},{"text":"engulfing candle doesn't mean the price","start":"137.28","dur":"4.08"},{"text":"will go up from there but it can be a","start":"139.2","dur":"4.32"},{"text":"good indicator that the price will head","start":"141.36","dur":"4.08"},{"text":"in that direction let me show you a","start":"143.52","dur":"4.079"},{"text":"bearish example so here we have the same","start":"145.44","dur":"4.32"},{"text":"type of setup a strong resistance where","start":"147.599","dur":"4.081"},{"text":"the price respected it multiple times","start":"149.76","dur":"3.92"},{"text":"before and we see the price comes back","start":"151.68","dur":"4.24"},{"text":"up and starts to slow down giving us a","start":"153.68","dur":"4.639"},{"text":"bearish engulfing candle completely","start":"155.92","dur":"4.88"},{"text":"engulfing the previous green candle we","start":"158.319","dur":"4.161"},{"text":"see that it got rejected at the","start":"160.8","dur":"3.36"},{"text":"resistance and there was a bearish","start":"162.48","dur":"4.08"},{"text":"engulfing candle indicating this is a","start":"164.16","dur":"4.32"},{"text":"good sign to go short and look what","start":"166.56","dur":"4.64"},{"text":"happens price goes down next we have the","start":"168.48","dur":"5.44"},{"text":"momentum candle the momentum candle is a","start":"171.2","dur":"4.8"},{"text":"lot easier to spot than the engulfing","start":"173.92","dur":"4.64"},{"text":"candle purely because of its size a","start":"176","dur":"5.04"},{"text":"momentum candle is simply a candle that","start":"178.56","dur":"4.48"},{"text":"is two to three times bigger than the","start":"181.04","dur":"4.4"},{"text":"previous candles before it this candle","start":"183.04","dur":"5.119"},{"text":"can be insanely powerful because most of","start":"185.44","dur":"5.04"},{"text":"the time after it happens the price will","start":"188.159","dur":"4.881"},{"text":"continue to go in that direction making","start":"190.48","dur":"5.039"},{"text":"this point a great time to enter the","start":"193.04","dur":"4.88"},{"text":"most efficient and effective way to use","start":"195.519","dur":"4.8"},{"text":"this candlestick pattern is in choppy","start":"197.92","dur":"4.239"},{"text":"markets where the price is moving","start":"200.319","dur":"3.92"},{"text":"sideways if you ever see a sideways","start":"202.159","dur":"4.561"},{"text":"market then a huge momentum candlestick","start":"204.239","dur":"4.64"},{"text":"appears being two to three times bigger","start":"206.72","dur":"4"},{"text":"than the previous candles you can be","start":"208.879","dur":"3.44"},{"text":"pretty certain that the price will","start":"210.72","dur":"4"},{"text":"continue in that direction why is that","start":"212.319","dur":"4.321"},{"text":"well think of it like this whenever","start":"214.72","dur":"4.32"},{"text":"there is a sideways market like this","start":"216.64","dur":"4.239"},{"text":"there are a lot of shorters stuck in","start":"219.04","dur":"3.839"},{"text":"their trades they don't want to exit","start":"220.879","dur":"3.92"},{"text":"their trade yet because the price is","start":"222.879","dur":"4.241"},{"text":"moving sideways and it can honestly","start":"224.799","dur":"4.321"},{"text":"still move in either direction they draw","start":"227.12","dur":"4.32"},{"text":"their support and resistance and set","start":"229.12","dur":"4.16"},{"text":"their stop losses right above the","start":"231.44","dur":"3.84"},{"text":"support so that means they're going to","start":"233.28","dur":"4.879"},{"text":"be tons of traders setting stop losses","start":"235.28","dur":"5.84"},{"text":"all over this area meaning if there's a","start":"238.159","dur":"4.961"},{"text":"sudden price movement and price hits","start":"241.12","dur":"4.16"},{"text":"this liquidation zone all these stop","start":"243.12","dur":"4.64"},{"text":"losses will be hit just adding fuel to","start":"245.28","dur":"4.72"},{"text":"the fire for this price to keep moving","start":"247.76","dur":"4.559"},{"text":"up also when price breaks a choppy","start":"250","dur":"4.4"},{"text":"market like this it'll usually start a","start":"252.319","dur":"4.241"},{"text":"trend in that direction it's the same","start":"254.4","dur":"4.16"},{"text":"type of strategy with shorts if there's","start":"256.56","dur":"3.84"},{"text":"a choppy sideways market and you see a","start":"258.56","dur":"3.84"},{"text":"huge red candle two to three times","start":"260.4","dur":"3.84"},{"text":"bigger than the candles before it this","start":"262.4","dur":"3.92"},{"text":"is a great indicator to enter a short","start":"264.24","dur":"4.399"},{"text":"position because it's likely the price","start":"266.32","dur":"4.8"},{"text":"will continue to move downwards next we","start":"268.639","dur":"4.881"},{"text":"have the multiple candlestick pattern","start":"271.12","dur":"4.24"},{"text":"this is one of my favorites as it","start":"273.52","dur":"4.8"},{"text":"usually holds pretty true on charts and","start":"275.36","dur":"5.36"},{"text":"it's also pretty simple all it is is","start":"278.32","dur":"4.64"},{"text":"when you have three or more candles that","start":"280.72","dur":"4.72"},{"text":"have wicks going one direction the more","start":"282.96","dur":"4.56"},{"text":"candles the better i like to pair this","start":"285.44","dur":"4.16"},{"text":"candlestick pattern with support and","start":"287.52","dur":"4.56"},{"text":"resistances so look at this chart what","start":"289.6","dur":"4.56"},{"text":"do you see happening well for one we","start":"292.08","dur":"4.24"},{"text":"have a key support where price bounces","start":"294.16","dur":"5.12"},{"text":"off multiple times then we have multiple","start":"296.32","dur":"5.52"},{"text":"candles with wicks going downwards","start":"299.28","dur":"5.28"},{"text":"exactly at the support as you can see","start":"301.84","dur":"5.199"},{"text":"all these candles have downward wicks","start":"304.56","dur":"4.56"},{"text":"telling us that sellers are trying to","start":"307.039","dur":"4.241"},{"text":"break the support but buyers keep","start":"309.12","dur":"4.32"},{"text":"fighting them off and are winning","start":"311.28","dur":"4.88"},{"text":"multiple times confirming that this is a","start":"313.44","dur":"5.199"},{"text":"key support and price has a good chance","start":"316.16","dur":"5.039"},{"text":"of bouncing upwards as said before the","start":"318.639","dur":"4.881"},{"text":"more candles the better the probability","start":"321.199","dur":"4.321"},{"text":"the price will respect that pattern","start":"323.52","dur":"4.239"},{"text":"let's go over a short example price","start":"325.52","dur":"4.16"},{"text":"moved to the resistance there are","start":"327.759","dur":"3.761"},{"text":"multiple candles with wicks heading","start":"329.68","dur":"4.16"},{"text":"upwards telling us that price really","start":"331.52","dur":"4.56"},{"text":"doesn't want to move up from here giving","start":"333.84","dur":"4.96"},{"text":"us a good short entry so we enter here","start":"336.08","dur":"4.8"},{"text":"expecting price to reverse from this","start":"338.8","dur":"4.56"},{"text":"point and look what happens it does next","start":"340.88","dur":"4.96"},{"text":"we have the doji candle the doji candle","start":"343.36","dur":"4.88"},{"text":"is a candlestick with a very thin body","start":"345.84","dur":"5.28"},{"text":"and it has wicks on each side why this","start":"348.24","dur":"5.12"},{"text":"one is so important to understand is","start":"351.12","dur":"4.32"},{"text":"because it can be a great indicator on","start":"353.36","dur":"4.24"},{"text":"when the price is about to reverse in a","start":"355.44","dur":"4.319"},{"text":"direction what this candle basically","start":"357.6","dur":"5.12"},{"text":"represents is the market is uncertain on","start":"359.759","dur":"5.521"},{"text":"which way it wants to go and is having","start":"362.72","dur":"5.039"},{"text":"resistance whenever there is uncertainty","start":"365.28","dur":"4.8"},{"text":"or resistance the price will more often","start":"367.759","dur":"4.801"},{"text":"than not head in the opposite direction","start":"370.08","dur":"4.239"},{"text":"let's see an example so here we have","start":"372.56","dur":"4.16"},{"text":"price moving down pretty hard then a","start":"374.319","dur":"4.481"},{"text":"green candle appears and it just so","start":"376.72","dur":"4.16"},{"text":"happens to be a doji candle this is","start":"378.8","dur":"3.92"},{"text":"telling us that sellers are starting to","start":"380.88","dur":"3.92"},{"text":"be less confident and buyers are","start":"382.72","dur":"4.4"},{"text":"starting to enter making this point a","start":"384.8","dur":"4.56"},{"text":"great potential place to enter what i","start":"387.12","dur":"4.72"},{"text":"normally like to do with doji candles is","start":"389.36","dur":"4.72"},{"text":"after i see one i'll wait for two or","start":"391.84","dur":"4.88"},{"text":"more candles the same color to confirm","start":"394.08","dur":"4.8"},{"text":"that the price will reverse so in this","start":"396.72","dur":"5.36"},{"text":"example i see a green doji candle i wait","start":"398.88","dur":"5.039"},{"text":"see two more green candles heading","start":"402.08","dur":"4.239"},{"text":"upwards telling me i can be confident","start":"403.919","dur":"4.161"},{"text":"that the price will continue in that","start":"406.319","dur":"3.761"},{"text":"direction so this is the point where i","start":"408.08","dur":"4.399"},{"text":"enter the trade and boom the price goes","start":"410.08","dur":"3.76"},{"text":"up from here there are multiple","start":"412.479","dur":"3.601"},{"text":"different variations of the doji candle","start":"413.84","dur":"4"},{"text":"that you might see there is the regular","start":"416.08","dur":"3.36"},{"text":"one which is the one that we just talked","start":"417.84","dur":"3.199"},{"text":"about in the last example the","start":"419.44","dur":"3.44"},{"text":"long-legged doji candle which is","start":"421.039","dur":"4"},{"text":"basically the same candle but just has","start":"422.88","dur":"4.56"},{"text":"larger wicks the dragonfly which has a","start":"425.039","dur":"4.961"},{"text":"small body and a big bottom wick then","start":"427.44","dur":"4.8"},{"text":"the gravestone which has a small body","start":"430","dur":"4.56"},{"text":"and has a big upper wick all of these","start":"432.24","dur":"4.959"},{"text":"tell the same exact story a reversal in","start":"434.56","dur":"4.56"},{"text":"price the next candlestick we'll be","start":"437.199","dur":"4.321"},{"text":"looking at is the hammer the hammer is","start":"439.12","dur":"4.56"},{"text":"usually a candle that looks like this a","start":"441.52","dur":"4.72"},{"text":"decent sized body and a long wick what","start":"443.68","dur":"4.48"},{"text":"this candle is telling us is that","start":"446.24","dur":"4"},{"text":"sellers got the price all the way down","start":"448.16","dur":"4.8"},{"text":"to here but the buyers absorbed all that","start":"450.24","dur":"4.64"},{"text":"selling pressure and raised the price","start":"452.96","dur":"4.079"},{"text":"all the way back up this is usually an","start":"454.88","dur":"4.64"},{"text":"extremely bullish sign and can tell us","start":"457.039","dur":"4.321"},{"text":"that the market will continue to go in","start":"459.52","dur":"4"},{"text":"that direction a candlestick that is","start":"461.36","dur":"4.239"},{"text":"very similar to the hammer is the","start":"463.52","dur":"4.32"},{"text":"shooting star the shooting star is just","start":"465.599","dur":"4.401"},{"text":"like the hammer but it has a small wake","start":"467.84","dur":"4"},{"text":"on the opposite side you should be","start":"470","dur":"3.84"},{"text":"playing this just like the hammer where","start":"471.84","dur":"3.919"},{"text":"if you see a shooting star candle like","start":"473.84","dur":"4"},{"text":"this you can have a good suspicion that","start":"475.759","dur":"4.241"},{"text":"the price will start reversing this next","start":"477.84","dur":"3.759"},{"text":"candlestick pattern is called the","start":"480","dur":"3.759"},{"text":"tweezer this pattern is a red","start":"481.599","dur":"3.761"},{"text":"candlestick followed by a green","start":"483.759","dur":"4.321"},{"text":"candlestick both having similar wicks on","start":"485.36","dur":"5.04"},{"text":"the bottom if you see this pair you can","start":"488.08","dur":"4.32"},{"text":"have a pretty good idea this chart is","start":"490.4","dur":"4.079"},{"text":"about to move upwards let's see an","start":"492.4","dur":"4.239"},{"text":"example so here we can see price is","start":"494.479","dur":"4.321"},{"text":"about to hit this support we see a red","start":"496.639","dur":"4.481"},{"text":"candle with a wick on the bottom right","start":"498.8","dur":"4.799"},{"text":"at the support then we see a green","start":"501.12","dur":"5.04"},{"text":"candle that also has a wick heading","start":"503.599","dur":"4.801"},{"text":"downwards this is telling us that the","start":"506.16","dur":"4.64"},{"text":"price is respecting this support and is","start":"508.4","dur":"5.28"},{"text":"now getting some momentum upwards this","start":"510.8","dur":"4.88"},{"text":"would be a great time to buy and look","start":"513.68","dur":"4.799"},{"text":"what happens price raises it's the exact","start":"515.68","dur":"5.039"},{"text":"opposite for a bearish signal so you","start":"518.479","dur":"4.56"},{"text":"want to see a green candlestick then a","start":"520.719","dur":"5.12"},{"text":"red both having wicks at the top we see","start":"523.039","dur":"5.36"},{"text":"that exact pattern here and boom price","start":"525.839","dur":"5.041"},{"text":"falls the last and final candlestick","start":"528.399","dur":"4.481"},{"text":"pattern i want to talk about is the","start":"530.88","dur":"4.72"},{"text":"marabozu the bullish maribozu is going","start":"532.88","dur":"5.28"},{"text":"to be a big green candle without any","start":"535.6","dur":"4.96"},{"text":"wicks so basically just a big green","start":"538.16","dur":"4.16"},{"text":"rectangle the cool thing about this","start":"540.56","dur":"4"},{"text":"pattern is that it's a good indicator","start":"542.32","dur":"4.4"},{"text":"that price will keep heading in the same","start":"544.56","dur":"4.08"},{"text":"direction it's going you will usually","start":"546.72","dur":"4.32"},{"text":"see this candle in the middle of a trend","start":"548.64","dur":"4.4"},{"text":"confirming that the trend will keep","start":"551.04","dur":"4.4"},{"text":"moving upwards let's see an example so","start":"553.04","dur":"4.88"},{"text":"here we saw a price reversal price is","start":"555.44","dur":"4.399"},{"text":"starting to head upwards then we see a","start":"557.92","dur":"4.479"},{"text":"bullish maribozu candle notice how the","start":"559.839","dur":"5.44"},{"text":"candle has no upper or lower wicks this","start":"562.399","dur":"4.801"},{"text":"means that the lowest price of this","start":"565.279","dur":"4.721"},{"text":"candle was the exact same as its opening","start":"567.2","dur":"4.56"},{"text":"price and the highest point of this","start":"570","dur":"4.48"},{"text":"candle is the exact same as its closing","start":"571.76","dur":"4.88"},{"text":"price this is telling us that buyers","start":"574.48","dur":"4.72"},{"text":"have complete control and we can almost","start":"576.64","dur":"4.319"},{"text":"certainly predict that price will","start":"579.2","dur":"3.84"},{"text":"continue to go upwards and look what","start":"580.959","dur":"5.201"},{"text":"happens it does the bearish maribozu is","start":"583.04","dur":"6.239"},{"text":"the same idea a red candle with no winks","start":"586.16","dur":"5.119"},{"text":"here we see the price had a reversal we","start":"589.279","dur":"4.641"},{"text":"see a bearish maribozu candle telling us","start":"591.279","dur":"4.881"},{"text":"sellers have control and the price will","start":"593.92","dur":"4.88"},{"text":"probably keep moving downwards we enter","start":"596.16","dur":"5.2"},{"text":"making this a winning trade now it's","start":"598.8","dur":"4.8"},{"text":"time to give you a bonus tip for all","start":"601.36","dur":"3.68"},{"text":"those who made it to the end of the","start":"603.6","dur":"3.919"},{"text":"video this is a way of me saying thanks","start":"605.04","dur":"4.64"},{"text":"for watching all the way to the end even","start":"607.519","dur":"3.601"},{"text":"though you should probably try to","start":"609.68","dur":"3.76"},{"text":"memorize these patterns so when you see","start":"611.12","dur":"4.08"},{"text":"them you can have an idea of what the","start":"613.44","dur":"3.36"},{"text":"market is going to do in the back of","start":"615.2","dur":"3.759"},{"text":"your head i completely understand that","start":"616.8","dur":"4.64"},{"text":"it's hard sometimes to look for them or","start":"618.959","dur":"4.401"},{"text":"even remember what they look like well","start":"621.44","dur":"4.16"},{"text":"lucky for you there is a way to make it","start":"623.36","dur":"4"},{"text":"so you can have your chart tell you","start":"625.6","dur":"3.44"},{"text":"exactly where a certain type of","start":"627.36","dur":"4.159"},{"text":"candlestick pattern occurs which makes","start":"629.04","dur":"5.28"},{"text":"it really easy for you to spot them and","start":"631.519","dur":"4.241"},{"text":"you don't even necessarily have to","start":"634.32","dur":"3.519"},{"text":"memorize them to do this just go to","start":"635.76","dur":"4.24"},{"text":"trading view click the indicators tab","start":"637.839","dur":"4.401"},{"text":"type in whatever candlestick pattern you","start":"640","dur":"4.64"},{"text":"want so for this example we'll do a","start":"642.24","dur":"4.64"},{"text":"bullish engulfing simply click it and","start":"644.64","dur":"4.639"},{"text":"training view will notify you on the","start":"646.88","dur":"4.56"},{"text":"chart when the bullish engulfing candle","start":"649.279","dur":"5.12"},{"text":"appears making it extremely easy to spot","start":"651.44","dur":"4.959"},{"text":"when it happens and you don't even have","start":"654.399","dur":"4"},{"text":"to look that hard you can also add","start":"656.399","dur":"4.081"},{"text":"multiple candlestick patterns to your","start":"658.399","dur":"4.321"},{"text":"chart so you can identify when any of","start":"660.48","dur":"4.16"},{"text":"them occur i hope you guys got some","start":"662.72","dur":"3.52"},{"text":"value out of this and you learned","start":"664.64","dur":"3.92"},{"text":"something new if you did i would really","start":"666.24","dur":"4.24"},{"text":"appreciate it if you took five seconds","start":"668.56","dur":"4.08"},{"text":"out of your day and like this video the","start":"670.48","dur":"4.16"},{"text":"one and only problem trading with","start":"672.64","dur":"4.56"},{"text":"candlestick patterns is false breakouts","start":"674.64","dur":"4.4"},{"text":"where a certain candlestick pattern","start":"677.2","dur":"4.24"},{"text":"occurs but the price actually does the","start":"679.04","dur":"4.64"},{"text":"exact opposite of what the pattern","start":"681.44","dur":"4"},{"text":"predicts if you want to learn how to","start":"683.68","dur":"3.92"},{"text":"avoid situations like this watch this","start":"685.44","dur":"4.72"},{"text":"video where i go over my secret strategy","start":"687.6","dur":"4.88"},{"text":"to avoid false breakouts thanks for","start":"690.16","dur":"4.56"},{"text":"watching and i'll see you guys","start":"692.48","dur":"5.479"},{"text":"next time","start":"694.72","dur":"3.239"},{"text":"you","start":"704.64","dur":"2.08"}]}],"isLive":false,"languages":[{"label":"English (auto-generated)","languageCode":"en"}],"isLoginRequired":false,"playabilityStatus":{"status":"OK","playableInEmbed":true,"miniplayer":{"miniplayerRenderer":{"playbackMode":"PLAYBACK_MODE_ALLOW"}},"contextParams":"Q0FFU0FnZ0M="},"author":"TradingLab","channelId":"UCCbv0qixG-cyokxEY3kELtg","keywords":["candlestick patterns","candlestick pattern","candlestick chart","candlestick patterns for beginners","candlestick","candlestick charts","candlestick analysis","trading candlestick patterns","doji candlestick pattern","candlesticks patterns","candlestick trading","candlestick chart patterns","candlestick patterns trading","candlestick bearish patterns","advanced candlestick patterns","candlesticks","best candlestick patterns","candlestick basics"]},{"text":"Here s a mistake I see traders make all the time when using Doji candles. A doji candle is a candlestick that has a very thin body and long wick on each side. What a lot of traders will do, is once then see a downtrend, then a green doji candle appears, they think that means an instant reversal will happen. So they enter here. The problem is, doji candles don t automatically mean that there s going to be a reversal. It s just a simple way of the market telling us its uncertain of what it want s to do next. So a lot of the time, there will be a big move after a doji, but it s not always upwards. Don t just jump in a trade because you see a green doji candle. If you want to use a doji for an entry. Simply just wait to see if the next candle will break the high of the doji for confirmation. Once it does, then enter the trade. here's a mistake i see traders make all the time when using doji candles a doji candle is a candlestick that has a very thin body and long wicks on each side what a lot of traders will do is once they see a downtrend then a green doji candle appears they think that means an instant reversal will happen so they enter here the problem is doji candles don't automatically mean that there's gonna be a reversal it's just a simple way of the market telling us it's uncertain of what it wants to do next so a lot of the time there will be a big move after a doji but it's not always upwards don't just jump in a trade because you see a green doji candle if you want to use a doji for an entry simply just wait to see if the next candle will break the high of the doji for confirmation once it does then enter the trade","id":"4xIBNEPTEp0","title":"The Common MISTAKE Traders Make With Doji Candles #Shorts","microformat":{"playerMicroformatRenderer":{"thumbnail":{"thumbnails":[{"url":"https://i.ytimg.com/vi/4xIBNEPTEp0/maxres2.jpg?sqp=-oaymwEoCIAKENAF8quKqQMcGADwAQH4AbYIgAKAD4oCDAgAEAEYfyAiKDUwDw==&rs=AOn4CLB5KRK9IUzwbhL_cWKWfsMvGGxdXw","width":1280,"height":720}]},"embed":{"iframeUrl":"https://www.youtube.com/embed/4xIBNEPTEp0","width":1280,"height":720},"title":{"simpleText":"The Common MISTAKE Traders Make With Doji Candles #Shorts"},"description":{"simpleText":"In this video, I give a quick example of a common mistake traders make with Doji candles and how you can use them correctly. \n\nIf you learned something new, leave a like.\n\nTrading Discord: https://discord.gg/5MGeeCWa\n\nâ–º Scanz (News Screener I Use): http://www.scanz.com?fpr=tradinglab\n\nâ–º TradingView (Chart Software I Use): https://www.tradingview.com/?offer_id=10&aff_id=28566\n\nâ–º Get 2 FREE stocks valued up to $1850 (when you deposit $100): https://act.webull.com/on/A6BoDyk5xy2A/zbk/inviteUs/main\n\nâ–º Get up to $250 in Crypto Currency: https://blockfi.com/?ref=ca9f3260\n\nðŸ”´ Subscribe for more videos just like this: https://www.youtube.com/channel/UCCbv0qixG-cyokxEY3kELtg?sub_confirmation=1\n\nFollow TradingLab: \n===============================\nðŸ“¸ - IG: https://www.instagram.com/tradinglabofficial/\n\n*None of this is meant to be construed as investment advice, it's for entertainment purposes only. The links above include affiliate commissions or referrals. I'm part of an affiliate network and I receive compensation from partnering websites. The video is accurate as of the posting date but may not be accurate in the future."},"lengthSeconds":"47","ownerProfileUrl":"http://www.youtube.com/@TradingLabOfficial","externalChannelId":"UCCbv0qixG-cyokxEY3kELtg","isFamilySafe":true,"availableCountries":["AD","AE","AF","AG","AI","AL","AM","AO","AQ","AR","AS","AT","AU","AW","AX","AZ","BA","BB","BD","BE","BF","BG","BH","BI","BJ","BL","BM","BN","BO","BQ","BR","BS","BT","BV","BW","BY","BZ","CA","CC","CD","CF","CG","CH","CI","CK","CL","CM","CN","CO","CR","CU","CV","CW","CX","CY","CZ","DE","DJ","DK","DM","DO","DZ","EC","EE","EG","EH","ER","ES","ET","FI","FJ","FK","FM","FO","FR","GA","GB","GD","GE","GF","GG","GH","GI","GL","GM","GN","GP","GQ","GR","GS","GT","GU","GW","GY","HK","HM","HN","HR","HT","HU","ID","IE","IL","IM","IN","IO","IQ","IR","IS","IT","JE","JM","JO","JP","KE","KG","KH","KI","KM","KN","KP","KR","KW","KY","KZ","LA","LB","LC","LI","LK","LR","LS","LT","LU","LV","LY","MA","MC","MD","ME","MF","MG","MH","MK","ML","MM","MN","MO","MP","MQ","MR","MS","MT","MU","MV","MW","MX","MY","MZ","NA","NC","NE","NF","NG","NI","NL","NO","NP","NR","NU","NZ","OM","PA","PE","PF","PG","PH","PK","PL","PM","PN","PR","PS","PT","PW","PY","QA","RE","RO","RS","RU","RW","SA","SB","SC","SD","SE","SG","SH","SI","SJ","SK","SL","SM","SN","SO","SR","SS","ST","SV","SX","SY","SZ","TC","TD","TF","TG","TH","TJ","TK","TL","TM","TN","TO","TR","TT","TV","TW","TZ","UA","UG","UM","US","UY","UZ","VA","VC","VE","VG","VI","VN","VU","WF","WS","YE","YT","ZA","ZM","ZW"],"isUnlisted":false,"hasYpcMetadata":false,"viewCount":"1793731","category":"Education","publishDate":"2022-01-13T08:00:26-08:00","ownerChannelName":"TradingLab","uploadDate":"2022-01-13T08:00:26-08:00","isShortsEligible":true,"externalVideoId":"4xIBNEPTEp0","likeCount":"134330","canonicalUrl":"https://www.youtube.com/shorts/4xIBNEPTEp0"}},"tracks":[{"language":"English","transcript":[{"text":"Here s a mistake I see traders make all the\ntime when using Doji candles. A doji candle","start":"0.26","dur":"4.891"},{"text":"is a candlestick that has a very thin body\nand long wick on each side. What a lot of","start":"5.151","dur":"4.699"},{"text":"traders will do, is once then see a downtrend,\nthen a green doji candle appears, they think","start":"9.85","dur":"4.61"},{"text":"that means an instant reversal will happen.\nSo they enter here.","start":"14.46","dur":"3.82"},{"text":"The problem is, doji candles don t automatically\nmean that there s going to be a reversal.","start":"18.28","dur":"4.419"},{"text":"It s just a simple way of the market telling\nus its uncertain of what it want s to do next.","start":"22.699","dur":"5.031"},{"text":"So a lot of the time, there will be a big\nmove after a doji, but it s not always upwards.","start":"27.73","dur":"5.64"},{"text":"Don t just jump in a trade because you see\na green doji candle.","start":"33.37","dur":"2.939"},{"text":"If you want to use a doji for an entry. Simply\njust wait to see if the next candle will break","start":"36.309","dur":"4.361"},{"text":"the high of the doji for confirmation. Once\nit does, then enter the trade.","start":"40.67","dur":"4.13"}]},{"language":"English (auto-generated)","transcript":[{"text":"here's a mistake i see traders make all","start":"0.16","dur":"4.639"},{"text":"the time when using doji candles a doji","start":"2.32","dur":"4.4"},{"text":"candle is a candlestick that has a very","start":"4.799","dur":"4.481"},{"text":"thin body and long wicks on each side","start":"6.72","dur":"4.32"},{"text":"what a lot of traders will do is once","start":"9.28","dur":"3.92"},{"text":"they see a downtrend then a green doji","start":"11.04","dur":"4.24"},{"text":"candle appears they think that means an","start":"13.2","dur":"4.24"},{"text":"instant reversal will happen so they","start":"15.28","dur":"5.04"},{"text":"enter here the problem is doji candles","start":"17.44","dur":"4.4"},{"text":"don't automatically mean that there's","start":"20.32","dur":"3.28"},{"text":"gonna be a reversal it's just a simple","start":"21.84","dur":"3.519"},{"text":"way of the market telling us it's","start":"23.6","dur":"4.24"},{"text":"uncertain of what it wants to do next so","start":"25.359","dur":"4.24"},{"text":"a lot of the time there will be a big","start":"27.84","dur":"4.64"},{"text":"move after a doji but it's not always","start":"29.599","dur":"4.721"},{"text":"upwards don't just jump in a trade","start":"32.48","dur":"3.759"},{"text":"because you see a green doji candle if","start":"34.32","dur":"3.84"},{"text":"you want to use a doji for an entry","start":"36.239","dur":"3.521"},{"text":"simply just wait to see if the next","start":"38.16","dur":"3.6"},{"text":"candle will break the high of the doji","start":"39.76","dur":"4.4"},{"text":"for confirmation once it does then enter","start":"41.76","dur":"5.56"},{"text":"the trade","start":"44.16","dur":"3.16"}]}],"isLive":false,"languages":[{"label":"English","languageCode":"en"},{"label":"English (auto-generated)","languageCode":"en"}],"isLoginRequired":false,"playabilityStatus":{"status":"OK","playableInEmbed":true,"miniplayer":{"miniplayerRenderer":{"playbackMode":"PLAYBACK_MODE_ALLOW","enableStashedPlayback":false}},"contextParams":"Q0FFU0FnZ0M="},"author":"TradingLab","channelId":"UCCbv0qixG-cyokxEY3kELtg","keywords":["trading","doji candle","technical trading","technical analysis","candlesticks","investing","stocks","forex","crypto","trading ranges","trading strategy","Doji","Tradinglab","doji candlestick pattern","doji candlestick","doji candlestick analysis"]},{"text":"How to place better stop losses. Has this ever happened to you? You see the price coming to a key support from where it bounced off earlier. You have the idea to buy at this level as you expect the price to bounce. Turns out, you were right, buttttt right before the price went up, your stop loss got hit, making this a losing trade rather than a winning one. Many traders place their stoploss right below the support level. While this is the right idea, its likely to get stopped out a lot. To fix this, go to recent history of the chart, and see other key levels around this area. This will give you a range, rather than a single level. Set your stop loss right below this range, and you won t get stopped out as much. If you don t want to guess how low to put your stop loss. Use the ATR indicator. It s the average true range, and will take the average price movement from the past candles. Just take this number it gives you and subtract it from the support level. This is where you should place your stop loss.","id":"ofprxffWsWA","microformat":{"playerMicroformatRenderer":{"category":"Education","description":{"simpleText":"Stop losses are a very important part of trading. Lots of traders are placing them wrong. Enjoy these short little tips to help you place better stop losses.\n\nIf you learned something new, leave a like.\n\nâ–º Scanz (News Screener I Use): http://www.scanz.com?fpr=tradinglab\n\nâ–º TradingView (Chart Software I Use): https://www.tradingview.com/?offer_id=10&aff_id=28566\n\nâ–º Get 2 FREE stocks valued up to $1850 (when you deposit $100): https://act.webull.com/on/A6BoDyk5xy2A/zbk/inviteUs/main\n\nâ–º Get up to $250 in Crypto Currency: https://blockfi.com/?ref=ca9f3260\n\nðŸ”´ Subscribe for more videos just like this: https://www.youtube.com/channel/UCCbv0qixG-cyokxEY3kELtg?sub_confirmation=1\n\nFollow TradingLab: \n===============================\nðŸ“¸ - IG: https://www.instagram.com/tradinglabofficial/\nðŸ“± - TikTok: https://www.tiktok.com/@thetradinglab\n\n*None of this is meant to be construed as investment advice, it's for entertainment purposes only. The links above include affiliate commissions or referrals. I'm part of an affiliate network and I receive compensation from partnering websites. The video is accurate as of the posting date but may not be accurate in the future."},"externalChannelId":"UCCbv0qixG-cyokxEY3kELtg","lengthSeconds":"59","ownerChannelName":"TradingLab","publishDate":"2022-02-06","title":{"simpleText":"How To Place BETTER Stoplosses #shorts"}}},"isLive":false,"isLoginRequired":false,"languages":[{"label":"en","languageCode":"en"}],"playabilityStatus":{"status":"OK","reason":""},"title":"How To Place BETTER Stoplosses #shorts","tracks":[{"language":"en","transcript":[{"start":"0.16","dur":"4.639","text":"How to place better stop losses. Has this everÂ \nhappened to you? You see the price coming to aÂ Â "},{"start":"4.8","dur":"4.32","text":"key support from where it bounced off earlier.Â \nYou have the idea to buy at this level as youÂ Â "},{"start":"9.12","dur":"11.04","text":"expect the price to bounce. Turns out, you wereÂ \nright, buttttt right before the price went up,Â Â "},{"start":"20.16","dur":"4.48","text":"your stop loss got hit, making this aÂ \nlosing trade rather than a winning one.\nÂ "},{"start":"24.64","dur":"4.799","text":"Many traders place their stoploss right belowÂ \nthe support level. While this is the right idea,Â Â "},{"start":"29.44","dur":"5.12","text":"its likely to get stopped out a lot. To fixÂ \nthis, go to recent history of the chart, and seeÂ Â "},{"start":"34.56","dur":"4.8","text":"other key levels around this area. This willÂ \ngive you a range, rather than a single level.\nÂ "},{"start":"39.36","dur":"4.24","text":"Set your stop loss right below this range,Â \nand you won t get stopped out as much.\nÂ "},{"start":"43.6","dur":"4.4","text":"If you don t want to guess how low to putÂ \nyour stop loss. Use the ATR indicator. ItÂ Â "},{"start":"48","dur":"5.2","text":"s the average true range, and will take theÂ \naverage price movement from the past candles. \nÂ "},{"start":"53.2","dur":"3.68","text":"Just take this number it gives you andÂ \nsubtract it from the support level.\nÂ "},{"start":"56.88","dur":"2.08","text":"This is where you should place your stop loss. "}]}]}]