[{"text":"Ahhh breakout strategies. Setting a support line, then a resistance line, and waiting for that one moment to happen. When the price suddenly breaks through. And when it breaks through, it really breaks through. But how do you trade this strategy successfully? Is there even a strategy? Are there any secrets? Well yes, there s a couple. And lucky for you, I m about to share them in this video. Lets not waste any time. Let s get straight to it. Has this ever happened you? You set your support line, you set your resistance line, and wait for a breakout to happen. Once you see that the price suddenly breaks through your resistance, you enter a trade extremely excited, because you are prepared for a huge jump in price. You get your popcorn, sit down, stare at your monitor, but then suddenly, The price reverses and dips. You stare at your screen confused on what just happened, and you portfolio just tanked. Well, I m going to teach you a secret so this never happens to you again. So the first question we need to ask ourselves, is what is a breakout? Well a breakout is when you have a support and resistance, where there are multiple key rejections for both. The actual breakout happens when the price bursts through one of the key levels. And notice what happens, when the price does break through, it starts soaring. Making this point right here, a great entry point. But the question is, how do we find setups like this, where the market could potentially have a breakout? The answer is breakout patterns. I m sure you ve all seen these before, but there are multiple key breakout patterns you should have in the back of your head when trading. There s the wedge, flag, rectangle, triangle, and pennant. Now the problem I see a lot of people doing, is they are looking for the exact price action that is in the pattern image. The price will rarely mimic this exact pattern, if ever. So your not exactly looking for the exact price action that happens in the image, your looking for the key support and resistance levels that make that pattern. Now to be honest, it doesn t matter which pattern you get. Hell, you don t even memorize the names of the patterns. The key thing you have to take away from this is that all these patterns have something in common. The price consolidates, making two key levels, then eventually breaks out. So here, we found price movement that looks as if it has multiple key points of support and resistance. The more key points, the better. We acknowledge this is happening so put a support and resistance line, making a rectangle pattern. So far so good, but this is the point where people usually make the mistake. So what happens is people usually wait for a breakout in either direction. So once someone sees the price break through their resistance line, they immediately enter the trade, but it turns out, it was a false breakout, and the price reverses in the opposite direction. This specific trader, would have lost a pretty decent amount of money. I m going to show you how to prevent this from happening, so we go in with a greater chance of the price going the direction we want it to. The first thing we need to understand is what is called momentum candles . Momentum candles can have many forms, but usually it s one big candle, with a large body. Or 3 medium sized candles, all going in the same directions. These two forms of momentum candles are going to be what we are looking for. Let me show you an example. So in this example we have a set of multiple higher highs, so we can set a resistance level right here. Then we have a key support level right here, because the price reversed multiple times at this level. And now we wait. We see a pretty decent sized candle form and break the resistance level. The problem is, only the tip of it broke out, so we are not counting this as a momentum candle. For us to be able to count this as a momentum candle, the majority of the body would have had to be crossing the resistance level. We would also consider this a momentum candle if another green candle appears outside of the line, like this. But, unfortunately it was a red candle instead, so we ignore this signal. And look what happened, it was a false breakout. Let me show you another example. So here, we have our support and resistance levels set up, the price moves, and a decent sized candle breaks through our resistance. It s not a momentum candle, because it does not have a big body, so we wait for further confirmation. A second candle appears, but it s still a pretty small candle. And as we said before, we will only count it as momentum candle, if it has a huge body, or there are three green candle. So we wait again. Then a 3rd green candle pops up, which is an extremely bullish sign. So, this when we enter the trade. Now, there are three different scenarios that could happen. The price keeps going up from here. The price goes back down to the resistance level, and bounces off. Or, the price breaks through the resistance level, and falls back down and counts this as a false breakout. So what should we do? Should we wait for a pullback to happen? OR should we enter the trade right now? Well what I like to do, is setup a strategy, so the odds are in my favor no matter what the outcome is. Rather than wait for a pullback, I m going to enter the trade at the close of this momentum candle. Then, I will set my stop loss right below the resistance level. This way, if the price does end up doing a pullback and bouncing off my resistance level, it doesn t reach my stop loss, and I still make profit. Or if the price decides to go straight up from here, I m in the trade. Considering this candle right here, is a momentum candle, it s a very low chance that this is a false breakout. But in the off chance it were, I have a stop loss in case the price decided to drop. Now that we have our entry point, we need to figure out an exit strategy. With breakouts, they tend to have large upsides. So if we decided to do just the normal 1.5 ratio, we would be missing out on a lot of profit. To make sure we are taking advantage of the huge profits, is to use what I like to call, the 2 step take profit system. This is how it works. First, you find your entry signal, then put the stop loss below the resistance line, then we are going to set our take profit line at a 1.5 ratio. Once the price hits our take profit mark, we sell half of our shares to guarantee that profit. The other half will stay in the game. Next, we will raise our stop loss to our previous take profit mark. Then our next take profit mark will be declared by an indicator, that indicator is the chandelier indicator. To add this indicator, just go to trading view, go the indicators tab, and type in chandelier stop . Then go to the indicators settings, and change the ATR multiplier to 2. This will give us our exit strategy. It s very simple. We sold half of our shares at the 1.5 profit mark. We let the other half run. we set our new stop loss at our old take profit mark, and we will exit the trade once the chandelier indicator changes colors. So right here, we would of sold the remaining of our position. Notice all of the extra profit we made, by only selling half of our shares. If we would of sold all of our shares at the 1.5 profit mark, we would of missed out on a lot upside. You can also see the price went straight up right away, without forming a pullback. This is why I like to enter the trade right away, because most breakouts will go straight up, without forming a pullback. Let s see one more example. We find some key points that are great levels to make a support and resistance. Once we set our trend lines, we wait for a momentum candle to break through our resistance. One candle breaks, but it does not have a big body, so we wait for two more green candles. Once we see the three candles, we enter the trade. We then put our stop loss below the resistance line, and the set our take profit to a 1.5 ratio. We then wait for the price to hit our take profit, then we sell half our shares. After we sold half of our shares, we move our stop loss to our old take profit mark, then we turn on the chandelier indicator. We Then wait to sell the other half of our shares, until the chandelier indicator turns colors. Once it does, we exit the trade. I just show you some secrets to make your break out trading that much better. All I ask in return, is if you take 2 seconds out of your day and like this video. If you want to see part 2 of this video, and make this strategy even more profitable, check out this video. Thanks for watching, and ill see you guys, next time.","id":"ZudTPpJCbbA","title":"How to Avoid False Breakouts (My Secret Technique)","microformat":{"playerMicroformatRenderer":{"thumbnail":{"thumbnails":[{"url":"https://i.ytimg.com/vi/ZudTPpJCbbA/maxresdefault.jpg","width":1280,"height":720}]},"embed":{"iframeUrl":"https://www.youtube.com/embed/ZudTPpJCbbA","width":1280,"height":720},"title":{"simpleText":"How to Avoid False Breakouts (My Secret Technique)"},"description":{"simpleText":"People use breakout strategies all the time, but are they using them correctly? In this video, I show you how to avoid false breakouts and only go in when you are confident the price will head in the direction you want it to. Enjoy!\n\nIf you learned something new, leave a like.\n\nðŸ“ˆ My Private Buy/Sell Indicator: https://tradinglab.ai/\n\nðŸ’¬ My Trading Discord: https://discord.gg/nHqDYZuuK2\n\nðŸ’µ HankoTrade (Where I Trade Forex): https://login.hankotrade.com/register?franchiseLead=MjQxNg==\n\nâš¡ Bybit (Where I Buy Crypto) Up To $4,020 in Rewards: https://partner.bybit.com/b/TradingLab\n\nðŸš€ Webull (Where I Buy Stocks): https://a.webull.com/i/TradingLab\n\nðŸ“Š TradingView (Chart Software I Use): https://www.tradingview.com/?offer_id=10&aff_id=28566\n\nðŸ“° Benzinga (News Scanner I Use): https://benzinga.grsm.io/TradingLab\n\n\nðŸ”´ Subscribe for more videos just like this: https://www.youtube.com/channel/UCCbv0qixG-cyokxEY3kELtg?sub_confirmation=1\n\nFollow TradingLab: \n===============================\nðŸ“¸ - IG: https://www.instagram.com/tradinglabo...\nðŸ“± - TikTok: https://www.tiktok.com/@thetradinglab\n\n*None of this is meant to be construed as investment advice, it's for entertainment purposes only. The links above include affiliate commissions or referrals. I'm part of an affiliate network and I receive compensation from partnering websites. The video is accurate as of the posting date but may not be accurate in the future."},"lengthSeconds":"504","ownerProfileUrl":"http://www.youtube.com/@TradingLabOfficial","externalChannelId":"UCCbv0qixG-cyokxEY3kELtg","isFamilySafe":true,"availableCountries":["AD","AE","AF","AG","AI","AL","AM","AO","AQ","AR","AS","AT","AU","AW","AX","AZ","BA","BB","BD","BE","BF","BG","BH","BI","BJ","BL","BM","BN","BO","BQ","BR","BS","BT","BV","BW","BY","BZ","CA","CC","CD","CF","CG","CH","CI","CK","CL","CM","CN","CO","CR","CU","CV","CW","CX","CY","CZ","DE","DJ","DK","DM","DO","DZ","EC","EE","EG","EH","ER","ES","ET","FI","FJ","FK","FM","FO","FR","GA","GB","GD","GE","GF","GG","GH","GI","GL","GM","GN","GP","GQ","GR","GS","GT","GU","GW","GY","HK","HM","HN","HR","HT","HU","ID","IE","IL","IM","IN","IO","IQ","IR","IS","IT","JE","JM","JO","JP","KE","KG","KH","KI","KM","KN","KP","KR","KW","KY","KZ","LA","LB","LC","LI","LK","LR","LS","LT","LU","LV","LY","MA","MC","MD","ME","MF","MG","MH","MK","ML","MM","MN","MO","MP","MQ","MR","MS","MT","MU","MV","MW","MX","MY","MZ","NA","NC","NE","NF","NG","NI","NL","NO","NP","NR","NU","NZ","OM","PA","PE","PF","PG","PH","PK","PL","PM","PN","PR","PS","PT","PW","PY","QA","RE","RO","RS","RU","RW","SA","SB","SC","SD","SE","SG","SH","SI","SJ","SK","SL","SM","SN","SO","SR","SS","ST","SV","SX","SY","SZ","TC","TD","TF","TG","TH","TJ","TK","TL","TM","TN","TO","TR","TT","TV","TW","TZ","UA","UG","UM","US","UY","UZ","VA","VC","VE","VG","VI","VN","VU","WF","WS","YE","YT","ZA","ZM","ZW"],"isUnlisted":false,"hasYpcMetadata":false,"viewCount":"3453536","category":"Education","publishDate":"2021-10-29T08:50:13-07:00","ownerChannelName":"TradingLab","uploadDate":"2021-10-29T08:50:13-07:00","isShortsEligible":false,"externalVideoId":"ZudTPpJCbbA","likeCount":"175706"}},"tracks":[{"language":"English","transcript":[{"text":"Ahhh breakout strategies. Setting a support\nline, then a resistance line, and waiting","start":"0.149","dur":"4.901"},{"text":"for that one moment to happen. When the price\nsuddenly breaks through. And when it breaks","start":"5.05","dur":"5.119"},{"text":"through, it really breaks through.\nBut how do you trade this strategy successfully?","start":"10.169","dur":"5.8"},{"text":"Is there even a strategy? Are there any secrets?\nWell yes, there s a couple. And lucky for","start":"15.969","dur":"5.46"},{"text":"you, I m about to share them in this video.\nLets not waste any time. Let s get straight","start":"21.429","dur":"4.25"},{"text":"to it.\nHas this ever happened you? You set your support","start":"25.679","dur":"2.651"},{"text":"line, you set your resistance line, and wait\nfor a breakout to happen. Once you see that","start":"28.33","dur":"4.37"},{"text":"the price suddenly breaks through your resistance,\nyou enter a trade extremely excited, because","start":"32.7","dur":"5.16"},{"text":"you are prepared for a huge jump in price.\nYou get your popcorn, sit down, stare at your","start":"37.86","dur":"5.19"},{"text":"monitor, but then suddenly, The price reverses\nand dips. You stare at your screen confused","start":"43.05","dur":"5.5"},{"text":"on what just happened, and you portfolio just\ntanked.","start":"48.55","dur":"2.96"},{"text":"Well, I m going to teach you a secret so this\nnever happens to you again.","start":"51.51","dur":"4.66"},{"text":"So the first question we need to ask ourselves,\nis what is a breakout?","start":"56.17","dur":"4.15"},{"text":"Well a breakout is when you have a support\nand resistance, where there are multiple key","start":"60.32","dur":"4.07"},{"text":"rejections for both. The actual breakout happens\nwhen the price bursts through one of the key","start":"64.39","dur":"5.11"},{"text":"levels. And notice what happens, when the\nprice does break through, it starts soaring.","start":"69.5","dur":"5.01"},{"text":"Making this point right here, a great entry\npoint.","start":"74.51","dur":"2.77"},{"text":"But the question is, how do we find setups\nlike this, where the market could potentially","start":"77.28","dur":"4.69"},{"text":"have a breakout?\nThe answer is breakout patterns.","start":"81.97","dur":"3.28"},{"text":"I m sure you ve all seen these before, but\nthere are multiple key breakout patterns you","start":"85.25","dur":"4.38"},{"text":"should have in the back of your head when\ntrading.","start":"89.63","dur":"2.279"},{"text":"There s the wedge, flag, rectangle, triangle,\nand pennant.","start":"91.909","dur":"4.57"},{"text":"Now the problem I see a lot of people doing,\nis they are looking for the exact price action","start":"96.479","dur":"4.711"},{"text":"that is in the pattern image.\nThe price will rarely mimic this exact pattern,","start":"101.19","dur":"4.99"},{"text":"if ever. So your not exactly looking for the\nexact price action that happens in the image,","start":"106.18","dur":"4.92"},{"text":"your looking for the key support and resistance\nlevels that make that pattern.","start":"111.1","dur":"4.059"},{"text":"Now to be honest, it doesn t matter which\npattern you get. Hell, you don t even memorize","start":"115.159","dur":"4.821"},{"text":"the names of the patterns.\nThe key thing you have to take away from this","start":"119.98","dur":"3.52"},{"text":"is that all these patterns have something\nin common.","start":"123.5","dur":"2.869"},{"text":"The price consolidates, making two key levels,\nthen eventually breaks out.","start":"126.369","dur":"5.111"},{"text":"So here, we found price movement that looks\nas if it has multiple key points of support","start":"131.48","dur":"5.099"},{"text":"and resistance. The more key points, the better.\nWe acknowledge this is happening so put a","start":"136.579","dur":"5.08"},{"text":"support and resistance line, making a rectangle\npattern.","start":"141.659","dur":"4.12"},{"text":"So far so good, but this is the point where\npeople usually make the mistake. So what happens","start":"145.779","dur":"4.74"},{"text":"is people usually wait for a breakout in either\ndirection.","start":"150.519","dur":"3.25"},{"text":"So once someone sees the price break through\ntheir resistance line, they immediately enter","start":"153.769","dur":"4.291"},{"text":"the trade, but it turns out, it was a false\nbreakout, and the price reverses in the opposite","start":"158.06","dur":"5.75"},{"text":"direction.\nThis specific trader, would have lost a pretty","start":"163.81","dur":"3.31"},{"text":"decent amount of money.\nI m going to show you how to prevent this","start":"167.12","dur":"2.899"},{"text":"from happening, so we go in with a greater\nchance of the price going the direction we","start":"170.019","dur":"4.631"},{"text":"want it to.\nThe first thing we need to understand is what","start":"174.65","dur":"2.8"},{"text":"is called momentum candles . Momentum candles\ncan have many forms, but usually it s one","start":"177.45","dur":"5.36"},{"text":"big candle, with a large body. Or 3 medium\nsized candles, all going in the same directions.","start":"182.81","dur":"7.039"},{"text":"These two forms of momentum candles are going\nto be what we are looking for. Let me show","start":"189.849","dur":"4.34"},{"text":"you an example.\nSo in this example we have a set of multiple","start":"194.189","dur":"3.22"},{"text":"higher highs, so we can set a resistance level\nright here. Then we have a key support level","start":"197.409","dur":"4.951"},{"text":"right here, because the price reversed multiple\ntimes at this level. And now we wait.","start":"202.36","dur":"4.799"},{"text":"We see a pretty decent sized candle form and\nbreak the resistance level. The problem is,","start":"207.159","dur":"9.071"},{"text":"only the tip of it broke out, so we are not\ncounting this as a momentum candle. For us","start":"216.23","dur":"5.039"},{"text":"to be able to count this as a momentum candle,\nthe majority of the body would have had to","start":"221.269","dur":"4.381"},{"text":"be crossing the resistance level. We would\nalso consider this a momentum candle if another","start":"225.65","dur":"5.129"},{"text":"green candle appears outside of the line,\nlike this.","start":"230.779","dur":"3.511"},{"text":"But, unfortunately it was a red candle instead,\nso we ignore this signal. And look what happened,","start":"234.29","dur":"4.255"},{"text":"it was a false breakout.","start":"238.545","dur":"1"},{"text":"Let me show you another example. So here,\nwe have our support and resistance levels","start":"239.545","dur":"4.284"},{"text":"set up, the price moves, and a decent sized\ncandle breaks through our resistance. It s","start":"243.829","dur":"4.341"},{"text":"not a momentum candle, because it does not\nhave a big body, so we wait for further confirmation.","start":"248.17","dur":"5.299"},{"text":"A second candle appears, but it s still a\npretty small candle.","start":"253.469","dur":"4.77"},{"text":"And as we said before, we will only count\nit as momentum candle, if it has a huge body,","start":"258.239","dur":"6.15"},{"text":"or there are three green candle.\nSo we wait again. Then a 3rd green candle","start":"264.389","dur":"5.62"},{"text":"pops up, which is an extremely bullish sign.\nSo, this when we enter the trade.","start":"270.009","dur":"5.16"},{"text":"Now, there are three different scenarios that\ncould happen. The price keeps going up from","start":"275.169","dur":"4.141"},{"text":"here. The price goes back down to the resistance\nlevel, and bounces off. Or, the price breaks","start":"279.31","dur":"4.74"},{"text":"through the resistance level, and falls back\ndown and counts this as a false breakout.","start":"284.05","dur":"4.31"},{"text":"So what should we do? Should we wait for a\npullback to happen? OR should we enter the","start":"288.36","dur":"4.13"},{"text":"trade right now?","start":"292.49","dur":"1.429"},{"text":"Well what I like to do, is setup a strategy,\nso the odds are in my favor no matter what","start":"293.919","dur":"5.421"},{"text":"the outcome is. Rather than wait for a pullback,\nI m going to enter the trade at the close","start":"299.34","dur":"4.669"},{"text":"of this momentum candle.\nThen, I will set my stop loss right below","start":"304.009","dur":"4.28"},{"text":"the resistance level. This way, if the price\ndoes end up doing a pullback and bouncing","start":"308.289","dur":"5.85"},{"text":"off my resistance level, it doesn t reach\nmy stop loss, and I still make profit.","start":"314.139","dur":"5.441"},{"text":"Or if the price decides to go straight up\nfrom here, I m in the trade.","start":"319.58","dur":"4.149"},{"text":"Considering this candle right here, is a momentum\ncandle, it s a very low chance that this is","start":"323.729","dur":"5.021"},{"text":"a false breakout. But in the off chance it\nwere, I have a stop loss in case the price","start":"328.75","dur":"5.7"},{"text":"decided to drop.\nNow that we have our entry point, we need","start":"334.45","dur":"2.66"},{"text":"to figure out an exit strategy.\nWith breakouts, they tend to have large upsides.","start":"337.11","dur":"5.309"},{"text":"So if we decided to do just the normal 1.5\nratio, we would be missing out on a lot of","start":"342.419","dur":"5.81"},{"text":"profit.\nTo make sure we are taking advantage of the","start":"348.229","dur":"2.5"},{"text":"huge profits, is to use what I like to call,\nthe 2 step take profit system.","start":"350.729","dur":"5.701"},{"text":"This is how it works. First, you find your\nentry signal, then put the stop loss below","start":"356.43","dur":"4.2"},{"text":"the resistance line, then we are going to\nset our take profit line at a 1.5 ratio.","start":"360.63","dur":"5.61"},{"text":"Once the price hits our take profit mark,\nwe sell half of our shares to guarantee that","start":"366.24","dur":"4.69"},{"text":"profit. The other half will stay in the game.\nNext, we will raise our stop loss to our previous","start":"370.93","dur":"6.959"},{"text":"take profit mark. Then our next take profit\nmark will be declared by an indicator, that","start":"377.889","dur":"4.96"},{"text":"indicator is the chandelier indicator.","start":"382.849","dur":"2.711"},{"text":"To add this indicator, just go to trading\nview, go the indicators tab, and type in chandelier","start":"385.56","dur":"5.139"},{"text":"stop . Then go to the indicators settings,\nand change the ATR multiplier to 2.","start":"390.699","dur":"5.78"},{"text":"This will give us our exit strategy.\nIt s very simple. We sold half of our shares","start":"396.479","dur":"5.15"},{"text":"at the 1.5 profit mark. We let the other half\nrun. we set our new stop loss at our old take","start":"401.629","dur":"6.26"},{"text":"profit mark, and we will exit the trade once\nthe chandelier indicator changes colors.","start":"407.889","dur":"5.59"},{"text":"So right here, we would of sold the remaining\nof our position. Notice all of the extra profit","start":"413.479","dur":"6.9"},{"text":"we made, by only selling half of our shares.\nIf we would of sold all of our shares at the","start":"420.379","dur":"4.81"},{"text":"1.5 profit mark, we would of missed out on\na lot upside.","start":"425.189","dur":"2.671"},{"text":"You can also see the price went straight up\nright away, without forming a pullback. This","start":"427.86","dur":"1.04"},{"text":"is why I like to enter the trade right away,\nbecause most breakouts will go straight up,","start":"428.9","dur":"1"},{"text":"without forming a pullback.","start":"429.9","dur":"1"},{"text":"Let s see one more example.\nWe find some key points that are great levels","start":"430.9","dur":"2.099"},{"text":"to make a support and resistance. Once we\nset our trend lines, we wait for a momentum","start":"432.999","dur":"4.54"},{"text":"candle to break through our resistance.\nOne candle breaks, but it does not have a","start":"437.539","dur":"4.84"},{"text":"big body, so we wait for two more green candles.\nOnce we see the three candles, we enter the","start":"442.379","dur":"8.711"},{"text":"trade.\nWe then put our stop loss below the resistance","start":"451.09","dur":"3.319"},{"text":"line, and the set our take profit to a 1.5\nratio.","start":"454.409","dur":"3.72"},{"text":"We then wait for the price to hit our take\nprofit, then we sell half our shares.","start":"458.129","dur":"4.241"},{"text":"After we sold half of our shares, we move\nour stop loss to our old take profit mark,","start":"462.37","dur":"5.16"},{"text":"then we turn on the chandelier indicator.\nWe Then wait to sell the other half of our","start":"467.53","dur":"4.5"},{"text":"shares, until the chandelier indicator turns\ncolors. Once it does, we exit the trade.","start":"472.03","dur":"5.199"},{"text":"I just show you some secrets to make your\nbreak out trading that much better. All I","start":"477.229","dur":"5.341"},{"text":"ask in return, is if you take 2 seconds out\nof your day and like this video. If you want","start":"482.57","dur":"4.29"},{"text":"to see part 2 of this video, and make this\nstrategy even more profitable, check out this","start":"486.86","dur":"5.019"},{"text":"video.\nThanks for watching, and ill see you guys,","start":"491.879","dur":"2.831"},{"text":"next time.","start":"494.71","dur":"8.72"}]}],"isLive":false,"languages":[{"label":"English","languageCode":"en"}],"isLoginRequired":false,"playabilityStatus":{"status":"OK","playableInEmbed":true,"miniplayer":{"miniplayerRenderer":{"playbackMode":"PLAYBACK_MODE_ALLOW"}},"contextParams":"Q0FFU0FnZ0M="},"author":"TradingLab","channelId":"UCCbv0qixG-cyokxEY3kELtg","keywords":["technical analysis","price action trading","breakout","trading breakouts","breakout strategy","price action","day trading strategy","breakout trading strategy forex","breakout patterns technical analysis","how to find breakout stocks","forex breakout indicator","breakout trading explained","breakout patterns strategies","how to trade breakouts in forex","breakout strategy trading","breakout strategy for swing trading","breakout trading strategy","day trading strategies"]},{"text":"the algorithm. I started focusing on the algorithms a very long time ago. They're written by a programmer and they have to be written to go somewhere. Okay. And where are they written to go? These technical areas that we're putting out, those algorithms are going to that as short as we're having this conversation. There's no doubt they want to shake out the longs and they want to get people short. And what do the smart people do that are on the bottom of these algorithm that are scooping this stuff up? They're feeding into these people. That's what algorithms do. So, I'm able to take advantage of what they given me and keep printing the money, man. That's what we do. And we do it every day, hundreds of times. Did I spend too much time on that intro? Eh, probably. Hedge funds spend around on average $90,000 on training per analyst and training them on basic trading psychology. And once you realize how they look at the market and more specifically what they look for, you will instantly see your trading portfolio start to grow alongside with them. But what do they look for? You see, for every winner in the market, there's a loser. And for every loser in the market, there's a winner. It's basically a 1v one on Rust in Call of Duty, but just on a bigger scale. And if your trading strategy doesn't take advantage of you profiting from the loser, it's probably not a good strategy. So what is a strategy that takes advantage of you profiting from the people that are wrong? Price is rising, creating higher highs and higher lows time and time again. But what happens when that narrative suddenly shifts, lows get broken. The majority of traders would now see this break as the start of a structure shift. Meaning the majority of traders would see this move as a break of structure and the start of a reversal to the downside. and they would now expect to see price continue this downwards momentum and keep heading lower. But they're wrong. But how can you identify this happening before it even happens? In order to understand this technique, we first need to understand consolidating markets. Consolidation explained simply is just sideways price movement where price just stays in a range moving sideways without really any volatile moves. Now, the majority of people would tell you not to trade in consolidating markets. Hell, I even made a video on how to avoid consolidating markets. But the more I've learned as a trader, the more I've realized consolidating markets present the most opportunity. The reasoning behind that is liquidity. To understand liquidity, you can just think of it as areas with large open orders in the market. It's basically just an area where there are a lot of stop- losses and buy orders, or in other words, lots of money. Whenever you have consolidating sideways price action, it makes the liquidity points very, very obvious. There will naturally be a lot of stop- losses right here for people entering long trades. And there will naturally be a lot of stop- losses right here for people entering short trades. That's just a given. Now, one of the greatest lessons I've learned as a trader is in order to be successful at trading, you need to be entering where most people are exiting. That is because of this simple little trick. If price breaks these equal highs, that means a lot of people will now see this as the start of an uptrend and will enter a long trade here. So, they will most likely enter in a position like this, placing their takerit and putting their stop-loss either here or here. If price does a fake out, it'll hit all these trader stop losses that just entered for a long opportunity. And when it hits these trader stop- losses, it'll give price fuel to keep heading lower. So in essence, stop losses make the market move. So when trading, you basically want to try to trap buyers or sellers and use their stop- losses as fuel to drive price in the direction you are trading. The market's algorithm will naturally be drawn to highs and lows of this range because it's targeting liquidity. It's targeting orders. It's targeting money. And when price targets these highs and lows, this is where price will most likely reverse because of what I just taught you. So, if price ever breaks equal highs, you should be looking to short. If price ever breaks equal lows, you should be looking to enter long. One of my favorite quotes in trading is from the legendary David Paul. And then you write down on a piece of paper where you going to buy and where you're going to put your stop loss. Don't buy it, but put an order in to buy it at where you're going to put your stop-loss. And then just watch how many times the market goes to your order. You should be putting your entry where others are putting their stop-loss. If you do that, you will instantly see how often it works because you are taking advantage of the losers in the market, just like the algorithm is trying to do. To prove my point even more, here's a chart. You can see the market was trending, making higher highs and higher lows. Then all of a sudden, it dumps. Then price starts to consolidate with sideways price movement. This sideways price movement is the market trying to say this area is fair value for this particular asset at this very moment. So what we do is we mark the highs and lows of this range. Now the algorithm is going to try to push price outside this range to trigger stop losses and create liquidity. So what you do is pretty simple. When price breaks this range, you will look to trade in the opposite direction. So price breaks this upper end of the range. Now the thinking behind this is simple. As stated before, the market targets liquidity. There are two obvious points of liquidity for the market to target next. one right here and one right here. Now, since the market is consolidating here, it is way more likely that the algorithm will target the closer liquidity because it's a lot easier to get to. And on top of that, by the market consolidating here, it's saying this range is fair value at the moment for this specific asset. So, that's another reason why this bottom liquidity point is more likely to be targeted. So once price breaks this upper end of liquidity, you enter a short, target the next liquidity point, make some easy profits. But wait, we're not done. Price broke this lower liquidity point. So now we can target the upper liquidity point. We enter a long, set or take profit at the upper liquidity, easy profits. But wait, we're still not done. Price broke this upper liquidity point. We enter a short, targeting the lower liquidity, easy profits. But wait, we're still not done. Price broke this lower liquidity. We target the higher liquidity. Price hits it, easy profits. But wait, we're still not done. Price broke this upper liquidity, we target the lower liquidity, easy profits. That's the power of this strategy. The market will always target liquidity. And with consolidating price movement, it makes it very obvious on where that liquidity is. Now, sure, just because price breaks outside of a range, that doesn't necessarily mean it will always reverse and target liquidity in the opposite direction. Sometimes it breaks and just keeps heading in the same original direction. So, I'm not saying by any means liquidity should be your one and only signal to enter a trade. But what I am saying though is that your strategy should incorporate liquidity somehow. Because like I said before, you need to take advantage of the losers in the market to make money in the market. So to do that, incorporate liquidity. You can pair it with supply and demand, order flow, fair value gaps, indicators, whatever. But the algorithm is literally programmed to make the market move. And the best way to do that is to target liquidity and stop losses. So next time you look at your chart, think of the obvious place of where you'd place your stop-loss if you entered into the trade right now. And instead of placing your stop-loss there, place your entry there instead. And just look how often it works out in your favor.","id":"9REzGB3R6HU","microformat":{"playerMicroformatRenderer":{"category":"Education","description":{"simpleText":"Liquidity. Probably one of the most important topics to understand in trading.  Start placing your entry where you would place stop loss and just watch how many time price goes to your order. \n---------------------------------------------------------------------------------------------------------------\nðŸ“ˆ See all of my trades live (Entries/Exits): https://tradinglab.ai/premium/\n\nðŸ’¬ My Trading Discord: https://discord.gg/hNYJevxnUx\n\nðŸ”¥ My private Indicator: https://tradinglab.ai/ \n\nðŸ“Š TradingView (Chart Software I Use): https://www.tradingview.com/?offer_id=10&aff_id=28566\n\nðŸš€ Webull (Where I Trade Stocks): https://a.webull.com/i/TradingLab\n\nâš¡ ByBit (Where I Buy Crypto): https://partner.bybit.com/b/35525\n\nðŸ”´ Subscribe for more videos just like this: https://www.youtube.com/channel/UCCbv0qixG-cyokxEY3kELtg?sub_confirmation=1\n\nFollow TradingLab: \n===============================\nðŸ“¸ - IG: https://www.instagram.com/tradinglabofficial/?hl=en\nðŸ“± - TikTok: https://www.tiktok.com/@thetradinglab\n\n*None of this is meant to be construed as investment advice, it's for entertainment purposes only. The links above include affiliate commissions or referrals. I'm part of an affiliate network and I receive compensation from partnering websites. The video is accurate as of the posting date but may not be accurate in the future."},"externalChannelId":"UCCbv0qixG-cyokxEY3kELtg","lengthSeconds":"473","ownerChannelName":"TradingLab","publishDate":"2025-10-27","title":{"simpleText":"The Only Liquidity Guide You'll EVER NEED"}}},"isLive":false,"isLoginRequired":false,"languages":[{"label":"en","languageCode":"en"}],"playabilityStatus":{"status":"OK","reason":""},"title":"The Only Liquidity Guide You'll EVER NEED","tracks":[{"language":"en","transcript":[{"start":"2.159","dur":"1.52","text":"the algorithm."},{"start":"3.679","dur":"2.881","text":"I started focusing on the algorithms a"},{"start":"6.56","dur":"2.32","text":"very long time ago. They're written by a"},{"start":"8.88","dur":"1.52","text":"programmer and they have to be written"},{"start":"10.4","dur":"2","text":"to go somewhere. Okay. And where are"},{"start":"12.4","dur":"1.44","text":"they written to go? These technical"},{"start":"13.84","dur":"1.52","text":"areas that we're putting out, those"},{"start":"15.36","dur":"1.919","text":"algorithms are going to that as short as"},{"start":"17.279","dur":"1.76","text":"we're having this conversation. There's"},{"start":"19.039","dur":"2.801","text":"no doubt they want to shake out the"},{"start":"21.84","dur":"2","text":"longs and they want to get people short."},{"start":"23.84","dur":"2.08","text":"And what do the smart people do that are"},{"start":"25.92","dur":"1.519","text":"on the bottom of these algorithm that"},{"start":"27.439","dur":"1.6","text":"are scooping this stuff up? They're"},{"start":"29.039","dur":"1.681","text":"feeding into these people. That's what"},{"start":"30.72","dur":"1.999","text":"algorithms do. So, I'm able to take"},{"start":"32.719","dur":"2.721","text":"advantage of what they given me and keep"},{"start":"35.44","dur":"2.08","text":"printing the money, man. That's what we"},{"start":"37.52","dur":"3.76","text":"do. And we do it every day, hundreds of"},{"start":"41.28","dur":"2.64","text":"times."},{"start":"43.92","dur":"2","text":"Did I spend too much time on that intro?"},{"start":"45.92","dur":"2.56","text":"Eh, probably. Hedge funds spend around"},{"start":"48.48","dur":"3.52","text":"on average $90,000 on training per"},{"start":"52","dur":"2.64","text":"analyst and training them on basic"},{"start":"54.64","dur":"2.48","text":"trading psychology. And once you realize"},{"start":"57.12","dur":"2","text":"how they look at the market and more"},{"start":"59.12","dur":"2.239","text":"specifically what they look for, you"},{"start":"61.359","dur":"1.52","text":"will instantly see your trading"},{"start":"62.879","dur":"2.56","text":"portfolio start to grow alongside with"},{"start":"65.439","dur":"1.761","text":"them. But what do they look for? You"},{"start":"67.2","dur":"2","text":"see, for every winner in the market,"},{"start":"69.2","dur":"2.08","text":"there's a loser. And for every loser in"},{"start":"71.28","dur":"1.92","text":"the market, there's a winner. It's"},{"start":"73.2","dur":"2.239","text":"basically a 1v one on Rust in Call of"},{"start":"75.439","dur":"2.241","text":"Duty, but just on a bigger scale. And if"},{"start":"77.68","dur":"1.92","text":"your trading strategy doesn't take"},{"start":"79.6","dur":"2.08","text":"advantage of you profiting from the"},{"start":"81.68","dur":"2","text":"loser, it's probably not a good"},{"start":"83.68","dur":"2.799","text":"strategy. So what is a strategy that"},{"start":"86.479","dur":"2.32","text":"takes advantage of you profiting from"},{"start":"88.799","dur":"2.561","text":"the people that are wrong? Price is"},{"start":"91.36","dur":"2.399","text":"rising, creating higher highs and higher"},{"start":"93.759","dur":"2.801","text":"lows time and time again. But what"},{"start":"96.56","dur":"2.239","text":"happens when that narrative suddenly"},{"start":"98.799","dur":"2.64","text":"shifts, lows get broken. The majority of"},{"start":"101.439","dur":"2.32","text":"traders would now see this break as the"},{"start":"103.759","dur":"1.921","text":"start of a structure shift. Meaning the"},{"start":"105.68","dur":"2","text":"majority of traders would see this move"},{"start":"107.68","dur":"2.16","text":"as a break of structure and the start of"},{"start":"109.84","dur":"2.48","text":"a reversal to the downside. and they"},{"start":"112.32","dur":"2.079","text":"would now expect to see price continue"},{"start":"114.399","dur":"2.241","text":"this downwards momentum and keep heading"},{"start":"116.64","dur":"2.4","text":"lower. But they're wrong. But how can"},{"start":"119.04","dur":"2.719","text":"you identify this happening before it"},{"start":"121.759","dur":"2.241","text":"even happens? In order to understand"},{"start":"124","dur":"1.68","text":"this technique, we first need to"},{"start":"125.68","dur":"1.92","text":"understand consolidating markets."},{"start":"127.6","dur":"2.32","text":"Consolidation explained simply is just"},{"start":"129.92","dur":"2.16","text":"sideways price movement where price just"},{"start":"132.08","dur":"2.48","text":"stays in a range moving sideways without"},{"start":"134.56","dur":"2.24","text":"really any volatile moves. Now, the"},{"start":"136.8","dur":"1.92","text":"majority of people would tell you not to"},{"start":"138.72","dur":"2.48","text":"trade in consolidating markets. Hell, I"},{"start":"141.2","dur":"2.16","text":"even made a video on how to avoid"},{"start":"143.36","dur":"1.84","text":"consolidating markets. But the more I've"},{"start":"145.2","dur":"1.6","text":"learned as a trader, the more I've"},{"start":"146.8","dur":"2.24","text":"realized consolidating markets present"},{"start":"149.04","dur":"1.919","text":"the most opportunity. The reasoning"},{"start":"150.959","dur":"2.801","text":"behind that is liquidity. To understand"},{"start":"153.76","dur":"2","text":"liquidity, you can just think of it as"},{"start":"155.76","dur":"2.32","text":"areas with large open orders in the"},{"start":"158.08","dur":"1.76","text":"market. It's basically just an area"},{"start":"159.84","dur":"1.6","text":"where there are a lot of stop- losses"},{"start":"161.44","dur":"2.72","text":"and buy orders, or in other words, lots"},{"start":"164.16","dur":"1.6","text":"of money. Whenever you have"},{"start":"165.76","dur":"2.479","text":"consolidating sideways price action, it"},{"start":"168.239","dur":"2.881","text":"makes the liquidity points very, very"},{"start":"171.12","dur":"2.24","text":"obvious. There will naturally be a lot"},{"start":"173.36","dur":"2.239","text":"of stop- losses right here for people"},{"start":"175.599","dur":"1.601","text":"entering long trades. And there will"},{"start":"177.2","dur":"1.92","text":"naturally be a lot of stop- losses right"},{"start":"179.12","dur":"2.32","text":"here for people entering short trades."},{"start":"181.44","dur":"1.68","text":"That's just a given. Now, one of the"},{"start":"183.12","dur":"1.68","text":"greatest lessons I've learned as a"},{"start":"184.8","dur":"2.4","text":"trader is in order to be successful at"},{"start":"187.2","dur":"2.16","text":"trading, you need to be entering where"},{"start":"189.36","dur":"2.08","text":"most people are exiting. That is because"},{"start":"191.44","dur":"2.4","text":"of this simple little trick. If price"},{"start":"193.84","dur":"2.24","text":"breaks these equal highs, that means a"},{"start":"196.08","dur":"2.079","text":"lot of people will now see this as the"},{"start":"198.159","dur":"2","text":"start of an uptrend and will enter a"},{"start":"200.159","dur":"1.841","text":"long trade here. So, they will most"},{"start":"202","dur":"2.4","text":"likely enter in a position like this,"},{"start":"204.4","dur":"2","text":"placing their takerit and putting their"},{"start":"206.4","dur":"2.88","text":"stop-loss either here or here. If price"},{"start":"209.28","dur":"2.08","text":"does a fake out, it'll hit all these"},{"start":"211.36","dur":"2.4","text":"trader stop losses that just entered for"},{"start":"213.76","dur":"1.839","text":"a long opportunity. And when it hits"},{"start":"215.599","dur":"2","text":"these trader stop- losses, it'll give"},{"start":"217.599","dur":"3.041","text":"price fuel to keep heading lower. So in"},{"start":"220.64","dur":"2.48","text":"essence, stop losses make the market"},{"start":"223.12","dur":"2.399","text":"move. So when trading, you basically"},{"start":"225.519","dur":"2.561","text":"want to try to trap buyers or sellers"},{"start":"228.08","dur":"2.64","text":"and use their stop- losses as fuel to"},{"start":"230.72","dur":"1.92","text":"drive price in the direction you are"},{"start":"232.64","dur":"1.92","text":"trading. The market's algorithm will"},{"start":"234.56","dur":"2.48","text":"naturally be drawn to highs and lows of"},{"start":"237.04","dur":"2.08","text":"this range because it's targeting"},{"start":"239.12","dur":"2.56","text":"liquidity. It's targeting orders. It's"},{"start":"241.68","dur":"1.919","text":"targeting money. And when price targets"},{"start":"243.599","dur":"1.84","text":"these highs and lows, this is where"},{"start":"245.439","dur":"2.241","text":"price will most likely reverse because"},{"start":"247.68","dur":"2.4","text":"of what I just taught you. So, if price"},{"start":"250.08","dur":"2.159","text":"ever breaks equal highs, you should be"},{"start":"252.239","dur":"2","text":"looking to short. If price ever breaks"},{"start":"254.239","dur":"2.081","text":"equal lows, you should be looking to"},{"start":"256.32","dur":"1.919","text":"enter long. One of my favorite quotes in"},{"start":"258.239","dur":"2.161","text":"trading is from the legendary David"},{"start":"260.4","dur":"0.48","text":"Paul."},{"start":"260.88","dur":"1.28","text":"And then you write down on a piece of"},{"start":"262.16","dur":"1.599","text":"paper where you going to buy and where"},{"start":"263.759","dur":"1.44","text":"you're going to put your stop loss."},{"start":"265.199","dur":"3.921","text":"Don't buy it, but put an order in to buy"},{"start":"269.12","dur":"1.6","text":"it at where you're going to put your"},{"start":"270.72","dur":"2","text":"stop-loss. And then just watch how many"},{"start":"272.72","dur":"2.32","text":"times the market goes to your order."},{"start":"275.04","dur":"1.92","text":"You should be putting your entry where"},{"start":"276.96","dur":"2.08","text":"others are putting their stop-loss. If"},{"start":"279.04","dur":"2.48","text":"you do that, you will instantly see how"},{"start":"281.52","dur":"1.84","text":"often it works because you are taking"},{"start":"283.36","dur":"2.48","text":"advantage of the losers in the market,"},{"start":"285.84","dur":"1.919","text":"just like the algorithm is trying to do."},{"start":"287.759","dur":"2","text":"To prove my point even more, here's a"},{"start":"289.759","dur":"1.44","text":"chart. You can see the market was"},{"start":"291.199","dur":"2.081","text":"trending, making higher highs and higher"},{"start":"293.28","dur":"2.479","text":"lows. Then all of a sudden, it dumps."},{"start":"295.759","dur":"2.081","text":"Then price starts to consolidate with"},{"start":"297.84","dur":"2.24","text":"sideways price movement. This sideways"},{"start":"300.08","dur":"2.08","text":"price movement is the market trying to"},{"start":"302.16","dur":"3.039","text":"say this area is fair value for this"},{"start":"305.199","dur":"2.801","text":"particular asset at this very moment. So"},{"start":"308","dur":"2.72","text":"what we do is we mark the highs and lows"},{"start":"310.72","dur":"2.319","text":"of this range. Now the algorithm is"},{"start":"313.039","dur":"2.321","text":"going to try to push price outside this"},{"start":"315.36","dur":"3.119","text":"range to trigger stop losses and create"},{"start":"318.479","dur":"2.16","text":"liquidity. So what you do is pretty"},{"start":"320.639","dur":"2.081","text":"simple. When price breaks this range,"},{"start":"322.72","dur":"1.919","text":"you will look to trade in the opposite"},{"start":"324.639","dur":"1.921","text":"direction. So price breaks this upper"},{"start":"326.56","dur":"1.44","text":"end of the range. Now the thinking"},{"start":"328","dur":"2.16","text":"behind this is simple. As stated before,"},{"start":"330.16","dur":"2.08","text":"the market targets liquidity. There are"},{"start":"332.24","dur":"2.32","text":"two obvious points of liquidity for the"},{"start":"334.56","dur":"2.56","text":"market to target next. one right here"},{"start":"337.12","dur":"2.079","text":"and one right here. Now, since the"},{"start":"339.199","dur":"2.401","text":"market is consolidating here, it is way"},{"start":"341.6","dur":"2.159","text":"more likely that the algorithm will"},{"start":"343.759","dur":"2.16","text":"target the closer liquidity because it's"},{"start":"345.919","dur":"2","text":"a lot easier to get to. And on top of"},{"start":"347.919","dur":"2.081","text":"that, by the market consolidating here,"},{"start":"350","dur":"2.639","text":"it's saying this range is fair value at"},{"start":"352.639","dur":"2.4","text":"the moment for this specific asset. So,"},{"start":"355.039","dur":"2","text":"that's another reason why this bottom"},{"start":"357.039","dur":"2","text":"liquidity point is more likely to be"},{"start":"359.039","dur":"1.921","text":"targeted. So once price breaks this"},{"start":"360.96","dur":"1.84","text":"upper end of liquidity, you enter a"},{"start":"362.8","dur":"1.92","text":"short, target the next liquidity point,"},{"start":"364.72","dur":"2.24","text":"make some easy profits. But wait, we're"},{"start":"366.96","dur":"1.679","text":"not done. Price broke this lower"},{"start":"368.639","dur":"1.84","text":"liquidity point. So now we can target"},{"start":"370.479","dur":"2.16","text":"the upper liquidity point. We enter a"},{"start":"372.639","dur":"1.921","text":"long, set or take profit at the upper"},{"start":"374.56","dur":"2.56","text":"liquidity, easy profits. But wait, we're"},{"start":"377.12","dur":"2","text":"still not done. Price broke this upper"},{"start":"379.12","dur":"1.76","text":"liquidity point. We enter a short,"},{"start":"380.88","dur":"1.92","text":"targeting the lower liquidity, easy"},{"start":"382.8","dur":"2.399","text":"profits. But wait, we're still not done."},{"start":"385.199","dur":"2.161","text":"Price broke this lower liquidity. We"},{"start":"387.36","dur":"1.839","text":"target the higher liquidity. Price hits"},{"start":"389.199","dur":"3.12","text":"it, easy profits. But wait, we're still"},{"start":"392.319","dur":"2.081","text":"not done. Price broke this upper"},{"start":"394.4","dur":"1.76","text":"liquidity, we target the lower"},{"start":"396.16","dur":"2.4","text":"liquidity, easy profits. That's the"},{"start":"398.56","dur":"1.84","text":"power of this strategy. The market will"},{"start":"400.4","dur":"2.16","text":"always target liquidity. And with"},{"start":"402.56","dur":"1.919","text":"consolidating price movement, it makes"},{"start":"404.479","dur":"2.56","text":"it very obvious on where that liquidity"},{"start":"407.039","dur":"2.72","text":"is. Now, sure, just because price breaks"},{"start":"409.759","dur":"2","text":"outside of a range, that doesn't"},{"start":"411.759","dur":"2.401","text":"necessarily mean it will always reverse"},{"start":"414.16","dur":"2.24","text":"and target liquidity in the opposite"},{"start":"416.4","dur":"2.32","text":"direction. Sometimes it breaks and just"},{"start":"418.72","dur":"1.919","text":"keeps heading in the same original"},{"start":"420.639","dur":"2","text":"direction. So, I'm not saying by any"},{"start":"422.639","dur":"2.161","text":"means liquidity should be your one and"},{"start":"424.8","dur":"2.72","text":"only signal to enter a trade. But what I"},{"start":"427.52","dur":"2.079","text":"am saying though is that your strategy"},{"start":"429.599","dur":"2.561","text":"should incorporate liquidity somehow."},{"start":"432.16","dur":"2.64","text":"Because like I said before, you need to"},{"start":"434.8","dur":"1.839","text":"take advantage of the losers in the"},{"start":"436.639","dur":"2.161","text":"market to make money in the market. So"},{"start":"438.8","dur":"2.399","text":"to do that, incorporate liquidity. You"},{"start":"441.199","dur":"1.681","text":"can pair it with supply and demand,"},{"start":"442.88","dur":"2.96","text":"order flow, fair value gaps, indicators,"},{"start":"445.84","dur":"2.56","text":"whatever. But the algorithm is literally"},{"start":"448.4","dur":"2.48","text":"programmed to make the market move. And"},{"start":"450.88","dur":"2.4","text":"the best way to do that is to target"},{"start":"453.28","dur":"3.12","text":"liquidity and stop losses. So next time"},{"start":"456.4","dur":"1.6","text":"you look at your chart, think of the"},{"start":"458","dur":"1.919","text":"obvious place of where you'd place your"},{"start":"459.919","dur":"2.4","text":"stop-loss if you entered into the trade"},{"start":"462.319","dur":"2.241","text":"right now. And instead of placing your"},{"start":"464.56","dur":"2.4","text":"stop-loss there, place your entry there"},{"start":"466.96","dur":"2.56","text":"instead. And just look how often it"},{"start":"469.52","dur":"4.28","text":"works out in your favor."}]}]},{"text":"this is a candlestick and if formed in a specific formation it can tell you a story of what the market is planning to do next but what if I told you everything you know about candlestick patterns is a lie hammers dogeis engulfing candles all of it none of this will work unless you pair it with this secret trick you see most retail traders treat candlestick patterns like cheat codes they grab their little candlestick pattern mouse pads that they bought on Amazon and blindly look at trades with the same chart pattern and while yes candlestick patterns can be used for predicting price a lot of people use them completely wrong they see a bullish engulfing candle and they think \"Great what a great time to buy.\" But then the price tanks but what if I told you there's a strategy you can execute in order to know when this was about to happen every candle you see is one of these three types of candles: Indecision candles control shift candles and strength candles let's start with the most powerful one the strength candle these candles have large bodies and small wicks this is a strength candle and shows that buyers or sellers are in complete control at this time but this candle can get even stronger oh my god if a strength candle is printed with a large body and no upper wick for a bullish candle this is an extremely strong candle as it's showing that buyers had absolutely no resistance from sellers at this point it's the exact opposite for bearish candles if the candle has a large red body with no lower wick that shows sellers had no resistance from buyers at this point now these candles are pretty rare in the market but if seen it shows extreme buyer or seller control but just like most things in life size matters for example you could get this strength candle in different sizes here we have four examples and all of these examples are strength candles with uninterrupted buying but the largest strength candle is the strongest and the best indication that buyers are in control even though candle number four is still a strength candle it's a lot weaker indication than candle number one large strength candles show massive buying small strength candles show less aggressive buying but what happens when that control suddenly shifts that brings us to candle number two this candle shows who's losing the battle and who's about to take over these are also called control shift or reversal candle candle wicks show rejected price action so if you have a large upper wick that shows buyers tried to move the price up but got rejected and sellers took over and brought the price down these control shift candles have long wicks with small body for this candle the body of the candle is pretty irrelevant it doesn't matter if the candle's green or red what tells you the real story is the wick so oftent times these candles can show reversal points with candles showing large lower wicks we can expect price to move up if we see candles showing large upper wicks we can expect price to move down now when no one's in charge the candle looks very different that brings us to candle number three this candle means no one's in control an indecision candle looks like this they have wicks on both sides with small bodies they show equal effort from both buyers and sellers but no real progress now there's a lot of different ways this can look it could look like this this this or this all of these are indecision candles main thing you have to remember is there's a small body with equal wicks on either side people often call these dogeis but these candles usually appear before major breakouts or reversals because the market is trying to decide what it wants to do next but hasn't completely decided on which way it wants to go yet you should never trade purely based off these candles because this candle doesn't tell us who's in control but when paired with this next candle that completely changes everything for example if an indecision candle is printed but then directly after a control shift candle is printed this shows us that buyers have won in the indecision battle and we can wait for price to do a pullback to this indecision candle and enter here you can also use it as a clear reversal point for example price drops strong down to this area of demand but right when it reaches it some indecision candles showed up showing that price is hesitating and if paired with a strength candle it can show buyers are starting to step in but all of this began with the indecision candle showing signs of slowing down the sellers so let's put all we've learned to the test and do a real life chart example but before we get into that let me show you something i found a new broker afx.com and this is no ordinary broker they offer forex stocks and crypto yes a three for one so no matter what silly little thing you trade they have it best part is they have 0% commissions yes you heard me right 0% commissions for all of your trades so unlike most brokers where you have to pay fees for every single trade you take i mean really sit down and think about it if you're taking hundreds of trades those fees can really add up to where you're paying hundreds if not thousands of dollars on here it's absolutely free plus they're available in 176 different countries and fully regulated if you want to try them out use the link in my description and you will get unlimited 0% commissions if you use my link you're welcome now let's take all three candle types and drop them into a real trading example so here we have some price action forming we started with a slight downtrend but if you look closely something very interesting is happening during this downtrend we got three indecision candles showing price is hesitating at this price and doesn't know whether it wants to go up or down from here one key thing to note though is that this red candle has a large lower width meaning sellers tried to get the price lower but buyers stepped in and brought the price back up which means buyers are showing interest at this price level after this price prints a strength candle showing buyers are showing massive interest now so we can expect price to start heading upwards from here price does exactly as we expect and does a sharp upwards move printing multiple strength candles another key thing to note if you take a close look it took a while for sellers to get the price down to here but when the buyers stepped in they erased all of that work that the sellers did within a couple of candles so in essence it took sellers 22 candles to get down to this point while the buyers did the same amount of work within four candles so that's very important to understand so knowing that buyers are showing more strength we can expect the buyers to continue this control and keep moving the price upward which is exactly what happened since price started a strong upwards move from this point we can call this area our area of demand we can mark this area of demand by marking the low of the candle that started that move to the high of that same candle this is our area of demand and shows buyers are starting to get interested once price reaches this area so we'll also keep that in mind for later the price ends up moving up a bit more and then this candle gets printed a red control shift candle with a large upper wick this is saying buyers try to raise the price higher but sellers came in and brought the price back down showing sellers have control up here directly after that we have a red strength candle meaning sellers are confident at this price and are ready to bring the price back down which is exactly what happens now that we have a strong move to the downside we can mark our area of supply to do this we find the start of a strong move downwards and mark the low to the high of the candle that started this move this is our area of supply and shows that sellers started to take control once price reaches this area so we'll also keep that in mind for later price continues to move down a bit from here so now we have this setup and this chart is telling a very clear and interesting story first look at the speed the buyers got the price up they got the price up extremely quick and within only a couple of candles while the sellers still got the price back down but the move is much slower and took them a lot of candles to get the price back down so right off the rip we can see the buyers have more control during this time another key thing to note price has just hit our area of demand which like I said before a massive amount of buyers stepped into this area before and we can expect them to do the same thing here another key point is while touching this area of demand a green control shift candle was printed meaning sellers tried to drive the price down below our area of demand but just like before buyers stepped in by the masses and took control and drove the price back up not only that but after this control shift candle was printed a green strength candle was printed directly after showing even more signs of buyer momentum so now it's pretty clear that buyers have complete control so now we have to take advantage of this and find a place to enter to do this we're going to wait for price to come back down to our control shift candle which is exactly what happened not only that it printed another control shift candle which is another great sign we enter once price hits our control shift candle set our takerit at the area of supply where sellers started to take control then set our stop-loss right below our original area of demand with this setup there's no guessing we have analyzed the chart and found areas where buyers and sellers have complete control and just like that price hits our takerit just like we expected but with all that said there's a key thing you should understand you should never enter purely based on a candle for example you shouldn't enter purely just because you see a green strength candle that will not work in the long run instead use these candles as like a book telling a story you need to find multiple correlations and find areas where buyers and sellers show complete control based off their candlestick once you find that you can easily identify the zones where buyers are likely to win and where sellers are likely to win implement this in your trading and you will instantly see your take-profits getting hit way more often","id":"wIeYqqXcgtU","microformat":{"playerMicroformatRenderer":{"category":"Education","description":{"simpleText":"Want to learn how to start day trading as a beginner? You're in the right place. ðŸ“ˆ See all of my trades live (Entries/Exits): https://tradinglab.ai/premium/\n\nCandlesticks...if formed in a specific formation, it can tell you a story of what the market is planning to do next. But what if I told you... Everything you know about candlestick patterns is a lie. Hammer. Doji. Engulfing candle. All of it. None of this will work.. unless you pair it with this secret trick\n\nIf you learned something new, leave a like!\n\nAAAfx (0% commissions if you use this link): https://my.aaafx.com/register?refLink=MTQ0Nw==&refRm=MjM=\n------------------------------------------------------------------------------------------------------------\nðŸ“ˆ See all of my trades live (Entries/Exits): https://tradinglab.ai/premium/\n\nâœ‰ï¸ Email Newsletter (Free Market Analysis): https://tradinglab.beehiiv.com/subscribe\n\nðŸ’µ Hankotrade (Copytrading): https://login.hankotrade.com/register?franchiseLead=MjQxNg==\n\nðŸ’¬ My Trading Discord: https://discord.gg/hNYJevxnUx\n\nðŸ”¥ My private Indicator: https://tradinglab.ai/ \n\nðŸš€ Webull (Where I Trade Stocks): https://a.webull.com/i/TradingLab\n\nâš¡ Bybit (Where I Buy Crypto) Up To $30,000 in Rewards: https://partner.bybit.com/b/TradingLab\n\nðŸ“Š TradingView (Chart Software I Use): https://www.tradingview.com/?offer_id=10&aff_id=28566\n\nðŸ”´ Subscribe for more videos just like this: https://www.youtube.com/channel/UCCbv0qixG-cyokxEY3kELtg?sub_confirmation=1\n\nFollow TradingLab: \n===============================\nðŸ“¸ - IG: https://www.instagram.com/tradinglabofficial/?hl=en\nðŸ“± - TikTok: https://www.tiktok.com/@thetradinglab\n\n*None of this is meant to be construed as investment advice, it's for entertainment purposes only. The links above include affiliate commissions or referrals. I'm part of an affiliate network and I receive compensation from partnering websites. The video is accurate as of the posting date but may not be accurate in the future."},"externalChannelId":"UCCbv0qixG-cyokxEY3kELtg","lengthSeconds":"581","ownerChannelName":"TradingLab","publishDate":"2025-05-05","title":{"simpleText":"Candlestick Patterns Don't Work (Unless You Do This)"}}},"isLive":false,"isLoginRequired":false,"languages":[{"label":"en","languageCode":"en"}],"playabilityStatus":{"status":"OK","reason":""},"title":"Candlestick Patterns Don't Work (Unless You Do This)","tracks":[{"language":"en","transcript":[{"start":"0.24","dur":"2.48","text":"this is a candlestick and if formed in a"},{"start":"2.72","dur":"2.079","text":"specific formation it can tell you a"},{"start":"4.799","dur":"2.161","text":"story of what the market is planning to"},{"start":"6.96","dur":"2.08","text":"do next but what if I told you"},{"start":"9.04","dur":"1.76","text":"everything you know about candlestick"},{"start":"10.8","dur":"2.719","text":"patterns is a lie hammers dogeis"},{"start":"13.519","dur":"2.401","text":"engulfing candles all of it none of this"},{"start":"15.92","dur":"2.08","text":"will work unless you pair it with this"},{"start":"18","dur":"2.32","text":"secret trick you see most retail traders"},{"start":"20.32","dur":"1.92","text":"treat candlestick patterns like cheat"},{"start":"22.24","dur":"1.76","text":"codes they grab their little candlestick"},{"start":"24","dur":"1.68","text":"pattern mouse pads that they bought on"},{"start":"25.68","dur":"2.08","text":"Amazon and blindly look at trades with"},{"start":"27.76","dur":"1.839","text":"the same chart pattern and while yes"},{"start":"29.599","dur":"1.52","text":"candlestick patterns can be used for"},{"start":"31.119","dur":"2.161","text":"predicting price a lot of people use"},{"start":"33.28","dur":"2","text":"them completely wrong they see a bullish"},{"start":"35.28","dur":"2.24","text":"engulfing candle and they think \"Great"},{"start":"37.52","dur":"2.08","text":"what a great time to buy.\" But then the"},{"start":"39.6","dur":"2","text":"price tanks but what if I told you"},{"start":"41.6","dur":"2.16","text":"there's a strategy you can execute in"},{"start":"43.76","dur":"1.76","text":"order to know when this was about to"},{"start":"45.52","dur":"2.16","text":"happen every candle you see is one of"},{"start":"47.68","dur":"2.08","text":"these three types of candles: Indecision"},{"start":"49.76","dur":"2.16","text":"candles control shift candles and"},{"start":"51.92","dur":"1.76","text":"strength candles let's start with the"},{"start":"53.68","dur":"2.24","text":"most powerful one the strength candle"},{"start":"55.92","dur":"1.84","text":"these candles have large bodies and"},{"start":"57.76","dur":"2.319","text":"small wicks this is a strength candle"},{"start":"60.079","dur":"2.401","text":"and shows that buyers or sellers are in"},{"start":"62.48","dur":"2.48","text":"complete control at this time but this"},{"start":"64.96","dur":"3.68","text":"candle can get even stronger oh my god"},{"start":"68.64","dur":"1.92","text":"if a strength candle is printed with a"},{"start":"70.56","dur":"2.239","text":"large body and no upper wick for a"},{"start":"72.799","dur":"2.081","text":"bullish candle this is an extremely"},{"start":"74.88","dur":"1.84","text":"strong candle as it's showing that"},{"start":"76.72","dur":"2.48","text":"buyers had absolutely no resistance from"},{"start":"79.2","dur":"2.08","text":"sellers at this point it's the exact"},{"start":"81.28","dur":"1.839","text":"opposite for bearish candles if the"},{"start":"83.119","dur":"2","text":"candle has a large red body with no"},{"start":"85.119","dur":"2.481","text":"lower wick that shows sellers had no"},{"start":"87.6","dur":"2.48","text":"resistance from buyers at this point now"},{"start":"90.08","dur":"1.44","text":"these candles are pretty rare in the"},{"start":"91.52","dur":"2.4","text":"market but if seen it shows extreme"},{"start":"93.92","dur":"2.08","text":"buyer or seller control but just like"},{"start":"96","dur":"2","text":"most things in life size matters for"},{"start":"98","dur":"1.68","text":"example you could get this strength"},{"start":"99.68","dur":"1.92","text":"candle in different sizes here we have"},{"start":"101.6","dur":"2.159","text":"four examples and all of these examples"},{"start":"103.759","dur":"2.4","text":"are strength candles with uninterrupted"},{"start":"106.159","dur":"1.841","text":"buying but the largest strength candle"},{"start":"108","dur":"2.399","text":"is the strongest and the best indication"},{"start":"110.399","dur":"2.241","text":"that buyers are in control even though"},{"start":"112.64","dur":"2.08","text":"candle number four is still a strength"},{"start":"114.72","dur":"2.399","text":"candle it's a lot weaker indication than"},{"start":"117.119","dur":"2.161","text":"candle number one large strength candles"},{"start":"119.28","dur":"1.92","text":"show massive buying small strength"},{"start":"121.2","dur":"2","text":"candles show less aggressive buying but"},{"start":"123.2","dur":"2","text":"what happens when that control suddenly"},{"start":"125.2","dur":"2","text":"shifts that brings us to candle number"},{"start":"127.2","dur":"2","text":"two this candle shows who's losing the"},{"start":"129.2","dur":"2.24","text":"battle and who's about to take over"},{"start":"131.44","dur":"2.08","text":"these are also called control shift or"},{"start":"133.52","dur":"1.84","text":"reversal candle candle wicks show"},{"start":"135.36","dur":"2","text":"rejected price action so if you have a"},{"start":"137.36","dur":"2.08","text":"large upper wick that shows buyers tried"},{"start":"139.44","dur":"1.92","text":"to move the price up but got rejected"},{"start":"141.36","dur":"2.16","text":"and sellers took over and brought the"},{"start":"143.52","dur":"2.24","text":"price down these control shift candles"},{"start":"145.76","dur":"2.4","text":"have long wicks with small body for this"},{"start":"148.16","dur":"2.159","text":"candle the body of the candle is pretty"},{"start":"150.319","dur":"1.601","text":"irrelevant it doesn't matter if the"},{"start":"151.92","dur":"2.399","text":"candle's green or red what tells you the"},{"start":"154.319","dur":"2.481","text":"real story is the wick so oftent times"},{"start":"156.8","dur":"2.079","text":"these candles can show reversal points"},{"start":"158.879","dur":"2.08","text":"with candles showing large lower wicks"},{"start":"160.959","dur":"2.161","text":"we can expect price to move up if we see"},{"start":"163.12","dur":"2.24","text":"candles showing large upper wicks we can"},{"start":"165.36","dur":"2.239","text":"expect price to move down now when no"},{"start":"167.599","dur":"2","text":"one's in charge the candle looks very"},{"start":"169.599","dur":"1.92","text":"different that brings us to candle"},{"start":"171.519","dur":"2.041","text":"number"},{"start":"173.56","dur":"2.92","text":"three this candle means no one's in"},{"start":"176.48","dur":"2.32","text":"control an indecision candle looks like"},{"start":"178.8","dur":"2.24","text":"this they have wicks on both sides with"},{"start":"181.04","dur":"2.559","text":"small bodies they show equal effort from"},{"start":"183.599","dur":"2.56","text":"both buyers and sellers but no real"},{"start":"186.159","dur":"1.521","text":"progress now there's a lot of different"},{"start":"187.68","dur":"1.839","text":"ways this can look it could look like"},{"start":"189.519","dur":"3.36","text":"this this this or this all of these are"},{"start":"192.879","dur":"1.681","text":"indecision candles main thing you have"},{"start":"194.56","dur":"2.16","text":"to remember is there's a small body with"},{"start":"196.72","dur":"2.48","text":"equal wicks on either side people often"},{"start":"199.2","dur":"1.759","text":"call these dogeis but these candles"},{"start":"200.959","dur":"2.56","text":"usually appear before major breakouts or"},{"start":"203.519","dur":"2","text":"reversals because the market is trying"},{"start":"205.519","dur":"2.321","text":"to decide what it wants to do next but"},{"start":"207.84","dur":"2.16","text":"hasn't completely decided on which way"},{"start":"210","dur":"1.599","text":"it wants to go yet you should never"},{"start":"211.599","dur":"2.081","text":"trade purely based off these candles"},{"start":"213.68","dur":"1.839","text":"because this candle doesn't tell us"},{"start":"215.519","dur":"2.08","text":"who's in control but when paired with"},{"start":"217.599","dur":"2.401","text":"this next candle that completely changes"},{"start":"220","dur":"2.4","text":"everything for example if an indecision"},{"start":"222.4","dur":"2","text":"candle is printed but then directly"},{"start":"224.4","dur":"2.399","text":"after a control shift candle is printed"},{"start":"226.799","dur":"2.321","text":"this shows us that buyers have won in"},{"start":"229.12","dur":"1.92","text":"the indecision battle and we can wait"},{"start":"231.04","dur":"1.919","text":"for price to do a pullback to this"},{"start":"232.959","dur":"2.64","text":"indecision candle and enter here you can"},{"start":"235.599","dur":"2.241","text":"also use it as a clear reversal point"},{"start":"237.84","dur":"2.08","text":"for example price drops strong down to"},{"start":"239.92","dur":"1.92","text":"this area of demand but right when it"},{"start":"241.84","dur":"1.92","text":"reaches it some indecision candles"},{"start":"243.76","dur":"1.679","text":"showed up showing that price is"},{"start":"245.439","dur":"2.08","text":"hesitating and if paired with a strength"},{"start":"247.519","dur":"2.241","text":"candle it can show buyers are starting"},{"start":"249.76","dur":"2.24","text":"to step in but all of this began with"},{"start":"252","dur":"2.4","text":"the indecision candle showing signs of"},{"start":"254.4","dur":"2.559","text":"slowing down the sellers so let's put"},{"start":"256.959","dur":"2.321","text":"all we've learned to the test and do a"},{"start":"259.28","dur":"2","text":"real life chart example but before we"},{"start":"261.28","dur":"1.6","text":"get into that let me show you something"},{"start":"262.88","dur":"2.2","text":"i found a new broker"},{"start":"265.08","dur":"3.24","text":"afx.com and this is no ordinary broker"},{"start":"268.32","dur":"3.2","text":"they offer forex stocks and crypto yes a"},{"start":"271.52","dur":"2.08","text":"three for one so no matter what silly"},{"start":"273.6","dur":"2.319","text":"little thing you trade they have it best"},{"start":"275.919","dur":"2.961","text":"part is they have 0% commissions yes you"},{"start":"278.88","dur":"3.44","text":"heard me right 0% commissions for all of"},{"start":"282.32","dur":"2.24","text":"your trades so unlike most brokers where"},{"start":"284.56","dur":"1.919","text":"you have to pay fees for every single"},{"start":"286.479","dur":"2.081","text":"trade you take i mean really sit down"},{"start":"288.56","dur":"1.44","text":"and think about it if you're taking"},{"start":"290","dur":"2.479","text":"hundreds of trades those fees can really"},{"start":"292.479","dur":"1.921","text":"add up to where you're paying hundreds"},{"start":"294.4","dur":"2.799","text":"if not thousands of dollars on here it's"},{"start":"297.199","dur":"2","text":"absolutely free plus they're available"},{"start":"299.199","dur":"3.121","text":"in 176 different countries and fully"},{"start":"302.32","dur":"1.68","text":"regulated if you want to try them out"},{"start":"304","dur":"1.68","text":"use the link in my description and you"},{"start":"305.68","dur":"2.72","text":"will get unlimited 0% commissions if you"},{"start":"308.4","dur":"2.4","text":"use my link you're welcome now let's"},{"start":"310.8","dur":"1.839","text":"take all three candle types and drop"},{"start":"312.639","dur":"2.481","text":"them into a real trading example so here"},{"start":"315.12","dur":"1.76","text":"we have some price action forming we"},{"start":"316.88","dur":"1.92","text":"started with a slight downtrend but if"},{"start":"318.8","dur":"2","text":"you look closely something very"},{"start":"320.8","dur":"1.6","text":"interesting is happening during this"},{"start":"322.4","dur":"1.84","text":"downtrend we got three indecision"},{"start":"324.24","dur":"2.48","text":"candles showing price is hesitating at"},{"start":"326.72","dur":"1.919","text":"this price and doesn't know whether it"},{"start":"328.639","dur":"2.56","text":"wants to go up or down from here one key"},{"start":"331.199","dur":"1.681","text":"thing to note though is that this red"},{"start":"332.88","dur":"2.159","text":"candle has a large lower width meaning"},{"start":"335.039","dur":"2.241","text":"sellers tried to get the price lower but"},{"start":"337.28","dur":"2.08","text":"buyers stepped in and brought the price"},{"start":"339.36","dur":"2.399","text":"back up which means buyers are showing"},{"start":"341.759","dur":"2.081","text":"interest at this price level after this"},{"start":"343.84","dur":"2","text":"price prints a strength candle showing"},{"start":"345.84","dur":"2.079","text":"buyers are showing massive interest now"},{"start":"347.919","dur":"2","text":"so we can expect price to start heading"},{"start":"349.919","dur":"1.921","text":"upwards from here price does exactly as"},{"start":"351.84","dur":"2.4","text":"we expect and does a sharp upwards move"},{"start":"354.24","dur":"1.84","text":"printing multiple strength candles"},{"start":"356.08","dur":"1.76","text":"another key thing to note if you take a"},{"start":"357.84","dur":"1.919","text":"close look it took a while for sellers"},{"start":"359.759","dur":"1.761","text":"to get the price down to here but when"},{"start":"361.52","dur":"2","text":"the buyers stepped in they erased all of"},{"start":"363.52","dur":"2.16","text":"that work that the sellers did within a"},{"start":"365.68","dur":"2.079","text":"couple of candles so in essence it took"},{"start":"367.759","dur":"2.72","text":"sellers 22 candles to get down to this"},{"start":"370.479","dur":"2.16","text":"point while the buyers did the same"},{"start":"372.639","dur":"2.4","text":"amount of work within four candles so"},{"start":"375.039","dur":"2.401","text":"that's very important to understand so"},{"start":"377.44","dur":"1.68","text":"knowing that buyers are showing more"},{"start":"379.12","dur":"2.16","text":"strength we can expect the buyers to"},{"start":"381.28","dur":"2","text":"continue this control and keep moving"},{"start":"383.28","dur":"2.16","text":"the price upward which is exactly what"},{"start":"385.44","dur":"1.92","text":"happened since price started a strong"},{"start":"387.36","dur":"2.08","text":"upwards move from this point we can call"},{"start":"389.44","dur":"2.64","text":"this area our area of demand we can mark"},{"start":"392.08","dur":"1.92","text":"this area of demand by marking the low"},{"start":"394","dur":"2.24","text":"of the candle that started that move to"},{"start":"396.24","dur":"2.399","text":"the high of that same candle this is our"},{"start":"398.639","dur":"2.081","text":"area of demand and shows buyers are"},{"start":"400.72","dur":"1.919","text":"starting to get interested once price"},{"start":"402.639","dur":"2.481","text":"reaches this area so we'll also keep"},{"start":"405.12","dur":"2.079","text":"that in mind for later the price ends up"},{"start":"407.199","dur":"2","text":"moving up a bit more and then this"},{"start":"409.199","dur":"2.56","text":"candle gets printed a red control shift"},{"start":"411.759","dur":"2.241","text":"candle with a large upper wick this is"},{"start":"414","dur":"1.68","text":"saying buyers try to raise the price"},{"start":"415.68","dur":"2.32","text":"higher but sellers came in and brought"},{"start":"418","dur":"2.319","text":"the price back down showing sellers have"},{"start":"420.319","dur":"2.401","text":"control up here directly after that we"},{"start":"422.72","dur":"1.84","text":"have a red strength candle meaning"},{"start":"424.56","dur":"2.24","text":"sellers are confident at this price and"},{"start":"426.8","dur":"2.08","text":"are ready to bring the price back down"},{"start":"428.88","dur":"1.759","text":"which is exactly what happens now that"},{"start":"430.639","dur":"2","text":"we have a strong move to the downside we"},{"start":"432.639","dur":"2.241","text":"can mark our area of supply to do this"},{"start":"434.88","dur":"1.759","text":"we find the start of a strong move"},{"start":"436.639","dur":"2.241","text":"downwards and mark the low to the high"},{"start":"438.88","dur":"2.159","text":"of the candle that started this move"},{"start":"441.039","dur":"2","text":"this is our area of supply and shows"},{"start":"443.039","dur":"1.921","text":"that sellers started to take control"},{"start":"444.96","dur":"2.72","text":"once price reaches this area so we'll"},{"start":"447.68","dur":"2.079","text":"also keep that in mind for later price"},{"start":"449.759","dur":"2.081","text":"continues to move down a bit from here"},{"start":"451.84","dur":"2.24","text":"so now we have this setup and this chart"},{"start":"454.08","dur":"2.399","text":"is telling a very clear and interesting"},{"start":"456.479","dur":"2.081","text":"story first look at the speed the buyers"},{"start":"458.56","dur":"1.919","text":"got the price up they got the price up"},{"start":"460.479","dur":"2.321","text":"extremely quick and within only a couple"},{"start":"462.8","dur":"1.92","text":"of candles while the sellers still got"},{"start":"464.72","dur":"2.16","text":"the price back down but the move is much"},{"start":"466.88","dur":"2.319","text":"slower and took them a lot of candles to"},{"start":"469.199","dur":"2.081","text":"get the price back down so right off the"},{"start":"471.28","dur":"1.919","text":"rip we can see the buyers have more"},{"start":"473.199","dur":"1.921","text":"control during this time another key"},{"start":"475.12","dur":"1.919","text":"thing to note price has just hit our"},{"start":"477.039","dur":"2.16","text":"area of demand which like I said before"},{"start":"479.199","dur":"2.081","text":"a massive amount of buyers stepped into"},{"start":"481.28","dur":"2.24","text":"this area before and we can expect them"},{"start":"483.52","dur":"2.239","text":"to do the same thing here another key"},{"start":"485.759","dur":"1.521","text":"point is while touching this area of"},{"start":"487.28","dur":"2.4","text":"demand a green control shift candle was"},{"start":"489.68","dur":"1.919","text":"printed meaning sellers tried to drive"},{"start":"491.599","dur":"2.401","text":"the price down below our area of demand"},{"start":"494","dur":"2","text":"but just like before buyers stepped in"},{"start":"496","dur":"2.319","text":"by the masses and took control and drove"},{"start":"498.319","dur":"2.241","text":"the price back up not only that but"},{"start":"500.56","dur":"1.759","text":"after this control shift candle was"},{"start":"502.319","dur":"2.241","text":"printed a green strength candle was"},{"start":"504.56","dur":"2.479","text":"printed directly after showing even more"},{"start":"507.039","dur":"2.321","text":"signs of buyer momentum so now it's"},{"start":"509.36","dur":"1.76","text":"pretty clear that buyers have complete"},{"start":"511.12","dur":"2","text":"control so now we have to take advantage"},{"start":"513.12","dur":"2.479","text":"of this and find a place to enter to do"},{"start":"515.599","dur":"1.44","text":"this we're going to wait for price to"},{"start":"517.039","dur":"1.761","text":"come back down to our control shift"},{"start":"518.8","dur":"1.919","text":"candle which is exactly what happened"},{"start":"520.719","dur":"2.56","text":"not only that it printed another control"},{"start":"523.279","dur":"2.481","text":"shift candle which is another great sign"},{"start":"525.76","dur":"1.84","text":"we enter once price hits our control"},{"start":"527.6","dur":"2.239","text":"shift candle set our takerit at the area"},{"start":"529.839","dur":"1.921","text":"of supply where sellers started to take"},{"start":"531.76","dur":"2.24","text":"control then set our stop-loss right"},{"start":"534","dur":"2.16","text":"below our original area of demand with"},{"start":"536.16","dur":"2.16","text":"this setup there's no guessing we have"},{"start":"538.32","dur":"2.16","text":"analyzed the chart and found areas where"},{"start":"540.48","dur":"2.32","text":"buyers and sellers have complete control"},{"start":"542.8","dur":"1.44","text":"and just like that price hits our"},{"start":"544.24","dur":"2.159","text":"takerit just like we expected but with"},{"start":"546.399","dur":"1.921","text":"all that said there's a key thing you"},{"start":"548.32","dur":"2","text":"should understand you should never enter"},{"start":"550.32","dur":"2.4","text":"purely based on a candle for example you"},{"start":"552.72","dur":"2","text":"shouldn't enter purely just because you"},{"start":"554.72","dur":"1.92","text":"see a green strength candle that will"},{"start":"556.64","dur":"2.56","text":"not work in the long run instead use"},{"start":"559.2","dur":"2.16","text":"these candles as like a book telling a"},{"start":"561.36","dur":"1.68","text":"story you need to find multiple"},{"start":"563.04","dur":"2.479","text":"correlations and find areas where buyers"},{"start":"565.519","dur":"2.401","text":"and sellers show complete control based"},{"start":"567.92","dur":"2","text":"off their candlestick once you find that"},{"start":"569.92","dur":"2.08","text":"you can easily identify the zones where"},{"start":"572","dur":"2.08","text":"buyers are likely to win and where"},{"start":"574.08","dur":"2","text":"sellers are likely to win implement this"},{"start":"576.08","dur":"1.84","text":"in your trading and you will instantly"},{"start":"577.92","dur":"2","text":"see your take-profits getting hit way"},{"start":"579.92","dur":"2.88","text":"more often"}]}]}]